{"name": "Class AbstractSelectableChannel", "module": "java.base", "package": "java.nio.channels.spi", "text": "Base implementation class for selectable channels.\n\n  This class defines methods that handle the mechanics of channel\n registration, deregistration, and closing.  It maintains the current\n blocking mode of this channel as well as its current set of selection keys.\n It performs all of the synchronization required to implement the SelectableChannel specification.  Implementations of the\n abstract protected methods defined in this class need not synchronize\n against other threads that might be engaged in the same operations.  ", "codes": ["public abstract class AbstractSelectableChannel\nextends SelectableChannel"], "fields": [], "methods": [{"method_name": "provider", "method_sig": "public final SelectorProvider provider()", "description": "Returns the provider that created this channel."}, {"method_name": "register", "method_sig": "public final SelectionKey register (Selector sel,\n                                   int ops,\n                                   Object att)\n                            throws ClosedChannelException", "description": "Registers this channel with the given selector, returning a selection key.\n\n   This method first verifies that this channel is open and that the\n given initial interest set is valid.\n\n  If this channel is already registered with the given selector then\n the selection key representing that registration is returned after\n setting its interest set to the given value.\n\n  Otherwise this channel has not yet been registered with the given\n selector, so the register method of\n the selector is invoked while holding the appropriate locks.  The\n resulting key is added to this channel's key set before being returned.\n "}, {"method_name": "implCloseChannel", "method_sig": "protected final void implCloseChannel()\n                               throws IOException", "description": "Closes this channel.\n\n  This method, which is specified in the AbstractInterruptibleChannel class and is invoked by the close method, in turn invokes the\n implCloseSelectableChannel method in\n order to perform the actual work of closing this channel.  It then\n cancels all of this channel's keys.  "}, {"method_name": "implCloseSelectableChannel", "method_sig": "protected abstract void implCloseSelectableChannel()\n                                            throws IOException", "description": "Closes this selectable channel.\n\n  This method is invoked by the close method in order to perform the actual work of closing the\n channel.  This method is only invoked if the channel has not yet been\n closed, and it is never invoked more than once.\n\n  An implementation of this method must arrange for any other thread\n that is blocked in an I/O operation upon this channel to return\n immediately, either by throwing an exception or by returning normally.\n "}, {"method_name": "configureBlocking", "method_sig": "public final SelectableChannel configureBlocking (boolean block)\n                                          throws IOException", "description": "Adjusts this channel's blocking mode.\n\n  If the given blocking mode is different from the current blocking\n mode then this method invokes the implConfigureBlocking method, while holding the appropriate locks, in\n order to change the mode.  "}, {"method_name": "implConfigureBlocking", "method_sig": "protected abstract void implConfigureBlocking (boolean block)\n                                       throws IOException", "description": "Adjusts this channel's blocking mode.\n\n  This method is invoked by the configureBlocking method in order to perform the actual work of\n changing the blocking mode.  This method is only invoked if the new mode\n is different from the current mode.  "}]}