{"name": "Class AccessibleState", "module": "java.desktop", "package": "javax.accessibility", "text": "Class AccessibleState describes a component's particular state. The\n actual state of the component is defined as an AccessibleStateSet,\n which is a composed set of AccessibleStates.\n \n The AccessibleBundle.toDisplayString() method allows you to obtain the localized\n string for a locale independent key from a predefined ResourceBundle\n for the keys defined in this class.\n \n The constants in this class present a strongly typed enumeration of common\n object roles. A public constructor for this class has been purposely omitted\n and applications should use one of the constants from this class. If the\n constants in this class are not sufficient to describe the role of an object,\n a subclass should be generated from this class and it should provide\n constants in a similar manner.", "codes": ["public class AccessibleState\nextends AccessibleBundle"], "fields": [{"field_name": "ACTIVE", "field_sig": "public static final AccessibleState ACTIVE", "description": "Indicates a window is currently the active window. This includes windows,\n dialogs, frames, etc. In addition, this state is used to indicate the\n currently active child of a component such as a list, table, or tree. For\n example, the active child of a list is the child that is drawn with a\n rectangle around it."}, {"field_name": "PRESSED", "field_sig": "public static final AccessibleState PRESSED", "description": "Indicates this object is currently pressed. This is usually associated\n with buttons and indicates the user has pressed a mouse button while the\n pointer was over the button and has not yet released the mouse button."}, {"field_name": "ARMED", "field_sig": "public static final AccessibleState ARMED", "description": "Indicates that the object is armed. This is usually used on buttons that\n have been pressed but not yet released, and the mouse pointer is still\n over the button."}, {"field_name": "BUSY", "field_sig": "public static final AccessibleState BUSY", "description": "Indicates the current object is busy. This is usually used on objects\n such as progress bars, sliders, or scroll bars to indicate they are in a\n state of transition."}, {"field_name": "CHECKED", "field_sig": "public static final AccessibleState CHECKED", "description": "Indicates this object is currently checked. This is usually used on\n objects such as toggle buttons, radio buttons, and check boxes."}, {"field_name": "EDITABLE", "field_sig": "public static final AccessibleState EDITABLE", "description": "Indicates the user can change the contents of this object. This is\n usually used primarily for objects that allow the user to enter text.\n Other objects, such as scroll bars and sliders, are automatically\n editable if they are enabled."}, {"field_name": "EXPANDABLE", "field_sig": "public static final AccessibleState EXPANDABLE", "description": "Indicates this object allows progressive disclosure of its children. This\n is usually used with hierarchical objects such as trees and is often\n paired with the EXPANDED or COLLAPSED states."}, {"field_name": "COLLAPSED", "field_sig": "public static final AccessibleState COLLAPSED", "description": "Indicates this object is collapsed. This is usually paired with the\n EXPANDABLE state and is used on objects that provide progressive\n disclosure such as trees."}, {"field_name": "EXPANDED", "field_sig": "public static final AccessibleState EXPANDED", "description": "Indicates this object is expanded. This is usually paired with the\n EXPANDABLE state and is used on objects that provide progressive\n disclosure such as trees."}, {"field_name": "ENABLED", "field_sig": "public static final AccessibleState ENABLED", "description": "Indicates this object is enabled. The absence of this state from an\n object's state set indicates this object is not enabled. An object that\n is not enabled cannot be manipulated by the user. In a graphical display,\n it is usually grayed out."}, {"field_name": "FOCUSABLE", "field_sig": "public static final AccessibleState FOCUSABLE", "description": "Indicates this object can accept keyboard focus, which means all events\n resulting from typing on the keyboard will normally be passed to it when\n it has focus."}, {"field_name": "FOCUSED", "field_sig": "public static final AccessibleState FOCUSED", "description": "Indicates this object currently has the keyboard focus."}, {"field_name": "ICONIFIED", "field_sig": "public static final AccessibleState ICONIFIED", "description": "Indicates this object is minimized and is represented only by an icon.\n This is usually only associated with frames and internal frames."}, {"field_name": "MODAL", "field_sig": "public static final AccessibleState MODAL", "description": "Indicates something must be done with this object before the user can\n interact with an object in a different window. This is usually associated\n only with dialogs."}, {"field_name": "OPAQUE", "field_sig": "public static final AccessibleState OPAQUE", "description": "Indicates this object paints every pixel within its rectangular region. A\n non-opaque component paints only some of its pixels, allowing the pixels\n underneath it to \"show through\". A component that does not fully paint\n its pixels therefore provides a degree of transparency."}, {"field_name": "RESIZABLE", "field_sig": "public static final AccessibleState RESIZABLE", "description": "Indicates the size of this object is not fixed."}, {"field_name": "MULTISELECTABLE", "field_sig": "public static final AccessibleState MULTISELECTABLE", "description": "Indicates this object allows more than one of its children to be selected\n at the same time."}, {"field_name": "SELECTABLE", "field_sig": "public static final AccessibleState SELECTABLE", "description": "Indicates this object is the child of an object that allows its children\n to be selected, and that this child is one of those children that can be\n selected."}, {"field_name": "SELECTED", "field_sig": "public static final AccessibleState SELECTED", "description": "Indicates this object is the child of an object that allows its children\n to be selected, and that this child is one of those children that has\n been selected."}, {"field_name": "SHOWING", "field_sig": "public static final AccessibleState SHOWING", "description": "Indicates this object, the object's parent, the object's parent's parent,\n and so on, are all visible. Note that this does not necessarily mean the\n object is painted on the screen. It might be occluded by some other\n showing object."}, {"field_name": "VISIBLE", "field_sig": "public static final AccessibleState VISIBLE", "description": "Indicates this object is visible. Note: this means that the object\n intends to be visible; however, it may not in fact be showing on the\n screen because one of the objects that this object is contained by is not\n visible."}, {"field_name": "VERTICAL", "field_sig": "public static final AccessibleState VERTICAL", "description": "Indicates the orientation of this object is vertical. This is usually\n associated with objects such as scrollbars, sliders, and progress bars."}, {"field_name": "HORIZONTAL", "field_sig": "public static final AccessibleState HORIZONTAL", "description": "Indicates the orientation of this object is horizontal. This is usually\n associated with objects such as scrollbars, sliders, and progress bars."}, {"field_name": "SINGLE_LINE", "field_sig": "public static final AccessibleState SINGLE_LINE", "description": "Indicates this (text) object can contain only a single line of text."}, {"field_name": "MULTI_LINE", "field_sig": "public static final AccessibleState MULTI_LINE", "description": "Indicates this (text) object can contain multiple lines of text."}, {"field_name": "TRANSIENT", "field_sig": "public static final AccessibleState TRANSIENT", "description": "Indicates this object is transient. An assistive technology should not\n add a PropertyChange listener to an object with transient state,\n as that object will never generate any events. Transient objects are\n typically created to answer Java Accessibility method queries, but\n otherwise do not remain linked to the underlying object (for example,\n those objects underneath lists, tables, and trees in Swing, where only\n one actual UI Component does shared rendering duty for all of the\n data objects underneath the actual list/table/tree elements)."}, {"field_name": "MANAGES_DESCENDANTS", "field_sig": "public static final AccessibleState MANAGES_DESCENDANTS", "description": "Indicates this object is responsible for managing its subcomponents. This\n is typically used for trees and tables that have a large number of\n subcomponents and where the objects are created only when needed and\n otherwise remain virtual. The application should not manage the\n subcomponents directly."}, {"field_name": "INDETERMINATE", "field_sig": "public static final AccessibleState INDETERMINATE", "description": "Indicates that the object state is indeterminate. An example is selected\n text that is partially bold and partially not bold. In this case the\n attributes associated with the selected text are indeterminate."}, {"field_name": "TRUNCATED", "field_sig": "public static final AccessibleState TRUNCATED", "description": "A state indicating that text is truncated by a bounding rectangle and\n that some of the text is not displayed on the screen. An example is text\n in a spreadsheet cell that is truncated by the bounds of the cell."}], "methods": []}