{"name": "Class AccessibleContext", "module": "java.desktop", "package": "javax.accessibility", "text": "AccessibleContext represents the minimum information all accessible\n objects return. This information includes the accessible name, description,\n role, and state of the object, as well as information about its parent and\n children. AccessibleContext also contains methods for obtaining more\n specific accessibility information about a component. If the component\n supports them, these methods will return an object that implements one or\n more of the following interfaces:\n \nAccessibleAction - the object can perform one or more actions.\n   This interface provides the standard mechanism for an assistive technology\n   to determine what those actions are and tell the object to perform them.\n   Any object that can be manipulated should support this interface.\n   AccessibleComponent - the object has a graphical\n   representation. This interface provides the standard mechanism for an\n   assistive technology to determine and set the graphical representation of\n   the object. Any object that is rendered on the screen should support this\n   interface.\n   AccessibleSelection - the object allows its children to be\n   selected. This interface provides the standard mechanism for an assistive\n   technology to determine the currently selected children of the object as\n   well as modify its selection set. Any object that has children that can be\n   selected should support this interface.\n   AccessibleText - the object presents editable textual\n   information on the display. This interface provides the standard mechanism\n   for an assistive technology to access that text via its content,\n   attributes, and spatial location. Any object that contains editable text\n   should support this interface.\n   AccessibleValue - the object supports a numerical value. This\n   interface provides the standard mechanism for an assistive technology to\n   determine and set the current value of the object, as well as obtain its\n   minimum and maximum values. Any object that supports a numerical value\n   should support this interface.\n ", "codes": ["@JavaBean(description=\"Minimal information that all accessible objects return\")\npublic abstract class AccessibleContext\nextends Object"], "fields": [{"field_name": "ACCESSIBLE_NAME_PROPERTY", "field_sig": "public static final String ACCESSIBLE_NAME_PROPERTY", "description": "Constant used to determine when the accessibleName property has\n changed. The old value in the PropertyChangeEvent will be the old\n accessibleName and the new value will be the new\n accessibleName."}, {"field_name": "ACCESSIBLE_DESCRIPTION_PROPERTY", "field_sig": "public static final String ACCESSIBLE_DESCRIPTION_PROPERTY", "description": "Constant used to determine when the accessibleDescription\n property has changed. The old value in the PropertyChangeEvent\n will be the old accessibleDescription and the new value will be\n the new accessibleDescription."}, {"field_name": "ACCESSIBLE_STATE_PROPERTY", "field_sig": "public static final String ACCESSIBLE_STATE_PROPERTY", "description": "Constant used to determine when the accessibleStateSet property\n has changed. The old value will be the old AccessibleState and\n the new value will be the new AccessibleState in the\n accessibleStateSet. For example, if a component that supports the\n vertical and horizontal states changes its orientation from vertical to\n horizontal, the old value will be AccessibleState.VERTICAL and\n the new value will be AccessibleState.HORIZONTAL. Please note\n that either value can also be null. For example, when a component\n changes from being enabled to disabled, the old value will be\n AccessibleState.ENABLED and the new value will be null."}, {"field_name": "ACCESSIBLE_VALUE_PROPERTY", "field_sig": "public static final String ACCESSIBLE_VALUE_PROPERTY", "description": "Constant used to determine when the accessibleValue property has\n changed. The old value in the PropertyChangeEvent will be a\n Number representing the old value and the new value will be a\n Number representing the new value."}, {"field_name": "ACCESSIBLE_SELECTION_PROPERTY", "field_sig": "public static final String ACCESSIBLE_SELECTION_PROPERTY", "description": "Constant used to determine when the accessibleSelection has\n changed. The old and new values in the PropertyChangeEvent are\n currently reserved for future use."}, {"field_name": "ACCESSIBLE_CARET_PROPERTY", "field_sig": "public static final String ACCESSIBLE_CARET_PROPERTY", "description": "Constant used to determine when the accessibleText caret has\n changed. The old value in the PropertyChangeEvent will be an\n integer representing the old caret position, and the new value will be an\n integer representing the new/current caret position."}, {"field_name": "ACCESSIBLE_VISIBLE_DATA_PROPERTY", "field_sig": "public static final String ACCESSIBLE_VISIBLE_DATA_PROPERTY", "description": "Constant used to determine when the visual appearance of the object has\n changed. The old and new values in the PropertyChangeEvent are\n currently reserved for future use."}, {"field_name": "ACCESSIBLE_CHILD_PROPERTY", "field_sig": "public static final String ACCESSIBLE_CHILD_PROPERTY", "description": "Constant used to determine when Accessible children are\n added/removed from the object. If an Accessible child is being\n added, the old value will be null and the new value will be the\n Accessible child. If an Accessible child is being\n removed, the old value will be the Accessible child, and the new\n value will be null."}, {"field_name": "ACCESSIBLE_ACTIVE_DESCENDANT_PROPERTY", "field_sig": "public static final String ACCESSIBLE_ACTIVE_DESCENDANT_PROPERTY", "description": "Constant used to determine when the active descendant of a component has\n changed. The active descendant is used for objects such as list, tree,\n and table, which may have transient children. When the active descendant\n has changed, the old value of the property change event will be the\n Accessible representing the previous active child, and the new\n value will be the Accessible representing the current active\n child."}, {"field_name": "ACCESSIBLE_TABLE_CAPTION_CHANGED", "field_sig": "public static final String ACCESSIBLE_TABLE_CAPTION_CHANGED", "description": "Constant used to indicate that the table caption has changed. The old\n value in the PropertyChangeEvent will be an Accessible\n representing the previous table caption and the new value will be an\n Accessible representing the new table caption."}, {"field_name": "ACCESSIBLE_TABLE_SUMMARY_CHANGED", "field_sig": "public static final String ACCESSIBLE_TABLE_SUMMARY_CHANGED", "description": "Constant used to indicate that the table summary has changed. The old\n value in the PropertyChangeEvent will be an Accessible\n representing the previous table summary and the new value will be an\n Accessible representing the new table summary."}, {"field_name": "ACCESSIBLE_TABLE_MODEL_CHANGED", "field_sig": "public static final String ACCESSIBLE_TABLE_MODEL_CHANGED", "description": "Constant used to indicate that table data has changed. The old value in\n the PropertyChangeEvent will be null and the new value\n will be an AccessibleTableModelChange representing the table\n change."}, {"field_name": "ACCESSIBLE_TABLE_ROW_HEADER_CHANGED", "field_sig": "public static final String ACCESSIBLE_TABLE_ROW_HEADER_CHANGED", "description": "Constant used to indicate that the row header has changed. The old value\n in the PropertyChangeEvent will be null and the new value\n will be an AccessibleTableModelChange representing the header\n change."}, {"field_name": "ACCESSIBLE_TABLE_ROW_DESCRIPTION_CHANGED", "field_sig": "public static final String ACCESSIBLE_TABLE_ROW_DESCRIPTION_CHANGED", "description": "Constant used to indicate that the row description has changed. The old\n value in the PropertyChangeEvent will be null and the new\n value will be an Integer representing the row index."}, {"field_name": "ACCESSIBLE_TABLE_COLUMN_HEADER_CHANGED", "field_sig": "public static final String ACCESSIBLE_TABLE_COLUMN_HEADER_CHANGED", "description": "Constant used to indicate that the column header has changed. The old\n value in the PropertyChangeEvent will be null and the new\n value will be an AccessibleTableModelChange representing the\n header change."}, {"field_name": "ACCESSIBLE_TABLE_COLUMN_DESCRIPTION_CHANGED", "field_sig": "public static final String ACCESSIBLE_TABLE_COLUMN_DESCRIPTION_CHANGED", "description": "Constant used to indicate that the column description has changed. The\n old value in the PropertyChangeEvent will be null and the\n new value will be an Integer representing the column index."}, {"field_name": "ACCESSIBLE_ACTION_PROPERTY", "field_sig": "public static final String ACCESSIBLE_ACTION_PROPERTY", "description": "Constant used to indicate that the supported set of actions has changed.\n The old value in the PropertyChangeEvent will be an\n Integer representing the old number of actions supported and the\n new value will be an Integer representing the new number of\n actions supported."}, {"field_name": "ACCESSIBLE_HYPERTEXT_OFFSET", "field_sig": "public static final String ACCESSIBLE_HYPERTEXT_OFFSET", "description": "Constant used to indicate that a hypertext element has received focus.\n The old value in the PropertyChangeEvent will be an\n Integer representing the start index in the document of the\n previous element that had focus and the new value will be an\n Integer representing the start index in the document of the\n current element that has focus. A value of -1 indicates that an element\n does not or did not have focus."}, {"field_name": "ACCESSIBLE_TEXT_PROPERTY", "field_sig": "public static final String ACCESSIBLE_TEXT_PROPERTY", "description": "PropertyChangeEvent which indicates that text has changed.\n \n For text insertion, the oldValue is null and the\n newValue is an AccessibleTextSequence specifying the text\n that was inserted.\n \n For text deletion, the oldValue is an\n AccessibleTextSequence specifying the text that was deleted and\n the newValue is null.\n \n For text replacement, the oldValue is an\n AccessibleTextSequence specifying the old text and the\n newValue is an AccessibleTextSequence specifying the new\n text."}, {"field_name": "ACCESSIBLE_INVALIDATE_CHILDREN", "field_sig": "public static final String ACCESSIBLE_INVALIDATE_CHILDREN", "description": "PropertyChangeEvent which indicates that a significant change has\n occurred to the children of a component like a tree or text. This change\n notifies the event listener that it needs to reacquire the state of the\n subcomponents. The oldValue is null and the\n newValue is the component whose children have become invalid."}, {"field_name": "ACCESSIBLE_TEXT_ATTRIBUTES_CHANGED", "field_sig": "public static final String ACCESSIBLE_TEXT_ATTRIBUTES_CHANGED", "description": "PropertyChangeEvent which indicates that text attributes have\n changed.\n \n For attribute insertion, the oldValue is null and the\n newValue is an AccessibleAttributeSequence specifying the\n attributes that were inserted.\n \n For attribute deletion, the oldValue is an\n AccessibleAttributeSequence specifying the attributes that were\n deleted and the newValue is null.\n \n For attribute replacement, the oldValue is an\n AccessibleAttributeSequence specifying the old attributes and the\n newValue is an AccessibleAttributeSequence specifying the\n new attributes."}, {"field_name": "ACCESSIBLE_COMPONENT_BOUNDS_CHANGED", "field_sig": "public static final String ACCESSIBLE_COMPONENT_BOUNDS_CHANGED", "description": "PropertyChangeEvent which indicates that a change has occurred in\n a component's bounds. The oldValue is the old component bounds\n and the newValue is the new component bounds."}, {"field_name": "accessibleParent", "field_sig": "protected Accessible accessibleParent", "description": "The accessible parent of this object."}, {"field_name": "accessibleName", "field_sig": "protected String accessibleName", "description": "A localized String containing the name of the object."}, {"field_name": "accessibleDescription", "field_sig": "protected String accessibleDescription", "description": "A localized String containing the description of the object."}], "methods": [{"method_name": "getAccessibleName", "method_sig": "public String getAccessibleName()", "description": "Gets the accessibleName property of this object. The\n accessibleName property of an object is a localized\n String that designates the purpose of the object. For example,\n the accessibleName property of a label or button might be the\n text of the label or button itself. In the case of an object that doesn't\n display its name, the accessibleName should still be set. For\n example, in the case of a text field used to enter the name of a city,\n the accessibleName for the en_US locale could be 'city.'"}, {"method_name": "setAccessibleName", "method_sig": "@BeanProperty(preferred=true,\n              description=\"Sets the accessible name for the component.\")\npublic void setAccessibleName (String s)", "description": "Sets the localized accessible name of this object. Changing the name will\n cause a PropertyChangeEvent to be fired for the\n ACCESSIBLE_NAME_PROPERTY property."}, {"method_name": "getAccessibleDescription", "method_sig": "public String getAccessibleDescription()", "description": "Gets the accessibleDescription property of this object. The\n accessibleDescription property of this object is a short\n localized phrase describing the purpose of the object. For example, in\n the case of a 'Cancel' button, the accessibleDescription could be\n 'Ignore changes and close dialog box.'"}, {"method_name": "setAccessibleDescription", "method_sig": "@BeanProperty(preferred=true,\n              description=\"Sets the accessible description for the component.\")\npublic void setAccessibleDescription (String s)", "description": "Sets the accessible description of this object. Changing the name will\n cause a PropertyChangeEvent to be fired for the\n ACCESSIBLE_DESCRIPTION_PROPERTY property."}, {"method_name": "getAccessibleRole", "method_sig": "public abstract AccessibleRole getAccessibleRole()", "description": "Gets the role of this object. The role of the object is the generic\n purpose or use of the class of this object. For example, the role of a\n push button is AccessibleRole.PUSH_BUTTON. The roles in\n AccessibleRole are provided so component developers can pick from\n a set of predefined roles. This enables assistive technologies to provide\n a consistent interface to various tweaked subclasses of components (e.g.,\n use AccessibleRole.PUSH_BUTTON for all components that act like a\n push button) as well as distinguish between subclasses that behave\n differently (e.g., AccessibleRole.CHECK_BOX for check boxes and\n AccessibleRole.RADIO_BUTTON for radio buttons).\n \n Note that the AccessibleRole class is also extensible, so custom\n component developers can define their own AccessibleRole's if the\n set of predefined roles is inadequate."}, {"method_name": "getAccessibleStateSet", "method_sig": "public abstract AccessibleStateSet getAccessibleStateSet()", "description": "Gets the state set of this object. The AccessibleStateSet of an\n object is composed of a set of unique AccessibleStates. A change\n in the AccessibleStateSet of an object will cause a\n PropertyChangeEvent to be fired for the\n ACCESSIBLE_STATE_PROPERTY property."}, {"method_name": "getAccessibleParent", "method_sig": "public Accessible getAccessibleParent()", "description": "Gets the Accessible parent of this object."}, {"method_name": "setAccessibleParent", "method_sig": "public void setAccessibleParent (Accessible a)", "description": "Sets the Accessible parent of this object. This is meant to be\n used only in the situations where the actual component's parent should\n not be treated as the component's accessible parent and is a method that\n should only be called by the parent of the accessible child."}, {"method_name": "getAccessibleIndexInParent", "method_sig": "public abstract int getAccessibleIndexInParent()", "description": "Gets the 0-based index of this object in its accessible parent."}, {"method_name": "getAccessibleChildrenCount", "method_sig": "public abstract int getAccessibleChildrenCount()", "description": "Returns the number of accessible children of the object."}, {"method_name": "getAccessibleChild", "method_sig": "public abstract Accessible getAccessibleChild (int i)", "description": "Returns the specified Accessible child of the object. The\n Accessible children of an Accessible object are\n zero-based, so the first child of an Accessible child is at index\n 0, the second child is at index 1, and so on."}, {"method_name": "getLocale", "method_sig": "public abstract Locale getLocale()\n                          throws IllegalComponentStateException", "description": "Gets the locale of the component. If the component does not have a\n locale, then the locale of its parent is returned."}, {"method_name": "addPropertyChangeListener", "method_sig": "public void addPropertyChangeListener (PropertyChangeListener listener)", "description": "Adds a PropertyChangeListener to the listener list. The listener\n is registered for all Accessible properties and will be called\n when those properties change."}, {"method_name": "removePropertyChangeListener", "method_sig": "public void removePropertyChangeListener (PropertyChangeListener listener)", "description": "Removes a PropertyChangeListener from the listener list. This\n removes a PropertyChangeListener that was registered for all\n properties."}, {"method_name": "getAccessibleAction", "method_sig": "public AccessibleAction getAccessibleAction()", "description": "Gets the AccessibleAction associated with this object that\n supports one or more actions."}, {"method_name": "getAccessibleComponent", "method_sig": "public AccessibleComponent getAccessibleComponent()", "description": "Gets the AccessibleComponent associated with this object that has\n a graphical representation."}, {"method_name": "getAccessibleSelection", "method_sig": "public AccessibleSelection getAccessibleSelection()", "description": "Gets the AccessibleSelection associated with this object which\n allows its Accessible children to be selected."}, {"method_name": "getAccessibleText", "method_sig": "public AccessibleText getAccessibleText()", "description": "Gets the AccessibleText associated with this object presenting\n text on the display."}, {"method_name": "getAccessibleEditableText", "method_sig": "public AccessibleEditableText getAccessibleEditableText()", "description": "Gets the AccessibleEditableText associated with this object\n presenting editable text on the display."}, {"method_name": "getAccessibleValue", "method_sig": "public AccessibleValue getAccessibleValue()", "description": "Gets the AccessibleValue associated with this object that\n supports a Numerical value."}, {"method_name": "getAccessibleIcon", "method_sig": "public AccessibleIcon[] getAccessibleIcon()", "description": "Gets the AccessibleIcons associated with an object that has one\n or more associated icons."}, {"method_name": "getAccessibleRelationSet", "method_sig": "public AccessibleRelationSet getAccessibleRelationSet()", "description": "Gets the AccessibleRelationSet associated with an object."}, {"method_name": "getAccessibleTable", "method_sig": "public AccessibleTable getAccessibleTable()", "description": "Gets the AccessibleTable associated with an object."}, {"method_name": "firePropertyChange", "method_sig": "public void firePropertyChange (String propertyName,\n                               Object oldValue,\n                               Object newValue)", "description": "Support for reporting bound property changes. If oldValue and\n newValue are not equal and the PropertyChangeEvent\n listener list is not empty, then fire a PropertyChange event to\n each listener. In general, this is for use by the Accessible\n objects themselves and should not be called by an application program."}]}