{"name": "Interface Acl", "module": "java.base", "package": "java.security.acl", "text": "Interface representing an Access Control List (ACL).  An Access\n Control List is a data structure used to guard access to\n resources.\n\n An ACL can be thought of as a data structure with multiple ACL\n entries.  Each ACL entry, of interface type AclEntry, contains a\n set of permissions associated with a particular principal. (A\n principal represents an entity such as an individual user or a\n group). Additionally, each ACL entry is specified as being either\n positive or negative. If positive, the permissions are to be\n granted to the associated principal. If negative, the permissions\n are to be denied.\n\n The ACL Entries in each ACL observe the following rules:\n\n  Each principal can have at most one positive ACL entry and\n one negative entry; that is, multiple positive or negative ACL\n entries are not allowed for any principal.  Each entry specifies\n the set of permissions that are to be granted (if positive) or\n denied (if negative).\n\n If there is no entry for a particular principal, then the\n principal is considered to have a null (empty) permission set.\n\n If there is a positive entry that grants a principal a\n particular permission, and a negative entry that denies the\n principal the same permission, the result is as though the\n permission was never granted or denied.\n\n Individual permissions always override permissions of the\n group(s) to which the individual belongs. That is, individual\n negative permissions (specific denial of permissions) override the\n groups' positive permissions. And individual positive permissions\n override the groups' negative permissions.\n\n \n\n The  java.security.acl  package provides the\n interfaces to the ACL and related data structures (ACL entries,\n groups, permissions, etc.).\n\n The  java.security.acl.Acl  interface extends the\n  java.security.acl.Owner  interface. The Owner\n interface is used to maintain a list of owners for each ACL.  Only\n owners are allowed to modify an ACL. For example, only an owner can\n call the ACL's addEntry method to add a new ACL entry\n to the ACL.", "codes": ["@Deprecated(since=\"9\",\n            forRemoval=true)\npublic interface Acl\nextends Owner"], "fields": [], "methods": [{"method_name": "setName", "method_sig": "void setName (Principal caller,\n             String name)\n      throws NotOwnerException", "description": "Sets the name of this ACL."}, {"method_name": "getName", "method_sig": "String getName()", "description": "Returns the name of this ACL."}, {"method_name": "addEntry", "method_sig": "boolean addEntry (Principal caller,\n                 AclEntry entry)\n          throws NotOwnerException", "description": "Adds an ACL entry to this ACL. An entry associates a principal\n (e.g., an individual or a group) with a set of\n permissions. Each principal can have at most one positive ACL\n entry (specifying permissions to be granted to the principal)\n and one negative ACL entry (specifying permissions to be\n denied). If there is already an ACL entry of the same type\n (negative or positive) already in the ACL, false is returned."}, {"method_name": "removeEntry", "method_sig": "boolean removeEntry (Principal caller,\n                    AclEntry entry)\n             throws NotOwnerException", "description": "Removes an ACL entry from this ACL."}, {"method_name": "getPermissions", "method_sig": "Enumeration<Permission> getPermissions (Principal user)", "description": "Returns an enumeration for the set of allowed permissions for the\n specified principal (representing an entity such as an individual or\n a group). This set of allowed permissions is calculated as\n follows:\n\n \nIf there is no entry in this Access Control List for the\n specified principal, an empty permission set is returned.\n\n Otherwise, the principal's group permission sets are determined.\n (A principal can belong to one or more groups, where a group is a\n group of principals, represented by the Group interface.)\n The group positive permission set is the union of all\n the positive permissions of each group that the principal belongs to.\n The group negative permission set is the union of all\n the negative permissions of each group that the principal belongs to.\n If there is a specific permission that occurs in both\n the positive permission set and the negative permission set,\n it is removed from both.\n\n The individual positive and negative permission sets are also\n determined. The positive permission set contains the permissions\n specified in the positive ACL entry (if any) for the principal.\n Similarly, the negative permission set contains the permissions\n specified in the negative ACL entry (if any) for the principal.\n The individual positive (or negative) permission set is considered\n to be null if there is not a positive (negative) ACL entry for the\n principal in this ACL.\n\n The set of permissions granted to the principal is then calculated\n using the simple rule that individual permissions always override\n the group permissions. That is, the principal's individual negative\n permission set (specific denial of permissions) overrides the group\n positive permission set, and the principal's individual positive\n permission set overrides the group negative permission set.\n\n "}, {"method_name": "entries", "method_sig": "Enumeration<AclEntry> entries()", "description": "Returns an enumeration of the entries in this ACL. Each element in\n the enumeration is of type AclEntry."}, {"method_name": "checkPermission", "method_sig": "boolean checkPermission (Principal principal,\n                        Permission permission)", "description": "Checks whether or not the specified principal has the specified\n permission. If it does, true is returned, otherwise false is returned.\n\n More specifically, this method checks whether the passed permission\n is a member of the allowed permission set of the specified principal.\n The allowed permission set is determined by the same algorithm as is\n used by the getPermissions method."}, {"method_name": "toString", "method_sig": "String toString()", "description": "Returns a string representation of the\n ACL contents."}]}