{"name": "Interface Attributes", "module": "java.naming", "package": "javax.naming.directory", "text": "This interface represents a collection of attributes.\n\n In a directory, named objects can have associated with them\n attributes.  The Attributes interface represents a collection of attributes.\n For example, you can request from the directory the attributes\n associated with an object.  Those attributes are returned in\n an object that implements the Attributes interface.\n\n Attributes in an object that implements the  Attributes interface are\n unordered. The object can have zero or more attributes.\n Attributes is either case-sensitive or case-insensitive (case-ignore).\n This property is determined at the time the Attributes object is\n created. (see BasicAttributes constructor for example).\n In a case-insensitive Attributes, the case of its attribute identifiers\n is ignored when searching for an attribute, or adding attributes.\n In a case-sensitive Attributes, the case is significant.\n\n Note that updates to Attributes (such as adding or removing an attribute)\n do not affect the corresponding representation in the directory.\n Updates to the directory can only be effected\n using operations in the DirContext interface.", "codes": ["public interface Attributes\nextends Cloneable, Serializable"], "fields": [], "methods": [{"method_name": "isCaseIgnored", "method_sig": "boolean isCaseIgnored()", "description": "Determines whether the attribute set ignores the case of\n attribute identifiers when retrieving or adding attributes."}, {"method_name": "size", "method_sig": "int size()", "description": "Retrieves the number of attributes in the attribute set."}, {"method_name": "get", "method_sig": "Attribute get (String attrID)", "description": "Retrieves the attribute with the given attribute id from the\n attribute set."}, {"method_name": "getAll", "method_sig": "NamingEnumeration<? extends Attribute> getAll()", "description": "Retrieves an enumeration of the attributes in the attribute set.\n The effects of updates to this attribute set on this enumeration\n are undefined."}, {"method_name": "getIDs", "method_sig": "NamingEnumeration<String> getIDs()", "description": "Retrieves an enumeration of the ids of the attributes in the\n attribute set.\n The effects of updates to this attribute set on this enumeration\n are undefined."}, {"method_name": "put", "method_sig": "Attribute put (String attrID,\n              Object val)", "description": "Adds a new attribute to the attribute set."}, {"method_name": "put", "method_sig": "Attribute put (Attribute attr)", "description": "Adds a new attribute to the attribute set."}, {"method_name": "remove", "method_sig": "Attribute remove (String attrID)", "description": "Removes the attribute with the attribute id 'attrID' from\n the attribute set. If the attribute does not exist, ignore."}, {"method_name": "clone", "method_sig": "Object clone()", "description": "Makes a copy of the attribute set.\n The new set contains the same attributes as the original set:\n the attributes are not themselves cloned.\n Changes to the copy will not affect the original and vice versa."}]}