{"name": "Class AttributeList", "module": "java.management", "package": "javax.management", "text": "Represents a list of values for attributes of an MBean.  See the\n getAttributes and\n setAttributes methods of\n MBeanServer and MBeanServerConnection.\nFor compatibility reasons, it is possible, though\n highly discouraged, to add objects to an AttributeList that are\n not instances of Attribute.  However, an AttributeList\n can be made type-safe, which means that an attempt to add\n an object that is not an Attribute will produce an \n IllegalArgumentException.  An AttributeList becomes type-safe\n when the method asList() is called on it.", "codes": ["public class AttributeList\nextends ArrayList<Object>"], "fields": [], "methods": [{"method_name": "asList", "method_sig": "public List<Attribute> asList()", "description": "Return a view of this list as a List<Attribute>.\n Changes to the returned value are reflected by changes\n to the original AttributeList and vice versa."}, {"method_name": "add", "method_sig": "public void add (Attribute object)", "description": "Adds the Attribute specified as the last element of the list."}, {"method_name": "add", "method_sig": "public void add (int index,\n                Attribute object)", "description": "Inserts the attribute specified as an element at the position specified.\n Elements with an index greater than or equal to the current position are\n shifted up. If the index is out of range (index < 0 || index >\n size()) a RuntimeOperationsException should be raised, wrapping the\n java.lang.IndexOutOfBoundsException thrown."}, {"method_name": "set", "method_sig": "public void set (int index,\n                Attribute object)", "description": "Sets the element at the position specified to be the attribute specified.\n The previous element at that position is discarded. If the index is\n out of range (index < 0 || index > size()) a RuntimeOperationsException\n should be raised, wrapping the java.lang.IndexOutOfBoundsException thrown."}, {"method_name": "addAll", "method_sig": "public boolean addAll (AttributeList list)", "description": "Appends all the elements in the AttributeList specified to\n the end of the list, in the order in which they are returned by the\n Iterator of the AttributeList specified."}, {"method_name": "addAll", "method_sig": "public boolean addAll (int index,\n                      AttributeList list)", "description": "Inserts all of the elements in the AttributeList specified\n into this list, starting at the specified position, in the order in which\n they are returned by the Iterator of the AttributeList specified.\n If the index is out of range (index < 0 || index > size()) a\n RuntimeOperationsException should be raised, wrapping the\n java.lang.IndexOutOfBoundsException thrown."}, {"method_name": "add", "method_sig": "public boolean add (Object element)", "description": "Appends the specified element to the end of this list."}, {"method_name": "add", "method_sig": "public void add (int index,\n                Object element)", "description": "Inserts the specified element at the specified position in this\n list. Shifts the element currently at that position (if any) and\n any subsequent elements to the right (adds one to their indices)."}, {"method_name": "addAll", "method_sig": "public boolean addAll (Collection<?> c)", "description": "Appends all of the elements in the specified collection to the end of\n this list, in the order that they are returned by the\n specified collection's Iterator.  The behavior of this operation is\n undefined if the specified collection is modified while the operation\n is in progress.  (This implies that the behavior of this call is\n undefined if the specified collection is this list, and this\n list is nonempty.)"}, {"method_name": "addAll", "method_sig": "public boolean addAll (int index,\n                      Collection<?> c)", "description": "Inserts all of the elements in the specified collection into this\n list, starting at the specified position.  Shifts the element\n currently at that position (if any) and any subsequent elements to\n the right (increases their indices).  The new elements will appear\n in the list in the order that they are returned by the\n specified collection's iterator."}, {"method_name": "set", "method_sig": "public Object set (int index,\n                  Object element)", "description": "Replaces the element at the specified position in this list with\n the specified element."}]}