{"name": "Class AudioFormat.Encoding", "module": "java.desktop", "package": "javax.sound.sampled", "text": "The Encoding class names the specific type of data representation\n used for an audio stream. The encoding includes aspects of the sound\n format other than the number of channels, sample rate, sample size, frame\n rate, frame size, and byte order.\n \n One ubiquitous type of audio encoding is pulse-code modulation (PCM),\n which is simply a linear (proportional) representation of the sound\n waveform. With PCM, the number stored in each sample is proportional to\n the instantaneous amplitude of the sound pressure at that point in time.\n The numbers may be signed or unsigned integers or floats. Besides PCM,\n other encodings include mu-law and a-law, which are nonlinear mappings of\n the sound amplitude that are often used for recording speech.\n \n You can use a predefined encoding by referring to one of the static\n objects created by this class, such as PCM_SIGNED or\n PCM_UNSIGNED. Service providers can create new encodings, such as\n compressed audio formats, and make these available through the\n AudioSystem class.\n \n The Encoding class is static, so that all AudioFormat\n objects that have the same encoding will refer to the same object (rather\n than different instances of the same class). This allows matches to be\n made by checking that two format's encodings are equal.", "codes": ["public static class AudioFormat.Encoding\nextends Object"], "fields": [{"field_name": "PCM_SIGNED", "field_sig": "public static final AudioFormat.Encoding PCM_SIGNED", "description": "Specifies signed, linear PCM data."}, {"field_name": "PCM_UNSIGNED", "field_sig": "public static final AudioFormat.Encoding PCM_UNSIGNED", "description": "Specifies unsigned, linear PCM data."}, {"field_name": "PCM_FLOAT", "field_sig": "public static final AudioFormat.Encoding PCM_FLOAT", "description": "Specifies floating-point PCM data."}, {"field_name": "ULAW", "field_sig": "public static final AudioFormat.Encoding ULAW", "description": "Specifies u-law encoded data."}, {"field_name": "ALAW", "field_sig": "public static final AudioFormat.Encoding ALAW", "description": "Specifies a-law encoded data."}], "methods": [{"method_name": "equals", "method_sig": "public final boolean equals (Object obj)", "description": "Indicates whether the specified object is equal to this encoding,\n returning true if the objects are equal."}, {"method_name": "hashCode", "method_sig": "public final int hashCode()", "description": "Returns a hash code value for this encoding."}, {"method_name": "toString", "method_sig": "public final String toString()", "description": "Provides the String representation of the encoding. This\n String is the same name that was passed to the constructor.\n For the predefined encodings, the name is similar to the encoding's\n variable (field) name. For example, PCM_SIGNED.toString()\n returns the name \"PCM_SIGNED\"."}]}