{"name": "Class AudioFileFormat", "module": "java.desktop", "package": "javax.sound.sampled", "text": "An instance of the AudioFileFormat class describes an audio file,\n including the file type, the file's length in bytes, the length in sample\n frames of the audio data contained in the file, and the format of the audio\n data.\n \n The AudioSystem class includes methods for determining the format of\n an audio file, obtaining an audio input stream from an audio file, and\n writing an audio file from an audio input stream.\n \n An AudioFileFormat object can include a set of properties. A property\n is a pair of key and value: the key is of type String, the associated\n property value is an arbitrary object. Properties specify additional\n informational meta data (like a author, copyright, or file duration).\n Properties are optional information, and file reader and file writer\n implementations are not required to provide or recognize properties.\n \n The following table lists some common properties that should be used in\n implementations:\n\n \nAudio File Format Properties\n\n\nProperty key\n     Value type\n     Description\n \n\n\n\"duration\"\n     Long\nplayback duration of the file in microseconds\n   \n\"author\"\n     String\nname of the author of this file\n   \n\"title\"\n     String\ntitle of this file\n   \n\"copyright\"\n     String\ncopyright message\n   \n\"date\"\n     Date\ndate of the recording or release\n   \n\"comment\"\n     String\nan arbitrary text\n \n", "codes": ["public class AudioFileFormat\nextends Object"], "fields": [], "methods": [{"method_name": "getType", "method_sig": "public AudioFileFormat.Type getType()", "description": "Obtains the audio file type, such as WAVE or AU."}, {"method_name": "getByteLength", "method_sig": "public int getByteLength()", "description": "Obtains the size in bytes of the entire audio file (not just its audio\n data)."}, {"method_name": "getFormat", "method_sig": "public AudioFormat getFormat()", "description": "Obtains the format of the audio data contained in the audio file."}, {"method_name": "getFrameLength", "method_sig": "public int getFrameLength()", "description": "Obtains the length of the audio data contained in the file, expressed in\n sample frames."}, {"method_name": "properties", "method_sig": "public Map<String, Object> properties()", "description": "Obtain an unmodifiable map of properties. The concept of properties is\n further explained in the class description."}, {"method_name": "getProperty", "method_sig": "public Object getProperty (String key)", "description": "Obtain the property value specified by the key. The concept of properties\n is further explained in the class description.\n \n If the specified property is not defined for a particular file format,\n this method returns null."}, {"method_name": "toString", "method_sig": "public String toString()", "description": "Provides a string representation of the file format."}]}