{"name": "Class BandCombineOp", "module": "java.desktop", "package": "java.awt.image", "text": "This class performs an arbitrary linear combination of the bands\n in a Raster, using a specified matrix.\n \n The width of the matrix must be equal to the number of bands in the\n source Raster, optionally plus one.  If there is one more\n column in the matrix than the number of bands, there is an implied 1 at the\n end of the vector of band samples representing a pixel.  The height\n of the matrix must be equal to the number of bands in the destination.\n \n For example, a 3-banded Raster might have the following\n transformation applied to each pixel in order to invert the second band of\n the Raster.\n \n   [ 1.0   0.0   0.0    0.0  ]     [ b1 ]\n   [ 0.0  -1.0   0.0  255.0  ]  x  [ b2 ]\n   [ 0.0   0.0   1.0    0.0  ]     [ b3 ]\n                                   [ 1 ]\n \n\n Note that the source and destination can be the same object.", "codes": ["public class BandCombineOp\nextends Object\nimplements RasterOp"], "fields": [], "methods": [{"method_name": "getMatrix", "method_sig": "public final float[][] getMatrix()", "description": "Returns a copy of the linear combination matrix."}, {"method_name": "filter", "method_sig": "public WritableRaster filter (Raster src,\n                             WritableRaster dst)", "description": "Transforms the Raster using the matrix specified in the\n constructor. An IllegalArgumentException may be thrown if\n the number of bands in the source or destination is incompatible with\n the matrix.  See the class comments for more details.\n \n If the destination is null, it will be created with a number of bands\n equalling the number of rows in the matrix. No exception is thrown\n if the operation causes a data overflow."}, {"method_name": "getBounds2D", "method_sig": "public final Rectangle2D getBounds2D (Raster src)", "description": "Returns the bounding box of the transformed destination.  Since\n this is not a geometric operation, the bounding box is the same for\n the source and destination.\n An IllegalArgumentException may be thrown if the number of\n bands in the source is incompatible with the matrix.  See\n the class comments for more details."}, {"method_name": "createCompatibleDestRaster", "method_sig": "public WritableRaster createCompatibleDestRaster (Raster src)", "description": "Creates a zeroed destination Raster with the correct size\n and number of bands.\n An IllegalArgumentException may be thrown if the number of\n bands in the source is incompatible with the matrix.  See\n the class comments for more details."}, {"method_name": "getPoint2D", "method_sig": "public final Point2D getPoint2D (Point2D srcPt,\n                                Point2D dstPt)", "description": "Returns the location of the corresponding destination point given a\n point in the source Raster.  If dstPt is\n specified, it is used to hold the return value.\n Since this is not a geometric operation, the point returned\n is the same as the specified srcPt."}, {"method_name": "getRenderingHints", "method_sig": "public final RenderingHints getRenderingHints()", "description": "Returns the rendering hints for this operation."}]}