{"name": "Class Base64.Encoder", "module": "java.base", "package": "java.util", "text": "This class implements an encoder for encoding byte data using\n the Base64 encoding scheme as specified in RFC 4648 and RFC 2045.\n\n  Instances of Base64.Encoder class are safe for use by\n multiple concurrent threads.\n\n  Unless otherwise noted, passing a null argument to\n a method of this class will cause a\n NullPointerException to\n be thrown.", "codes": ["public static class Base64.Encoder\nextends Object"], "fields": [], "methods": [{"method_name": "encode", "method_sig": "public byte[] encode (byte[] src)", "description": "Encodes all bytes from the specified byte array into a newly-allocated\n byte array using the Base64 encoding scheme. The returned byte\n array is of the length of the resulting bytes."}, {"method_name": "encode", "method_sig": "public int encode (byte[] src,\n                  byte[] dst)", "description": "Encodes all bytes from the specified byte array using the\n Base64 encoding scheme, writing the resulting bytes to the\n given output byte array, starting at offset 0.\n\n  It is the responsibility of the invoker of this method to make\n sure the output byte array dst has enough space for encoding\n all bytes from the input byte array. No bytes will be written to the\n output byte array if the output byte array is not big enough."}, {"method_name": "encodeToString", "method_sig": "public String encodeToString (byte[] src)", "description": "Encodes the specified byte array into a String using the Base64\n encoding scheme.\n\n  This method first encodes all input bytes into a base64 encoded\n byte array and then constructs a new String by using the encoded byte\n array and the ISO-8859-1 charset.\n\n  In other words, an invocation of this method has exactly the same\n effect as invoking\n new String(encode(src), StandardCharsets.ISO_8859_1)."}, {"method_name": "encode", "method_sig": "public ByteBuffer encode (ByteBuffer buffer)", "description": "Encodes all remaining bytes from the specified byte buffer into\n a newly-allocated ByteBuffer using the Base64 encoding\n scheme.\n\n Upon return, the source buffer's position will be updated to\n its limit; its limit will not have been changed. The returned\n output buffer's position will be zero and its limit will be the\n number of resulting encoded bytes."}, {"method_name": "wrap", "method_sig": "public OutputStream wrap (OutputStream os)", "description": "Wraps an output stream for encoding byte data using the Base64\n encoding scheme.\n\n  It is recommended to promptly close the returned output stream after\n use, during which it will flush all possible leftover bytes to the underlying\n output stream. Closing the returned output stream will close the underlying\n output stream."}, {"method_name": "withoutPadding", "method_sig": "public Base64.Encoder withoutPadding()", "description": "Returns an encoder instance that encodes equivalently to this one,\n but without adding any padding character at the end of the encoded\n byte data.\n\n  The encoding scheme of this encoder instance is unaffected by\n this invocation. The returned encoder instance should be used for\n non-padding encoding operation."}]}