{"name": "Interface BasicFileAttributeView", "module": "java.base", "package": "java.nio.file.attribute", "text": "A file attribute view that provides a view of a basic set of file\n attributes common to many file systems. The basic set of file attributes\n consist of mandatory and optional file attributes as\n defined by the BasicFileAttributes interface.\n\n  The file attributes are retrieved from the file system as a bulk\n operation by invoking the readAttributes method.\n This class also defines the setTimes method to update the\n file's time attributes.\n\n  Where dynamic access to file attributes is required, the attributes\n supported by this attribute view have the following names and types:\n \n\nSupported attributes\n\n\n Name \n Type \n\n\n\n\n \"lastModifiedTime\" \n FileTime \n\n\n \"lastAccessTime\" \n FileTime \n\n\n \"creationTime\" \n FileTime \n\n\n \"size\" \n Long \n\n\n \"isRegularFile\" \n Boolean \n\n\n \"isDirectory\" \n Boolean \n\n\n \"isSymbolicLink\" \n Boolean \n\n\n \"isOther\" \n Boolean \n\n\n \"fileKey\" \n Object \n\n\n\n\n The getAttribute method may be\n used to read any of these attributes as if by invoking the readAttributes() method.\n\n  The setAttribute method may be\n used to update the file's last modified time, last access time or create time\n attributes as if by invoking the setTimes method.", "codes": ["public interface BasicFileAttributeView\nextends FileAttributeView"], "fields": [], "methods": [{"method_name": "name", "method_sig": "String name()", "description": "Returns the name of the attribute view. Attribute views of this type\n have the name \"basic\"."}, {"method_name": "readAttributes", "method_sig": "BasicFileAttributes readAttributes()\n                            throws IOException", "description": "Reads the basic file attributes as a bulk operation.\n\n  It is implementation specific if all file attributes are read as an\n atomic operation with respect to other file system operations."}, {"method_name": "setTimes", "method_sig": "void setTimes (FileTime lastModifiedTime,\n              FileTime lastAccessTime,\n              FileTime createTime)\n       throws IOException", "description": "Updates any or all of the file's last modified time, last access time,\n and create time attributes.\n\n  This method updates the file's timestamp attributes. The values are\n converted to the epoch and precision supported by the file system.\n Converting from finer to coarser granularities result in precision loss.\n The behavior of this method when attempting to set a timestamp that is\n not supported or to a value that is outside the range supported by the\n underlying file store is not defined. It may or not fail by throwing an\n IOException.\n\n  If any of the lastModifiedTime, lastAccessTime,\n or createTime parameters has the value null then the\n corresponding timestamp is not changed. An implementation may require to\n read the existing values of the file attributes when only some, but not\n all, of the timestamp attributes are updated. Consequently, this method\n may not be an atomic operation with respect to other file system\n operations. Reading and re-writing existing values may also result in\n precision loss. If all of the lastModifiedTime, \n lastAccessTime and createTime parameters are null then\n this method has no effect.\n\n  Usage Example:\n Suppose we want to change a file's last access time.\n \n    Path path = ...\n    FileTime time = ...\n    Files.getFileAttributeView(path, BasicFileAttributeView.class).setTimes(null, time, null);\n "}]}