{"name": "Interface Bindings", "module": "java.scripting", "package": "javax.script", "text": "A mapping of key/value pairs, all of whose keys are\n Strings.", "codes": ["public interface Bindings\nextends Map<String, Object>"], "fields": [], "methods": [{"method_name": "put", "method_sig": "Object put (String name,\n           Object value)", "description": "Set a named value."}, {"method_name": "putAll", "method_sig": "void putAll (Map<? extends String, ? extends Object> toMerge)", "description": "Adds all the mappings in a given Map to this Bindings."}, {"method_name": "containsKey", "method_sig": "boolean containsKey (Object key)", "description": "Returns true if this map contains a mapping for the specified\n key.  More formally, returns true if and only if\n this map contains a mapping for a key k such that\n (key==null ? k==null : key.equals(k)).  (There can be\n at most one such mapping.)"}, {"method_name": "get", "method_sig": "Object get (Object key)", "description": "Returns the value to which this map maps the specified key.  Returns\n null if the map contains no mapping for this key.  A return\n value of null does not necessarily indicate that the\n map contains no mapping for the key; it's also possible that the map\n explicitly maps the key to null.  The containsKey\n operation may be used to distinguish these two cases.\n\n More formally, if this map contains a mapping from a key\n k to a value v such that\n (key==null ? k==null : key.equals(k)),\n then this method returns v; otherwise\n it returns null.  (There can be at most one such mapping.)"}, {"method_name": "remove", "method_sig": "Object remove (Object key)", "description": "Removes the mapping for this key from this map if it is present\n (optional operation).   More formally, if this map contains a mapping\n from key k to value v such that\n (key==null ?  k==null : key.equals(k)), that mapping\n is removed.  (The map can contain at most one such mapping.)\n\n Returns the value to which the map previously associated the key, or\n null if the map contained no mapping for this key.  (A\n null return can also indicate that the map previously\n associated null with the specified key if the implementation\n supports null values.)  The map will not contain a mapping for\n the specified  key once the call returns."}]}