{"name": "Interface BoundedRangeModel", "module": "java.desktop", "package": "javax.swing", "text": "Defines the data model used by components like Sliders\n and ProgressBars.\n Defines four interrelated integer properties: minimum, maximum, extent\n and value.  These four integers define two nested ranges like this:\n \n minimum <= value <= value+extent <= maximum\n \n The outer range is minimum,maximum and the inner\n range is value,value+extent.  The inner range\n must lie within the outer one, i.e. value must be\n less than or equal to maximum and value+extent\n must greater than or equal to minimum, and maximum\n must be greater than or equal to minimum.\n There are a few features of this model that one might find a little\n surprising.  These quirks exist for the convenience of the\n Swing BoundedRangeModel clients, such as Slider and\n ScrollBar.\n \n\n   The minimum and maximum set methods \"correct\" the other\n   three properties to accommodate their new value argument.  For\n   example setting the model's minimum may change its maximum, value,\n   and extent properties (in that order), to maintain the constraints\n   specified above.\n\n \n   The value and extent set methods \"correct\" their argument to\n   fit within the limits defined by the other three properties.\n   For example if value == maximum, setExtent(10)\n   would change the extent (back) to zero.\n\n \n   The four BoundedRangeModel values are defined as Java Beans properties\n   however Swing ChangeEvents are used to notify clients of changes rather\n   than PropertyChangeEvents. This was done to keep the overhead of monitoring\n   a BoundedRangeModel low. Changes are often reported at MouseDragged rates.\n \n\n\n For an example of specifying custom bounded range models used by sliders,\n see Separable model architecture\n in A Swing Architecture Overview.", "codes": ["public interface BoundedRangeModel"], "fields": [], "methods": [{"method_name": "getMinimum", "method_sig": "int getMinimum()", "description": "Returns the minimum acceptable value."}, {"method_name": "setMinimum", "method_sig": "void setMinimum (int newMinimum)", "description": "Sets the model's minimum to newMinimum.   The\n other three properties may be changed as well, to ensure\n that:\n \n minimum <= value <= value+extent <= maximum\n \n\n Notifies any listeners if the model changes."}, {"method_name": "getMaximum", "method_sig": "int getMaximum()", "description": "Returns the model's maximum.  Note that the upper\n limit on the model's value is (maximum - extent)."}, {"method_name": "setMaximum", "method_sig": "void setMaximum (int newMaximum)", "description": "Sets the model's maximum to newMaximum. The other\n three properties may be changed as well, to ensure that\n \n minimum <= value <= value+extent <= maximum\n \n\n Notifies any listeners if the model changes."}, {"method_name": "getValue", "method_sig": "int getValue()", "description": "Returns the model's current value.  Note that the upper\n limit on the model's value is maximum - extent\n and the lower limit is minimum."}, {"method_name": "setValue", "method_sig": "void setValue (int newValue)", "description": "Sets the model's current value to newValue if newValue\n satisfies the model's constraints. Those constraints are:\n \n minimum <= value <= value+extent <= maximum\n \n Otherwise, if newValue is less than minimum\n it's set to minimum, if its greater than\n maximum then it's set to maximum, and\n if it's greater than value+extent then it's set to\n value+extent.\n \n When a BoundedRange model is used with a scrollbar the value\n specifies the origin of the scrollbar knob (aka the \"thumb\" or\n \"elevator\").  The value usually represents the origin of the\n visible part of the object being scrolled.\n \n Notifies any listeners if the model changes."}, {"method_name": "setValueIsAdjusting", "method_sig": "void setValueIsAdjusting (boolean b)", "description": "This attribute indicates that any upcoming changes to the value\n of the model should be considered a single event. This attribute\n will be set to true at the start of a series of changes to the value,\n and will be set to false when the value has finished changing.  Normally\n this allows a listener to only take action when the final value change in\n committed, instead of having to do updates for all intermediate values.\n \n Sliders and scrollbars use this property when a drag is underway."}, {"method_name": "getValueIsAdjusting", "method_sig": "boolean getValueIsAdjusting()", "description": "Returns true if the current changes to the value property are part\n of a series of changes."}, {"method_name": "getExtent", "method_sig": "int getExtent()", "description": "Returns the model's extent, the length of the inner range that\n begins at the model's value."}, {"method_name": "setExtent", "method_sig": "void setExtent (int newExtent)", "description": "Sets the model's extent.  The newExtent is forced to\n be greater than or equal to zero and less than or equal to\n maximum - value.\n \n When a BoundedRange model is used with a scrollbar the extent\n defines the length of the scrollbar knob (aka the \"thumb\" or\n \"elevator\").  The extent usually represents how much of the\n object being scrolled is visible. When used with a slider,\n the extent determines how much the value can \"jump\", for\n example when the user presses PgUp or PgDn.\n \n Notifies any listeners if the model changes."}, {"method_name": "setRangeProperties", "method_sig": "void setRangeProperties (int value,\n                        int extent,\n                        int min,\n                        int max,\n                        boolean adjusting)", "description": "This method sets all of the model's data with a single method call.\n The method results in a single change event being generated. This is\n convenient when you need to adjust all the model data simultaneously and\n do not want individual change events to occur."}, {"method_name": "addChangeListener", "method_sig": "void addChangeListener (ChangeListener x)", "description": "Adds a ChangeListener to the model's listener list."}, {"method_name": "removeChangeListener", "method_sig": "void removeChangeListener (ChangeListener x)", "description": "Removes a ChangeListener from the model's listener list."}]}