{"name": "Interface BufferPoolMXBean", "module": "java.management", "package": "java.lang.management", "text": "The management interface for a buffer pool, for example a pool of\n direct or mapped buffers.\n\n  A class implementing this interface is an\n MXBean. A Java\n virtual machine has one or more implementations of this interface. The getPlatformMXBeans\n method can be used to obtain the list of BufferPoolMXBean objects\n representing the management interfaces for pools of buffers as follows:\n \n     List<BufferPoolMXBean> pools = ManagementFactory.getPlatformMXBeans(BufferPoolMXBean.class);\n \n The management interfaces are also registered with the platform MBeanServer. The ObjectName that uniquely identifies the\n management interface within the MBeanServer takes the form:\n \n     java.nio:type=BufferPool,name=pool name\n \n where pool name is the name of the buffer pool.", "codes": ["public interface BufferPoolMXBean\nextends PlatformManagedObject"], "fields": [], "methods": [{"method_name": "getName", "method_sig": "String getName()", "description": "Returns the name representing this buffer pool."}, {"method_name": "getCount", "method_sig": "long getCount()", "description": "Returns an estimate of the number of buffers in the pool."}, {"method_name": "getTotalCapacity", "method_sig": "long getTotalCapacity()", "description": "Returns an estimate of the total capacity of the buffers in this pool.\n A buffer's capacity is the number of elements it contains and the value\n returned by this method is an estimate of the total capacity of buffers\n in the pool in bytes."}, {"method_name": "getMemoryUsed", "method_sig": "long getMemoryUsed()", "description": "Returns an estimate of the memory that the Java virtual machine is using\n for this buffer pool. The value returned by this method may differ\n from the estimate of the total capacity of\n the buffers in this pool. This difference is explained by alignment,\n memory allocator, and other implementation specific reasons."}]}