{"name": "Class BufferedReader", "module": "java.base", "package": "java.io", "text": "Reads text from a character-input stream, buffering characters so as to\n provide for the efficient reading of characters, arrays, and lines.\n\n  The buffer size may be specified, or the default size may be used.  The\n default is large enough for most purposes.\n\n  In general, each read request made of a Reader causes a corresponding\n read request to be made of the underlying character or byte stream.  It is\n therefore advisable to wrap a BufferedReader around any Reader whose read()\n operations may be costly, such as FileReaders and InputStreamReaders.  For\n example,\n\n \n BufferedReader in\n   = new BufferedReader(new FileReader(\"foo.in\"));\n \n\n will buffer the input from the specified file.  Without buffering, each\n invocation of read() or readLine() could cause bytes to be read from the\n file, converted into characters, and then returned, which can be very\n inefficient.\n\n  Programs that use DataInputStreams for textual input can be localized by\n replacing each DataInputStream with an appropriate BufferedReader.", "codes": ["public class BufferedReader\nextends Reader"], "fields": [], "methods": [{"method_name": "read", "method_sig": "public int read()\n         throws IOException", "description": "Reads a single character."}, {"method_name": "read", "method_sig": "public int read (char[] cbuf,\n                int off,\n                int len)\n         throws IOException", "description": "Reads characters into a portion of an array.\n\n  This method implements the general contract of the corresponding\n read method of the\n Reader class.  As an additional convenience, it\n attempts to read as many characters as possible by repeatedly invoking\n the read method of the underlying stream.  This iterated\n read continues until one of the following conditions becomes\n true: \n The specified number of characters have been read,\n\n    The read method of the underlying stream returns\n   -1, indicating end-of-file, or\n\n    The ready method of the underlying stream\n   returns false, indicating that further input requests\n   would block.\n\n  If the first read on the underlying stream returns\n -1 to indicate end-of-file then this method returns\n -1.  Otherwise this method returns the number of characters\n actually read.\n\n  Subclasses of this class are encouraged, but not required, to\n attempt to read as many characters as possible in the same fashion.\n\n  Ordinarily this method takes characters from this stream's character\n buffer, filling it from the underlying stream as necessary.  If,\n however, the buffer is empty, the mark is not valid, and the requested\n length is at least as large as the buffer, then this method will read\n characters directly from the underlying stream into the given array.\n Thus redundant BufferedReaders will not copy data\n unnecessarily."}, {"method_name": "readLine", "method_sig": "public String readLine()\n                throws IOException", "description": "Reads a line of text.  A line is considered to be terminated by any one\n of a line feed ('\\n'), a carriage return ('\\r'), a carriage return\n followed immediately by a line feed, or by reaching the end-of-file\n (EOF)."}, {"method_name": "skip", "method_sig": "public long skip (long n)\n          throws IOException", "description": "Skips characters."}, {"method_name": "ready", "method_sig": "public boolean ready()\n              throws IOException", "description": "Tells whether this stream is ready to be read.  A buffered character\n stream is ready if the buffer is not empty, or if the underlying\n character stream is ready."}, {"method_name": "markSupported", "method_sig": "public boolean markSupported()", "description": "Tells whether this stream supports the mark() operation, which it does."}, {"method_name": "mark", "method_sig": "public void mark (int readAheadLimit)\n          throws IOException", "description": "Marks the present position in the stream.  Subsequent calls to reset()\n will attempt to reposition the stream to this point."}, {"method_name": "reset", "method_sig": "public void reset()\n           throws IOException", "description": "Resets the stream to the most recent mark."}, {"method_name": "lines", "method_sig": "public Stream<String> lines()", "description": "Returns a Stream, the elements of which are lines read from\n this BufferedReader.  The Stream is lazily populated,\n i.e., read only occurs during the\n terminal\n stream operation.\n\n  The reader must not be operated on during the execution of the\n terminal stream operation. Otherwise, the result of the terminal stream\n operation is undefined.\n\n  After execution of the terminal stream operation there are no\n guarantees that the reader will be at a specific position from which to\n read the next character or line.\n\n  If an IOException is thrown when accessing the underlying\n BufferedReader, it is wrapped in an UncheckedIOException which will be thrown from the Stream\n method that caused the read to take place. This method will return a\n Stream if invoked on a BufferedReader that is closed. Any operation on\n that stream that requires reading from the BufferedReader after it is\n closed, will cause an UncheckedIOException to be thrown."}]}