{"name": "Interface CellEditor", "module": "java.desktop", "package": "javax.swing", "text": "This interface defines the methods any general editor should be able\n to implement. \n\n Having this interface enables complex components (the client of the\n editor) such as JTree and\n JTable to allow any generic editor to\n edit values in a table cell, or tree cell, etc.  Without this generic\n editor interface, JTable would have to know about specific editors,\n such as JTextField, JCheckBox, JComboBox,\n etc.  In addition, without this interface, clients of editors such as\n JTable would not be able\n to work with any editors developed in the future by the user\n or a 3rd party ISV. \n\n To use this interface, a developer creating a new editor can have the\n new component implement the interface.  Or the developer can\n choose a wrapper based approach and provide a companion object which\n implements the CellEditor interface (See\n DefaultCellEditor for example).  The wrapper approach\n is particularly useful if the user want to use a 3rd party ISV\n editor with JTable, but the ISV didn't implement the\n CellEditor interface.  The user can simply create an object\n that contains an instance of the 3rd party editor object and \"translate\"\n the CellEditor API into the 3rd party editor's API.", "codes": ["public interface CellEditor"], "fields": [], "methods": [{"method_name": "getCellEditorValue", "method_sig": "Object getCellEditorValue()", "description": "Returns the value contained in the editor."}, {"method_name": "isCellEditable", "method_sig": "boolean isCellEditable (EventObject anEvent)", "description": "Asks the editor if it can start editing using anEvent.\n anEvent is in the invoking component coordinate system.\n The editor can not assume the Component returned by\n getCellEditorComponent is installed.  This method\n is intended for the use of client to avoid the cost of setting up\n and installing the editor component if editing is not possible.\n If editing can be started this method returns true."}, {"method_name": "shouldSelectCell", "method_sig": "boolean shouldSelectCell (EventObject anEvent)", "description": "Returns true if the editing cell should be selected, false otherwise.\n Typically, the return value is true, because is most cases the editing\n cell should be selected.  However, it is useful to return false to\n keep the selection from changing for some types of edits.\n eg. A table that contains a column of check boxes, the user might\n want to be able to change those checkboxes without altering the\n selection.  (See Netscape Communicator for just such an example)\n Of course, it is up to the client of the editor to use the return\n value, but it doesn't need to if it doesn't want to."}, {"method_name": "stopCellEditing", "method_sig": "boolean stopCellEditing()", "description": "Tells the editor to stop editing and accept any partially edited\n value as the value of the editor.  The editor returns false if\n editing was not stopped; this is useful for editors that validate\n and can not accept invalid entries."}, {"method_name": "cancelCellEditing", "method_sig": "void cancelCellEditing()", "description": "Tells the editor to cancel editing and not accept any partially\n edited value."}, {"method_name": "addCellEditorListener", "method_sig": "void addCellEditorListener (CellEditorListener l)", "description": "Adds a listener to the list that's notified when the editor\n stops, or cancels editing."}, {"method_name": "removeCellEditorListener", "method_sig": "void removeCellEditorListener (CellEditorListener l)", "description": "Removes a listener from the list that's notified"}]}