{"name": "Class CertPathValidatorSpi", "module": "java.base", "package": "java.security.cert", "text": "The Service Provider Interface (SPI)\n for the CertPathValidator class. All\n CertPathValidator implementations must include a class (the\n SPI class) that extends this class (CertPathValidatorSpi)\n and implements all of its methods. In general, instances of this class\n should only be accessed through the CertPathValidator class.\n For details, see the Java Cryptography Architecture.\n \nConcurrent Access\n\n Instances of this class need not be protected against concurrent\n access from multiple threads. Threads that need to access a single\n CertPathValidatorSpi instance concurrently should synchronize\n amongst themselves and provide the necessary locking before calling the\n wrapping CertPathValidator object.\n \n However, implementations of CertPathValidatorSpi may still\n encounter concurrency issues, since multiple threads each\n manipulating a different CertPathValidatorSpi instance need not\n synchronize.", "codes": ["public abstract class CertPathValidatorSpi\nextends Object"], "fields": [], "methods": [{"method_name": "engineValidate", "method_sig": "public abstract CertPathValidatorResult engineValidate (CertPath certPath,\n                                                       CertPathParameters params)\n                                                throws CertPathValidatorException,\n                                                       InvalidAlgorithmParameterException", "description": "Validates the specified certification path using the specified\n algorithm parameter set.\n \n The CertPath specified must be of a type that is\n supported by the validation algorithm, otherwise an\n InvalidAlgorithmParameterException will be thrown. For\n example, a CertPathValidator that implements the PKIX\n algorithm validates CertPath objects of type X.509."}, {"method_name": "engineGetRevocationChecker", "method_sig": "public CertPathChecker engineGetRevocationChecker()", "description": "Returns a CertPathChecker that this implementation uses to\n check the revocation status of certificates. A PKIX implementation\n returns objects of type PKIXRevocationChecker.\n\n The primary purpose of this method is to allow callers to specify\n additional input parameters and options specific to revocation checking.\n See the class description of CertPathValidator for an example.\n\n This method was added to version 1.8 of the Java Platform Standard\n Edition. In order to maintain backwards compatibility with existing\n service providers, this method cannot be abstract and by default throws\n an UnsupportedOperationException."}]}