{"name": "Interface CertStoreParameters", "module": "java.base", "package": "java.security.cert", "text": "A specification of CertStore parameters.\n \n The purpose of this interface is to group (and provide type safety for)\n all CertStore parameter specifications. All\n CertStore parameter specifications must implement this\n interface.\n \n Typically, a CertStoreParameters object is passed as a parameter\n to one of the CertStore.getInstance methods.\n The getInstance method returns a CertStore that\n is used for retrieving Certificates and CRLs. The\n CertStore that is returned is initialized with the specified\n parameters. The type of parameters needed may vary between different types\n of CertStores.", "codes": ["public interface CertStoreParameters\nextends Cloneable"], "fields": [], "methods": [{"method_name": "clone", "method_sig": "Object clone()", "description": "Makes a copy of this CertStoreParameters.\n \n The precise meaning of \"copy\" may depend on the class of\n the CertStoreParameters object. A typical implementation\n performs a \"deep copy\" of this object, but this is not an absolute\n requirement. Some implementations may perform a \"shallow copy\" of some\n or all of the fields of this object.\n \n Note that the CertStore.getInstance methods make a copy\n of the specified CertStoreParameters. A deep copy\n implementation of clone is safer and more robust, as it\n prevents the caller from corrupting a shared CertStore by\n subsequently modifying the contents of its initialization parameters.\n However, a shallow copy implementation of clone is more\n appropriate for applications that need to hold a reference to a\n parameter contained in the CertStoreParameters. For example,\n a shallow copy clone allows an application to release the resources of\n a particular CertStore initialization parameter immediately,\n rather than waiting for the garbage collection mechanism. This should\n be done with the utmost care, since the CertStore may still\n be in use by other threads.\n \n Each subclass should state the precise behavior of this method so\n that users and developers know what to expect."}]}