{"name": "Class CertStoreSpi", "module": "java.base", "package": "java.security.cert", "text": "The Service Provider Interface (SPI)\n for the CertStore class. All CertStore\n implementations must include a class (the SPI class) that extends\n this class (CertStoreSpi), provides a constructor with\n a single argument of type CertStoreParameters, and implements\n all of its methods. In general, instances of this class should only be\n accessed through the CertStore class.\n For details, see the Java Cryptography Architecture.\n \nConcurrent Access\n\n The public methods of all CertStoreSpi objects must be\n thread-safe. That is, multiple threads may concurrently invoke these\n methods on a single CertStoreSpi object (or more than one)\n with no ill effects. This allows a CertPathBuilder to search\n for a CRL while simultaneously searching for further certificates, for\n instance.\n \n Simple CertStoreSpi implementations will probably ensure\n thread safety by adding a synchronized keyword to their\n engineGetCertificates and engineGetCRLs methods.\n More sophisticated ones may allow truly concurrent access.", "codes": ["public abstract class CertStoreSpi\nextends Object"], "fields": [], "methods": [{"method_name": "engineGetCertificates", "method_sig": "public abstract Collection<? extends Certificate> engineGetCertificates (CertSelector selector)\n                                                                 throws CertStoreException", "description": "Returns a Collection of Certificates that\n match the specified selector. If no Certificates\n match the selector, an empty Collection will be returned.\n \n For some CertStore types, the resulting\n Collection may not contain all of the\n Certificates that match the selector. For instance,\n an LDAP CertStore may not search all entries in the\n directory. Instead, it may just search entries that are likely to\n contain the Certificates it is looking for.\n \n Some CertStore implementations (especially LDAP\n CertStores) may throw a CertStoreException\n unless a non-null CertSelector is provided that includes\n specific criteria that can be used to find the certificates. Issuer\n and/or subject names are especially useful criteria."}, {"method_name": "engineGetCRLs", "method_sig": "public abstract Collection<? extends CRL> engineGetCRLs (CRLSelector selector)\n                                                 throws CertStoreException", "description": "Returns a Collection of CRLs that\n match the specified selector. If no CRLs\n match the selector, an empty Collection will be returned.\n \n For some CertStore types, the resulting\n Collection may not contain all of the\n CRLs that match the selector. For instance,\n an LDAP CertStore may not search all entries in the\n directory. Instead, it may just search entries that are likely to\n contain the CRLs it is looking for.\n \n Some CertStore implementations (especially LDAP\n CertStores) may throw a CertStoreException\n unless a non-null CRLSelector is provided that includes\n specific criteria that can be used to find the CRLs. Issuer names\n and/or the certificate to be checked are especially useful."}]}