{"name": "Class CharsetEncoder", "module": "java.base", "package": "java.nio.charset", "text": "An engine that can transform a sequence of sixteen-bit Unicode characters into a sequence of\n bytes in a specific charset.\n\n \n The input character sequence is provided in a character buffer or a series\n of such buffers.  The output byte sequence is written to a byte buffer\n or a series of such buffers.  An encoder should always be used by making\n the following sequence of method invocations, hereinafter referred to as an\n encoding operation:\n\n \n Reset the encoder via the reset method, unless it\n   has not been used before; \n Invoke the encode method zero or more times, as\n   long as additional input may be available, passing false for the\n   endOfInput argument and filling the input buffer and flushing the\n   output buffer between invocations; \n Invoke the encode method one final time, passing\n   true for the endOfInput argument; and then \n Invoke the flush method so that the encoder can\n   flush any internal state to the output buffer. \n\n\n Each invocation of the encode method will encode as many\n characters as possible from the input buffer, writing the resulting bytes\n to the output buffer.  The encode method returns when more\n input is required, when there is not enough room in the output buffer, or\n when an encoding error has occurred.  In each case a CoderResult\n object is returned to describe the reason for termination.  An invoker can\n examine this object and fill the input buffer, flush the output buffer, or\n attempt to recover from an encoding error, as appropriate, and try again.\n\n \n There are two general types of encoding errors.  If the input character\n sequence is not a legal sixteen-bit Unicode sequence then the input is considered malformed.  If\n the input character sequence is legal but cannot be mapped to a valid\n byte sequence in the given charset then an unmappable character has been encountered.\n\n \n How an encoding error is handled depends upon the action requested for\n that type of error, which is described by an instance of the CodingErrorAction class.  The possible error actions are to ignore the erroneous input, report the error to the invoker via\n the returned CoderResult object, or replace the erroneous input with the current value of the\n replacement byte array.  The replacement\n\n\n is initially set to the encoder's default replacement, which often\n (but not always) has the initial value { (byte)'?' };\n\n\n\n\n\n its value may be changed via the replaceWith method.\n\n  The default action for malformed-input and unmappable-character errors\n is to report them.  The\n malformed-input error action may be changed via the onMalformedInput method; the\n unmappable-character action may be changed via the onUnmappableCharacter method.\n\n  This class is designed to handle many of the details of the encoding\n process, including the implementation of error actions.  An encoder for a\n specific charset, which is a concrete subclass of this class, need only\n implement the abstract encodeLoop method, which\n encapsulates the basic encoding loop.  A subclass that maintains internal\n state should, additionally, override the implFlush and\n implReset methods.\n\n  Instances of this class are not safe for use by multiple concurrent\n threads.  ", "codes": ["public abstract class CharsetEncoder\nextends Object"], "fields": [], "methods": [{"method_name": "charset", "method_sig": "public final Charset charset()", "description": "Returns the charset that created this encoder."}, {"method_name": "replacement", "method_sig": "public final byte[] replacement()", "description": "Returns this encoder's replacement value."}, {"method_name": "replaceWith", "method_sig": "public final CharsetEncoder replaceWith (byte[] newReplacement)", "description": "Changes this encoder's replacement value.\n\n  This method invokes the implReplaceWith\n method, passing the new replacement, after checking that the new\n replacement is acceptable.  "}, {"method_name": "implReplaceWith", "method_sig": "protected void implReplaceWith (byte[] newReplacement)", "description": "Reports a change to this encoder's replacement value.\n\n  The default implementation of this method does nothing.  This method\n should be overridden by encoders that require notification of changes to\n the replacement.  "}, {"method_name": "isLegalReplacement", "method_sig": "public boolean isLegalReplacement (byte[] repl)", "description": "Tells whether or not the given byte array is a legal replacement value\n for this encoder.\n\n  A replacement is legal if, and only if, it is a legal sequence of\n bytes in this encoder's charset; that is, it must be possible to decode\n the replacement into one or more sixteen-bit Unicode characters.\n\n  The default implementation of this method is not very efficient; it\n should generally be overridden to improve performance.  "}, {"method_name": "malformedInputAction", "method_sig": "public CodingErrorAction malformedInputAction()", "description": "Returns this encoder's current action for malformed-input errors."}, {"method_name": "onMalformedInput", "method_sig": "public final CharsetEncoder onMalformedInput (CodingErrorAction newAction)", "description": "Changes this encoder's action for malformed-input errors.\n\n  This method invokes the implOnMalformedInput method, passing the new action.  "}, {"method_name": "implOnMalformedInput", "method_sig": "protected void implOnMalformedInput (CodingErrorAction newAction)", "description": "Reports a change to this encoder's malformed-input action.\n\n  The default implementation of this method does nothing.  This method\n should be overridden by encoders that require notification of changes to\n the malformed-input action.  "}, {"method_name": "unmappableCharacterAction", "method_sig": "public CodingErrorAction unmappableCharacterAction()", "description": "Returns this encoder's current action for unmappable-character errors."}, {"method_name": "onUnmappableCharacter", "method_sig": "public final CharsetEncoder onUnmappableCharacter (CodingErrorAction newAction)", "description": "Changes this encoder's action for unmappable-character errors.\n\n  This method invokes the implOnUnmappableCharacter method, passing the new action.  "}, {"method_name": "implOnUnmappableCharacter", "method_sig": "protected void implOnUnmappableCharacter (CodingErrorAction newAction)", "description": "Reports a change to this encoder's unmappable-character action.\n\n  The default implementation of this method does nothing.  This method\n should be overridden by encoders that require notification of changes to\n the unmappable-character action.  "}, {"method_name": "averageBytesPerChar", "method_sig": "public final float averageBytesPerChar()", "description": "Returns the average number of bytes that will be produced for each\n character of input.  This heuristic value may be used to estimate the size\n of the output buffer required for a given input sequence."}, {"method_name": "maxBytesPerChar", "method_sig": "public final float maxBytesPerChar()", "description": "Returns the maximum number of bytes that will be produced for each\n character of input.  This value may be used to compute the worst-case size\n of the output buffer required for a given input sequence."}, {"method_name": "encode", "method_sig": "public final CoderResult encode (CharBuffer in,\n                                ByteBuffer out,\n                                boolean endOfInput)", "description": "Encodes as many characters as possible from the given input buffer,\n writing the results to the given output buffer.\n\n  The buffers are read from, and written to, starting at their current\n positions.  At most in.remaining() characters\n will be read and at most out.remaining()\n bytes will be written.  The buffers' positions will be advanced to\n reflect the characters read and the bytes written, but their marks and\n limits will not be modified.\n\n  In addition to reading characters from the input buffer and writing\n bytes to the output buffer, this method returns a CoderResult\n object to describe its reason for termination:\n\n \n CoderResult.UNDERFLOW indicates that as much of the\n   input buffer as possible has been encoded.  If there is no further\n   input then the invoker can proceed to the next step of the\n   encoding operation.  Otherwise this method\n   should be invoked again with further input.  \n CoderResult.OVERFLOW indicates that there is\n   insufficient space in the output buffer to encode any more characters.\n   This method should be invoked again with an output buffer that has\n   more remaining bytes. This is\n   typically done by draining any encoded bytes from the output\n   buffer.  \n A malformed-input result indicates that a malformed-input\n   error has been detected.  The malformed characters begin at the input\n   buffer's (possibly incremented) position; the number of malformed\n   characters may be determined by invoking the result object's length method.  This case applies only if the\n   malformed action of this encoder\n   is CodingErrorAction.REPORT; otherwise the malformed input\n   will be ignored or replaced, as requested.  \n An unmappable-character result indicates that an\n   unmappable-character error has been detected.  The characters that\n   encode the unmappable character begin at the input buffer's (possibly\n   incremented) position; the number of such characters may be determined\n   by invoking the result object's length\n   method.  This case applies only if the unmappable action of this encoder is CodingErrorAction.REPORT; otherwise the unmappable character will be\n   ignored or replaced, as requested.  \n\n\n In any case, if this method is to be reinvoked in the same encoding\n operation then care should be taken to preserve any characters remaining\n in the input buffer so that they are available to the next invocation.\n\n  The endOfInput parameter advises this method as to whether\n the invoker can provide further input beyond that contained in the given\n input buffer.  If there is a possibility of providing additional input\n then the invoker should pass false for this parameter; if there\n is no possibility of providing further input then the invoker should\n pass true.  It is not erroneous, and in fact it is quite\n common, to pass false in one invocation and later discover that\n no further input was actually available.  It is critical, however, that\n the final invocation of this method in a sequence of invocations always\n pass true so that any remaining unencoded input will be treated\n as being malformed.\n\n  This method works by invoking the encodeLoop\n method, interpreting its results, handling error conditions, and\n reinvoking it as necessary.  "}, {"method_name": "flush", "method_sig": "public final CoderResult flush (ByteBuffer out)", "description": "Flushes this encoder.\n\n  Some encoders maintain internal state and may need to write some\n final bytes to the output buffer once the overall input sequence has\n been read.\n\n  Any additional output is written to the output buffer beginning at\n its current position.  At most out.remaining()\n bytes will be written.  The buffer's position will be advanced\n appropriately, but its mark and limit will not be modified.\n\n  If this method completes successfully then it returns CoderResult.UNDERFLOW.  If there is insufficient room in the output\n buffer then it returns CoderResult.OVERFLOW.  If this happens\n then this method must be invoked again, with an output buffer that has\n more room, in order to complete the current encoding\n operation.\n\n  If this encoder has already been flushed then invoking this method\n has no effect.\n\n  This method invokes the implFlush method to\n perform the actual flushing operation.  "}, {"method_name": "implFlush", "method_sig": "protected CoderResult implFlush (ByteBuffer out)", "description": "Flushes this encoder.\n\n  The default implementation of this method does nothing, and always\n returns CoderResult.UNDERFLOW.  This method should be overridden\n by encoders that may need to write final bytes to the output buffer\n once the entire input sequence has been read. "}, {"method_name": "reset", "method_sig": "public final CharsetEncoder reset()", "description": "Resets this encoder, clearing any internal state.\n\n  This method resets charset-independent state and also invokes the\n implReset method in order to perform any\n charset-specific reset actions.  "}, {"method_name": "implReset", "method_sig": "protected void implReset()", "description": "Resets this encoder, clearing any charset-specific internal state.\n\n  The default implementation of this method does nothing.  This method\n should be overridden by encoders that maintain internal state.  "}, {"method_name": "encodeLoop", "method_sig": "protected abstract CoderResult encodeLoop (CharBuffer in,\n                                          ByteBuffer out)", "description": "Encodes one or more characters into one or more bytes.\n\n  This method encapsulates the basic encoding loop, encoding as many\n characters as possible until it either runs out of input, runs out of room\n in the output buffer, or encounters an encoding error.  This method is\n invoked by the encode method, which handles result\n interpretation and error recovery.\n\n  The buffers are read from, and written to, starting at their current\n positions.  At most in.remaining() characters\n will be read, and at most out.remaining()\n bytes will be written.  The buffers' positions will be advanced to\n reflect the characters read and the bytes written, but their marks and\n limits will not be modified.\n\n  This method returns a CoderResult object to describe its\n reason for termination, in the same manner as the encode\n method.  Most implementations of this method will handle encoding errors\n by returning an appropriate result object for interpretation by the\n encode method.  An optimized implementation may instead\n examine the relevant error action and implement that action itself.\n\n  An implementation of this method may perform arbitrary lookahead by\n returning CoderResult.UNDERFLOW until it receives sufficient\n input.  "}, {"method_name": "encode", "method_sig": "public final ByteBuffer encode (CharBuffer in)\n                        throws CharacterCodingException", "description": "Convenience method that encodes the remaining content of a single input\n character buffer into a newly-allocated byte buffer.\n\n  This method implements an entire encoding\n operation; that is, it resets this encoder, then it encodes the\n characters in the given character buffer, and finally it flushes this\n encoder.  This method should therefore not be invoked if an encoding\n operation is already in progress.  "}, {"method_name": "canEncode", "method_sig": "public boolean canEncode (char c)", "description": "Tells whether or not this encoder can encode the given character.\n\n  This method returns false if the given character is a\n surrogate character; such characters can be interpreted only when they\n are members of a pair consisting of a high surrogate followed by a low\n surrogate.  The canEncode(CharSequence) method may be used to test whether or not a\n character sequence can be encoded.\n\n  This method may modify this encoder's state; it should therefore not\n be invoked if an encoding operation is already in\n progress.\n\n  The default implementation of this method is not very efficient; it\n should generally be overridden to improve performance.  "}, {"method_name": "canEncode", "method_sig": "public boolean canEncode (CharSequence cs)", "description": "Tells whether or not this encoder can encode the given character\n sequence.\n\n  If this method returns false for a particular character\n sequence then more information about why the sequence cannot be encoded\n may be obtained by performing a full encoding\n operation.\n\n  This method may modify this encoder's state; it should therefore not\n be invoked if an encoding operation is already in progress.\n\n  The default implementation of this method is not very efficient; it\n should generally be overridden to improve performance.  "}]}