{"name": "Class Charset", "module": "java.base", "package": "java.nio.charset", "text": "A named mapping between sequences of sixteen-bit Unicode code units and sequences of\n bytes.  This class defines methods for creating decoders and encoders and\n for retrieving the various names associated with a charset.  Instances of\n this class are immutable.\n\n  This class also defines static methods for testing whether a particular\n charset is supported, for locating charset instances by name, and for\n constructing a map that contains every charset for which support is\n available in the current Java virtual machine.  Support for new charsets can\n be added via the service-provider interface defined in the CharsetProvider class.\n\n  All of the methods defined in this class are safe for use by multiple\n concurrent threads.\n\n\n \nCharset names\n Charsets are named by strings composed of the following characters:\n\n \n The uppercase letters 'A' through 'Z'\n        ('\\u0041' through '\\u005a'),\n\n    The lowercase letters 'a' through 'z'\n        ('\\u0061' through '\\u007a'),\n\n    The digits '0' through '9'\n        ('\\u0030' through '\\u0039'),\n\n    The dash character '-'\n        ('\\u002d', HYPHEN-MINUS),\n\n    The plus character '+'\n        ('\\u002b', PLUS SIGN),\n\n    The period character '.'\n        ('\\u002e', FULL STOP),\n\n    The colon character ':'\n        ('\\u003a', COLON), and\n\n    The underscore character '_'\n        ('\\u005f', LOW LINE).\n\n \n\n A charset name must begin with either a letter or a digit.  The empty string\n is not a legal charset name.  Charset names are not case-sensitive; that is,\n case is always ignored when comparing charset names.  Charset names\n generally follow the conventions documented in RFC 2278: IANA Charset\n Registration Procedures.\n\n  Every charset has a canonical name and may also have one or more\n aliases.  The canonical name is returned by the name method\n of this class.  Canonical names are, by convention, usually in upper case.\n The aliases of a charset are returned by the aliases\n method.\n\n Some charsets have an historical name that is defined for\n compatibility with previous versions of the Java platform.  A charset's\n historical name is either its canonical name or one of its aliases.  The\n historical name is returned by the getEncoding() methods of the\n InputStreamReader and OutputStreamWriter classes.\n\n  If a charset listed in the IANA Charset\n Registry is supported by an implementation of the Java platform then\n its canonical name must be the name listed in the registry. Many charsets\n are given more than one name in the registry, in which case the registry\n identifies one of the names as MIME-preferred.  If a charset has more\n than one registry name then its canonical name must be the MIME-preferred\n name and the other names in the registry must be valid aliases.  If a\n supported charset is not listed in the IANA registry then its canonical name\n must begin with one of the strings \"X-\" or \"x-\".\n\n  The IANA charset registry does change over time, and so the canonical\n name and the aliases of a particular charset may also change over time.  To\n ensure compatibility it is recommended that no alias ever be removed from a\n charset, and that if the canonical name of a charset is changed then its\n previous canonical name be made into an alias.\n\n\n Standard charsets\nEvery implementation of the Java platform is required to support the\n following standard charsets.  Consult the release documentation for your\n implementation to see if any other charsets are supported.  The behavior\n of such optional charsets may differ between implementations.\n\n \nDescription of standard charsets\n\nCharsetDescription\n\n\nUS-ASCII\nSeven-bit ASCII, a.k.a. ISO646-US,\n         a.k.a. the Basic Latin block of the Unicode character set\nISO-8859-1  \nISO Latin Alphabet No. 1, a.k.a. ISO-LATIN-1\nUTF-8\nEight-bit UCS Transformation Format\nUTF-16BE\nSixteen-bit UCS Transformation Format,\n         big-endian byte order\nUTF-16LE\nSixteen-bit UCS Transformation Format,\n         little-endian byte order\nUTF-16\nSixteen-bit UCS Transformation Format,\n         byte order identified by an optional byte-order mark\n\n\n The UTF-8 charset is specified by RFC 2279; the\n transformation format upon which it is based is specified in\n Amendment 2 of ISO 10646-1 and is also described in the Unicode\n Standard.\n\n  The UTF-16 charsets are specified by RFC 2781; the\n transformation formats upon which they are based are specified in\n Amendment 1 of ISO 10646-1 and are also described in the Unicode\n Standard.\n\n  The UTF-16 charsets use sixteen-bit quantities and are\n therefore sensitive to byte order.  In these encodings the byte order of a\n stream may be indicated by an initial byte-order mark represented by\n the Unicode character '\\uFEFF'.  Byte-order marks are handled\n as follows:\n\n \n When decoding, the UTF-16BE and UTF-16LE\n   charsets interpret the initial byte-order marks as a ZERO-WIDTH\n   NON-BREAKING SPACE; when encoding, they do not write\n   byte-order marks. \n When decoding, the UTF-16 charset interprets the\n   byte-order mark at the beginning of the input stream to indicate the\n   byte-order of the stream but defaults to big-endian if there is no\n   byte-order mark; when encoding, it uses big-endian byte order and writes\n   a big-endian byte-order mark. \n\n\n In any case, byte order marks occurring after the first element of an\n input sequence are not omitted since the same code is used to represent\n ZERO-WIDTH NON-BREAKING SPACE.\n\n  Every instance of the Java virtual machine has a default charset, which\n may or may not be one of the standard charsets.  The default charset is\n determined during virtual-machine startup and typically depends upon the\n locale and charset being used by the underlying operating system. \nThe StandardCharsets class defines constants for each of the\n standard charsets.\n\n Terminology\n The name of this class is taken from the terms used in\n RFC 2278.\n In that document a charset is defined as the combination of\n one or more coded character sets and a character-encoding scheme.\n (This definition is confusing; some other software systems define\n charset as a synonym for coded character set.)\n\n  A coded character set is a mapping between a set of abstract\n characters and a set of integers.  US-ASCII, ISO 8859-1,\n JIS X 0201, and Unicode are examples of coded character sets.\n\n  Some standards have defined a character set to be simply a\n set of abstract characters without an associated assigned numbering.\n An alphabet is an example of such a character set.  However, the subtle\n distinction between character set and coded character set\n is rarely used in practice; the former has become a short form for the\n latter, including in the Java API specification.\n\n  A character-encoding scheme is a mapping between one or more\n coded character sets and a set of octet (eight-bit byte) sequences.\n UTF-8, UTF-16, ISO 2022, and EUC are examples of\n character-encoding schemes.  Encoding schemes are often associated with\n a particular coded character set; UTF-8, for example, is used only to\n encode Unicode.  Some schemes, however, are associated with multiple\n coded character sets; EUC, for example, can be used to encode\n characters in a variety of Asian coded character sets.\n\n  When a coded character set is used exclusively with a single\n character-encoding scheme then the corresponding charset is usually\n named for the coded character set; otherwise a charset is usually named\n for the encoding scheme and, possibly, the locale of the coded\n character sets that it supports.  Hence US-ASCII is both the\n name of a coded character set and of the charset that encodes it, while\n EUC-JP is the name of the charset that encodes the\n JIS X 0201, JIS X 0208, and JIS X 0212\n coded character sets for the Japanese language.\n\n  The native character encoding of the Java programming language is\n UTF-16.  A charset in the Java platform therefore defines a mapping\n between sequences of sixteen-bit UTF-16 code units (that is, sequences\n of chars) and sequences of bytes. ", "codes": ["public abstract class Charset\nextends Object\nimplements Comparable<Charset>"], "fields": [], "methods": [{"method_name": "isSupported", "method_sig": "public static boolean isSupported (String charsetName)", "description": "Tells whether the named charset is supported."}, {"method_name": "forName", "method_sig": "public static Charset forName (String charsetName)", "description": "Returns a charset object for the named charset."}, {"method_name": "availableCharsets", "method_sig": "public static SortedMap<String, Charset> availableCharsets()", "description": "Constructs a sorted map from canonical charset names to charset objects.\n\n  The map returned by this method will have one entry for each charset\n for which support is available in the current Java virtual machine.  If\n two or more supported charsets have the same canonical name then the\n resulting map will contain just one of them; which one it will contain\n is not specified. \n The invocation of this method, and the subsequent use of the\n resulting map, may cause time-consuming disk or network I/O operations\n to occur.  This method is provided for applications that need to\n enumerate all of the available charsets, for example to allow user\n charset selection.  This method is not used by the forName method, which instead employs an efficient incremental lookup\n algorithm.\n\n  This method may return different results at different times if new\n charset providers are dynamically made available to the current Java\n virtual machine.  In the absence of such changes, the charsets returned\n by this method are exactly those that can be retrieved via the forName method.  "}, {"method_name": "defaultCharset", "method_sig": "public static Charset defaultCharset()", "description": "Returns the default charset of this Java virtual machine.\n\n  The default charset is determined during virtual-machine startup and\n typically depends upon the locale and charset of the underlying\n operating system."}, {"method_name": "name", "method_sig": "public final String name()", "description": "Returns this charset's canonical name."}, {"method_name": "aliases", "method_sig": "public final Set<String> aliases()", "description": "Returns a set containing this charset's aliases."}, {"method_name": "displayName", "method_sig": "public String displayName()", "description": "Returns this charset's human-readable name for the default locale.\n\n  The default implementation of this method simply returns this\n charset's canonical name.  Concrete subclasses of this class may\n override this method in order to provide a localized display name. "}, {"method_name": "isRegistered", "method_sig": "public final boolean isRegistered()", "description": "Tells whether or not this charset is registered in the IANA Charset\n Registry."}, {"method_name": "displayName", "method_sig": "public String displayName (Locale locale)", "description": "Returns this charset's human-readable name for the given locale.\n\n  The default implementation of this method simply returns this\n charset's canonical name.  Concrete subclasses of this class may\n override this method in order to provide a localized display name. "}, {"method_name": "contains", "method_sig": "public abstract boolean contains (Charset cs)", "description": "Tells whether or not this charset contains the given charset.\n\n  A charset C is said to contain a charset D if,\n and only if, every character representable in D is also\n representable in C.  If this relationship holds then it is\n guaranteed that every string that can be encoded in D can also be\n encoded in C without performing any replacements.\n\n  That C contains D does not imply that each character\n representable in C by a particular byte sequence is represented\n in D by the same byte sequence, although sometimes this is the\n case.\n\n  Every charset contains itself.\n\n  This method computes an approximation of the containment relation:\n If it returns true then the given charset is known to be\n contained by this charset; if it returns false, however, then\n it is not necessarily the case that the given charset is not contained\n in this charset."}, {"method_name": "newDecoder", "method_sig": "public abstract CharsetDecoder newDecoder()", "description": "Constructs a new decoder for this charset."}, {"method_name": "newEncoder", "method_sig": "public abstract CharsetEncoder newEncoder()", "description": "Constructs a new encoder for this charset."}, {"method_name": "canEncode", "method_sig": "public boolean canEncode()", "description": "Tells whether or not this charset supports encoding.\n\n  Nearly all charsets support encoding.  The primary exceptions are\n special-purpose auto-detect charsets whose decoders can determine\n which of several possible encoding schemes is in use by examining the\n input byte sequence.  Such charsets do not support encoding because\n there is no way to determine which encoding should be used on output.\n Implementations of such charsets should override this method to return\n false. "}, {"method_name": "decode", "method_sig": "public final CharBuffer decode (ByteBuffer bb)", "description": "Convenience method that decodes bytes in this charset into Unicode\n characters.\n\n  An invocation of this method upon a charset cs returns the\n same result as the expression\n\n \n     cs.newDecoder()\n       .onMalformedInput(CodingErrorAction.REPLACE)\n       .onUnmappableCharacter(CodingErrorAction.REPLACE)\n       .decode(bb); \n\n except that it is potentially more efficient because it can cache\n decoders between successive invocations.\n\n  This method always replaces malformed-input and unmappable-character\n sequences with this charset's default replacement byte array.  In order\n to detect such sequences, use the CharsetDecoder.decode(java.nio.ByteBuffer) method directly.  "}, {"method_name": "encode", "method_sig": "public final ByteBuffer encode (CharBuffer cb)", "description": "Convenience method that encodes Unicode characters into bytes in this\n charset.\n\n  An invocation of this method upon a charset cs returns the\n same result as the expression\n\n \n     cs.newEncoder()\n       .onMalformedInput(CodingErrorAction.REPLACE)\n       .onUnmappableCharacter(CodingErrorAction.REPLACE)\n       .encode(bb); \n\n except that it is potentially more efficient because it can cache\n encoders between successive invocations.\n\n  This method always replaces malformed-input and unmappable-character\n sequences with this charset's default replacement string.  In order to\n detect such sequences, use the CharsetEncoder.encode(java.nio.CharBuffer) method directly.  "}, {"method_name": "encode", "method_sig": "public final ByteBuffer encode (String str)", "description": "Convenience method that encodes a string into bytes in this charset.\n\n  An invocation of this method upon a charset cs returns the\n same result as the expression\n\n \n     cs.encode(CharBuffer.wrap(s)); "}, {"method_name": "compareTo", "method_sig": "public final int compareTo (Charset that)", "description": "Compares this charset to another.\n\n  Charsets are ordered by their canonical names, without regard to\n case. "}, {"method_name": "hashCode", "method_sig": "public final int hashCode()", "description": "Computes a hashcode for this charset."}, {"method_name": "equals", "method_sig": "public final boolean equals (Object ob)", "description": "Tells whether or not this object is equal to another.\n\n  Two charsets are equal if, and only if, they have the same canonical\n names.  A charset is never equal to any other type of object.  "}, {"method_name": "toString", "method_sig": "public final String toString()", "description": "Returns a string describing this charset."}]}