{"name": "Interface ClassLoaderReference", "module": "jdk.jdi", "package": "com.sun.jdi", "text": "A class loader object from the target VM.\n A ClassLoaderReference is an ObjectReference with additional\n access to classloader-specific information from the target VM. Instances\n ClassLoaderReference are obtained through calls to\n ReferenceType.classLoader()", "codes": ["public interface ClassLoaderReference\nextends ObjectReference"], "fields": [], "methods": [{"method_name": "definedClasses", "method_sig": "List<ReferenceType> definedClasses()", "description": "Returns a list of all loaded classes that were defined by this\n class loader. No ordering of this list guaranteed.\n \n The returned list will include reference types\n loaded at least to the point of preparation and\n types (like array) for which preparation is\n not defined."}, {"method_name": "visibleClasses", "method_sig": "List<ReferenceType> visibleClasses()", "description": "Returns a list of all classes for which this class loader has\n been recorded as the initiating loader in the target VM.\n The list contains ReferenceTypes defined directly by this loader\n (as returned by definedClasses()) and any types for which\n loading was delegated by this class loader to another class loader.\n \n The visible class list has useful properties with respect to\n the type namespace. A particular type name will occur at most\n once in the list. Each field or variable declared with that\n type name in a class defined by\n this class loader must be resolved to that single type.\n \n No ordering of the returned list is guaranteed.\n \n See\n The Java™ Virtual Machine Specification,\n section 5.3 - Creation and Loading\n for more information on the initiating classloader.\n \n Note that unlike definedClasses()\n and VirtualMachine.allClasses(),\n some of the returned reference types may not be prepared.\n Attempts to perform some operations on unprepared reference types\n (e.g. fields()) will throw\n a ClassNotPreparedException.\n Use ReferenceType.isPrepared() to determine if\n a reference type is prepared."}]}