{"name": "Class ColorSupported", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class ColorSupported is a printing attribute class, an enumeration,\n that identifies whether the device is capable of any type of color printing\n at all, including highlight color as well as full process color. All document\n instructions having to do with color are embedded within the print data (none\n are attributes attached to the job outside the print data).\n \n Note: End users are able to determine the nature and details of the color\n support by querying the\n PrinterMoreInfoManufacturer attribute.\n \n Don't confuse the ColorSupported attribute with the\n Chromaticity attribute.\n Chromaticity is an attribute the client can specify for\n a job to tell the printer whether to print a document in monochrome or color,\n possibly causing the printer to print a color document in monochrome.\n ColorSupported is a printer description attribute that tells whether\n the printer can print in color regardless of how the client specifies to\n print any particular document.\n \nIPP Compatibility: The IPP boolean value is \"true\" for SUPPORTED and\n \"false\" for NOT_SUPPORTED. The category name returned by getName() is\n the IPP attribute name. The enumeration's integer value is the IPP enum\n value. The toString() method returns the IPP string representation of\n the attribute value.", "codes": ["public final class ColorSupported\nextends EnumSyntax\nimplements PrintServiceAttribute"], "fields": [{"field_name": "NOT_SUPPORTED", "field_sig": "public static final ColorSupported NOT_SUPPORTED", "description": "The printer is not capable of any type of color printing."}, {"field_name": "SUPPORTED", "field_sig": "public static final ColorSupported SUPPORTED", "description": "The printer is capable of some type of color printing, such as highlight\n color or full process color."}], "methods": [{"method_name": "getStringTable", "method_sig": "protected String[] getStringTable()", "description": "Returns the string table for class ColorSupported."}, {"method_name": "getEnumValueTable", "method_sig": "protected EnumSyntax[] getEnumValueTable()", "description": "Returns the enumeration value table for class ColorSupported."}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class ColorSupported, the category is class\n ColorSupported itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class ColorSupported, the category name is\n \"color-supported\""}]}