{"name": "Class CompoundName", "module": "java.naming", "package": "javax.naming", "text": "This class represents a compound name -- a name from\n a hierarchical name space.\n Each component in a compound name is an atomic name.\n \n The components of a compound name are numbered.  The indexes of a\n compound name with N components range from 0 up to, but not including, N.\n This range may be written as [0,N).\n The most significant component is at index 0.\n An empty compound name has no components.\n\n Compound Name Syntax\n The syntax of a compound name is specified using a set of properties:\n\njndi.syntax.direction\n  Direction for parsing (\"right_to_left\", \"left_to_right\", \"flat\").\n      If unspecified, defaults to \"flat\", which means the namespace is flat\n      with no hierarchical structure.\n\n  jndi.syntax.separator\n  Separator between atomic name components.\n      Required unless direction is \"flat\".\n\n  jndi.syntax.ignorecase\n  If present, \"true\" means ignore the case when comparing name\n      components. If its value is not \"true\", or if the property is not\n      present, case is considered when comparing name components.\n\n  jndi.syntax.escape\n  If present, specifies the escape string for overriding separator,\n      escapes and quotes.\n\n  jndi.syntax.beginquote\n  If present, specifies the string delimiting start of a quoted string.\n\n  jndi.syntax.endquote\n  String delimiting end of quoted string.\n      If present, specifies the string delimiting the end of a quoted string.\n      If not present, use syntax.beginquote as end quote.\n  jndi.syntax.beginquote2\n  Alternative set of begin/end quotes.\n\n  jndi.syntax.endquote2\n  Alternative set of begin/end quotes.\n\n  jndi.syntax.trimblanks\n  If present, \"true\" means trim any leading and trailing whitespaces\n      in a name component for comparison purposes. If its value is not\n      \"true\", or if the property is not present, blanks are significant.\n  jndi.syntax.separator.ava\n  If present, specifies the string that separates\n      attribute-value-assertions when specifying multiple attribute/value\n      pairs. (e.g. \",\"  in age=65,gender=male).\n  jndi.syntax.separator.typeval\n  If present, specifies the string that separates attribute\n              from value (e.g. \"=\" in \"age=65\")\n\n These properties are interpreted according to the following rules:\n\n\n In a string without quotes or escapes, any instance of the\n separator delimits two atomic names. Each atomic name is referred\n to as a component.\n\n A separator, quote or escape is escaped if preceded immediately\n (on the left) by the escape.\n\n If there are two sets of quotes, a specific begin-quote must be matched\n by its corresponding end-quote.\n\n A non-escaped begin-quote which precedes a component must be\n matched by a non-escaped end-quote at the end of the component.\n A component thus quoted is referred to as a\n quoted component. It is parsed by\n removing the being- and end- quotes, and by treating the intervening\n characters as ordinary characters unless one of the rules involving\n quoted components listed below applies.\n\n Quotes embedded in non-quoted components are treated as ordinary strings\n and need not be matched.\n\n A separator that is escaped or appears between non-escaped\n quotes is treated as an ordinary string and not a separator.\n\n An escape string within a quoted component acts as an escape only when\n followed by the corresponding end-quote string.\n This can be used to embed an escaped quote within a quoted component.\n\n An escaped escape string is not treated as an escape string.\n\n An escape string that does not precede a meta string (quotes or separator)\n and is not at the end of a component is treated as an ordinary string.\n\n A leading separator (the compound name string begins with\n a separator) denotes a leading empty atomic component (consisting\n of an empty string).\n A trailing separator (the compound name string ends with\n a separator) denotes a trailing empty atomic component.\n Adjacent separators denote an empty atomic component.\n\n\n The string form of the compound name follows the syntax described above.\n When the components of the compound name are turned into their\n string representation, the reserved syntax rules described above are\n applied (e.g. embedded separators are escaped or quoted)\n so that when the same string is parsed, it will yield the same components\n of the original compound name.\n\nMultithreaded Access\n A CompoundName instance is not synchronized against concurrent\n multithreaded access. Multiple threads trying to access and modify a\n CompoundName should lock the object.", "codes": ["public class CompoundName\nextends Object\nimplements Name"], "fields": [{"field_name": "mySyntax", "field_sig": "protected transient Properties mySyntax", "description": "Syntax properties for this compound name.\n This field is initialized by the constructors and cannot be null.\n It should be treated as a read-only variable by subclasses.\n Any necessary changes to mySyntax should be made within constructors\n and not after the compound name has been instantiated."}], "methods": [{"method_name": "toString", "method_sig": "public String toString()", "description": "Generates the string representation of this compound name, using\n the syntax rules of the compound name. The syntax rules\n are described in the class description.\n An empty component is represented by an empty string.\n\n The string representation thus generated can be passed to\n the CompoundName constructor with the same syntax properties\n to create a new equivalent compound name."}, {"method_name": "equals", "method_sig": "public boolean equals (Object obj)", "description": "Determines whether obj is syntactically equal to this compound name.\n If obj is null or not a CompoundName, false is returned.\n Two compound names are equal if each component in one is \"equal\"\n to the corresponding component in the other.\n\n Equality is also defined in terms of the syntax of this compound name.\n The default implementation of CompoundName uses the syntax properties\n jndi.syntax.ignorecase and jndi.syntax.trimblanks when comparing\n two components for equality.  If case is ignored, two strings\n with the same sequence of characters but with different cases\n are considered equal. If blanks are being trimmed, leading and trailing\n blanks are ignored for the purpose of the comparison.\n\n Both compound names must have the same number of components.\n\n Implementation note: Currently the syntax properties of the two compound\n names are not compared for equality. They might be in the future."}, {"method_name": "hashCode", "method_sig": "public int hashCode()", "description": "Computes the hash code of this compound name.\n The hash code is the sum of the hash codes of the \"canonicalized\"\n forms of individual components of this compound name.\n Each component is \"canonicalized\" according to the\n compound name's syntax before its hash code is computed.\n For a case-insensitive name, for example, the uppercased form of\n a name has the same hash code as its lowercased equivalent."}, {"method_name": "clone", "method_sig": "public Object clone()", "description": "Creates a copy of this compound name.\n Changes to the components of this compound name won't\n affect the new copy and vice versa.\n The clone and this compound name share the same syntax."}, {"method_name": "compareTo", "method_sig": "public int compareTo (Object obj)", "description": "Compares this CompoundName with the specified Object for order.\n Returns a\n negative integer, zero, or a positive integer as this Name is less\n than, equal to, or greater than the given Object.\n \n If obj is null or not an instance of CompoundName, ClassCastException\n is thrown.\n \n See equals() for what it means for two compound names to be equal.\n If two compound names are equal, 0 is returned.\n\n Ordering of compound names depend on the syntax of the compound name.\n By default, they follow lexicographical rules for string comparison\n with the extension that this applies to all the components in the\n compound name and that comparison of individual components is\n affected by the jndi.syntax.ignorecase and jndi.syntax.trimblanks\n properties, identical to how they affect equals().\n If this compound name is \"lexicographically\" lesser than obj,\n a negative number is returned.\n If this compound name is \"lexicographically\" greater than obj,\n a positive number is returned.\n\n Implementation note: Currently the syntax properties of the two compound\n names are not compared when checking order. They might be in the future."}, {"method_name": "size", "method_sig": "public int size()", "description": "Retrieves the number of components in this compound name."}, {"method_name": "isEmpty", "method_sig": "public boolean isEmpty()", "description": "Determines whether this compound name is empty.\n A compound name is empty if it has zero components."}, {"method_name": "getAll", "method_sig": "public Enumeration<String> getAll()", "description": "Retrieves the components of this compound name as an enumeration\n of strings.\n The effects of updates to this compound name on this enumeration\n is undefined."}, {"method_name": "get", "method_sig": "public String get (int posn)", "description": "Retrieves a component of this compound name."}, {"method_name": "getPrefix", "method_sig": "public Name getPrefix (int posn)", "description": "Creates a compound name whose components consist of a prefix of the\n components in this compound name.\n The result and this compound name share the same syntax.\n Subsequent changes to\n this compound name do not affect the name that is returned and\n vice versa."}, {"method_name": "getSuffix", "method_sig": "public Name getSuffix (int posn)", "description": "Creates a compound name whose components consist of a suffix of the\n components in this compound name.\n The result and this compound name share the same syntax.\n Subsequent changes to\n this compound name do not affect the name that is returned."}, {"method_name": "startsWith", "method_sig": "public boolean startsWith (Name n)", "description": "Determines whether a compound name is a prefix of this compound name.\n A compound name 'n' is a prefix if it is equal to\n getPrefix(n.size())--in other words, this compound name\n starts with 'n'.\n If n is null or not a compound name, false is returned.\n\n Implementation note: Currently the syntax properties of n\n  are not used when doing the comparison. They might be in the future."}, {"method_name": "endsWith", "method_sig": "public boolean endsWith (Name n)", "description": "Determines whether a compound name is a suffix of this compound name.\n A compound name 'n' is a suffix if it is equal to\n getSuffix(size()-n.size())--in other words, this\n compound name ends with 'n'.\n If n is null or not a compound name, false is returned.\n\n Implementation note: Currently the syntax properties of n\n  are not used when doing the comparison. They might be in the future."}, {"method_name": "addAll", "method_sig": "public Name addAll (Name suffix)\n            throws InvalidNameException", "description": "Adds the components of a compound name -- in order -- to the end of\n this compound name.\n\n Implementation note: Currently the syntax properties of suffix\n  is not used or checked. They might be in the future."}, {"method_name": "addAll", "method_sig": "public Name addAll (int posn,\n                   Name n)\n            throws InvalidNameException", "description": "Adds the components of a compound name -- in order -- at a specified\n position within this compound name.\n Components of this compound name at or after the index of the first\n new component are shifted up (away from index 0)\n to accommodate the new components.\n\n Implementation note: Currently the syntax properties of suffix\n  is not used or checked. They might be in the future."}, {"method_name": "add", "method_sig": "public Name add (String comp)\n         throws InvalidNameException", "description": "Adds a single component to the end of this compound name."}, {"method_name": "add", "method_sig": "public Name add (int posn,\n                String comp)\n         throws InvalidNameException", "description": "Adds a single component at a specified position within this\n compound name.\n Components of this compound name at or after the index of the new\n component are shifted up by one (away from index 0)\n to accommodate the new component."}, {"method_name": "remove", "method_sig": "public Object remove (int posn)\n              throws InvalidNameException", "description": "Deletes a component from this compound name.\n The component of this compound name at position 'posn' is removed,\n and components at indices greater than 'posn'\n are shifted down (towards index 0) by one."}]}