{"name": "Class CompiledScript", "module": "java.scripting", "package": "javax.script", "text": "Extended by classes that store results of compilations.  State\n might be stored in the form of Java classes, Java class files or scripting\n language opcodes.  The script may be executed repeatedly\n without reparsing.\n \n Each CompiledScript is associated with a ScriptEngine -- A call to an  eval\n method of the CompiledScript causes the execution of the script by the\n ScriptEngine.  Changes in the state of the ScriptEngine caused by execution\n of the CompiledScript  may visible during subsequent executions of scripts by the engine.", "codes": ["public abstract class CompiledScript\nextends Object"], "fields": [], "methods": [{"method_name": "eval", "method_sig": "public abstract Object eval (ScriptContext context)\n                     throws ScriptException", "description": "Executes the program stored in this CompiledScript object."}, {"method_name": "eval", "method_sig": "public Object eval (Bindings bindings)\n            throws ScriptException", "description": "Executes the program stored in the CompiledScript object using\n the supplied Bindings of attributes as the ENGINE_SCOPE of the\n associated ScriptEngine during script execution.  If bindings is null,\n then the effect of calling this method is same as that of eval(getEngine().getContext()).\n .\n The GLOBAL_SCOPE Bindings, Reader and Writer\n associated with the default ScriptContext of the associated ScriptEngine are used."}, {"method_name": "eval", "method_sig": "public Object eval()\n            throws ScriptException", "description": "Executes the program stored in the CompiledScript object.  The\n default ScriptContext of the associated ScriptEngine is used.\n The effect of calling this method is same as that of eval(getEngine().getContext())."}, {"method_name": "getEngine", "method_sig": "public abstract ScriptEngine getEngine()", "description": "Returns the ScriptEngine whose compile method created this CompiledScript.\n The CompiledScript will execute in this engine."}]}