{"name": "Interface CompositeData", "module": "java.management", "package": "javax.management.openmbean", "text": "The CompositeData interface specifies\n the behavior of a specific type of complex open data objects\n which represent composite data structures.", "codes": ["public interface CompositeData"], "fields": [], "methods": [{"method_name": "getCompositeType", "method_sig": "CompositeType getCompositeType()", "description": "Returns the composite type  of this composite data instance."}, {"method_name": "get", "method_sig": "Object get (String key)", "description": "Returns the value of the item whose name is key."}, {"method_name": "getAll", "method_sig": "Object[] getAll (String[] keys)", "description": "Returns an array of the values of the items whose names\n are specified by keys, in the same order as keys."}, {"method_name": "containsKey", "method_sig": "boolean containsKey (String key)", "description": "Returns true if and only if this CompositeData instance contains\n an item whose name is key.\n If key is a null or empty String, this method simply returns false."}, {"method_name": "containsValue", "method_sig": "boolean containsValue (Object value)", "description": "Returns true if and only if this CompositeData instance contains an item\n whose value is value."}, {"method_name": "values", "method_sig": "Collection<?> values()", "description": "Returns an unmodifiable Collection view of the item values\n contained in this CompositeData instance.\n The returned collection's iterator will return the values\n in the ascending lexicographic order of the corresponding\n item names."}, {"method_name": "equals", "method_sig": "boolean equals (Object obj)", "description": "Compares the specified obj parameter with this\n CompositeData instance for equality.\n \n Returns true if and only if all of the following statements are true:\n \nobj is non null,\nobj also implements the CompositeData interface,\ntheir composite types are equal\ntheir contents, i.e. (name, value) pairs are equal. If a value contained in\n the content is an array, the value comparison is done as if by calling\n the deepEquals method\n for arrays of object reference types or the appropriate overloading of\n Arrays.equals(e1,e2) for arrays of primitive types\n\n\n This ensures that this equals method works properly for\n obj parameters which are different implementations of the\n CompositeData interface, with the restrictions mentioned in the\n equals\n method of the java.util.Collection interface."}, {"method_name": "hashCode", "method_sig": "int hashCode()", "description": "Returns the hash code value for this CompositeData instance.\n \n The hash code of a CompositeData instance is the sum of the hash codes\n of all elements of information used in equals comparisons\n (ie: its composite type and all the item values).\n \n This ensures that t1.equals(t2) implies that t1.hashCode()==t2.hashCode()\n for any two CompositeData instances t1 and t2,\n as required by the general contract of the method\n Object.hashCode().\n \n Each item value's hash code is added to the returned hash code.\n If an item value is an array,\n its hash code is obtained as if by calling the\n deepHashCode method\n for arrays of object reference types or the appropriate overloading\n of Arrays.hashCode(e) for arrays of primitive types."}, {"method_name": "toString", "method_sig": "String toString()", "description": "Returns a string representation of this CompositeData instance.\n \n The string representation consists of the name of the implementing class,\n the string representation of the composite type of this instance,\n and the string representation of the contents\n (ie list the itemName=itemValue mappings)."}]}