{"name": "Class ComponentUI", "module": "java.desktop", "package": "javax.swing.plaf", "text": "The base class for all UI delegate objects in the Swing pluggable\n look and feel architecture.  The UI delegate object for a Swing\n component is responsible for implementing the aspects of the\n component that depend on the look and feel.\n The JComponent class\n invokes methods from this class in order to delegate operations\n (painting, layout calculations, etc.) that may vary depending on the\n look and feel installed.  Client programs should not invoke methods\n on this class directly.", "codes": ["public abstract class ComponentUI\nextends Object"], "fields": [], "methods": [{"method_name": "installUI", "method_sig": "public void installUI (JComponent c)", "description": "Configures the specified component appropriately for the look and feel.\n This method is invoked when the ComponentUI instance is being installed\n as the UI delegate on the specified component.  This method should\n completely configure the component for the look and feel,\n including the following:\n \nInstall default property values for color, fonts, borders,\n     icons, opacity, etc. on the component.  Whenever possible,\n     property values initialized by the client program should not\n     be overridden.\n Install a LayoutManager on the component if necessary.\n Create/add any required sub-components to the component.\n Create/install event listeners on the component.\n Create/install a PropertyChangeListener on the component in order\n     to detect and respond to component property changes appropriately.\n Install keyboard UI (mnemonics, traversal, etc.) on the component.\n Initialize any appropriate instance data.\n "}, {"method_name": "uninstallUI", "method_sig": "public void uninstallUI (JComponent c)", "description": "Reverses configuration which was done on the specified component during\n installUI.  This method is invoked when this\n UIComponent instance is being removed as the UI delegate\n for the specified component.  This method should undo the\n configuration performed in installUI, being careful to\n leave the JComponent instance in a clean state (no\n extraneous listeners, look-and-feel-specific property objects, etc.).\n This should include the following:\n \nRemove any UI-set borders from the component.\n Remove any UI-set layout managers on the component.\n Remove any UI-added sub-components from the component.\n Remove any UI-added event/property listeners from the component.\n Remove any UI-installed keyboard UI from the component.\n Nullify any allocated instance data objects to allow for GC.\n "}, {"method_name": "paint", "method_sig": "public void paint (Graphics g,\n                  JComponent c)", "description": "Paints the specified component appropriately for the look and feel.\n This method is invoked from the ComponentUI.update method when\n the specified component is being painted.  Subclasses should override\n this method and use the specified Graphics object to\n render the content of the component."}, {"method_name": "update", "method_sig": "public void update (Graphics g,\n                   JComponent c)", "description": "Notifies this UI delegate that it is time to paint the specified\n component.  This method is invoked by JComponent\n when the specified component is being painted.\n\n By default this method fills the specified component with\n its background color if its opaque property is true,\n and then immediately calls paint. In general this method need\n not be overridden by subclasses; all look-and-feel rendering code should\n reside in the paint method."}, {"method_name": "getPreferredSize", "method_sig": "public Dimension getPreferredSize (JComponent c)", "description": "Returns the specified component's preferred size appropriate for\n the look and feel.  If null is returned, the preferred\n size will be calculated by the component's layout manager instead\n (this is the preferred approach for any component with a specific\n layout manager installed).  The default implementation of this\n method returns null."}, {"method_name": "getMinimumSize", "method_sig": "public Dimension getMinimumSize (JComponent c)", "description": "Returns the specified component's minimum size appropriate for\n the look and feel.  If null is returned, the minimum\n size will be calculated by the component's layout manager instead\n (this is the preferred approach for any component with a specific\n layout manager installed).  The default implementation of this\n method invokes getPreferredSize and returns that value."}, {"method_name": "getMaximumSize", "method_sig": "public Dimension getMaximumSize (JComponent c)", "description": "Returns the specified component's maximum size appropriate for\n the look and feel.  If null is returned, the maximum\n size will be calculated by the component's layout manager instead\n (this is the preferred approach for any component with a specific\n layout manager installed).  The default implementation of this\n method invokes getPreferredSize and returns that value."}, {"method_name": "contains", "method_sig": "public boolean contains (JComponent c,\n                        int x,\n                        int y)", "description": "Returns true if the specified x,y location is\n contained within the look and feel's defined shape of the specified\n component. x and y are defined to be relative\n to the coordinate system of the specified component.  Although\n a component's bounds is constrained to a rectangle,\n this method provides the means for defining a non-rectangular\n shape within those bounds for the purpose of hit detection."}, {"method_name": "createUI", "method_sig": "public static ComponentUI createUI (JComponent c)", "description": "Returns an instance of the UI delegate for the specified component.\n Each subclass must provide its own static createUI\n method that returns an instance of that UI delegate subclass.\n If the UI delegate subclass is stateless, it may return an instance\n that is shared by multiple components.  If the UI delegate is\n stateful, then it should return a new instance per component.\n The default implementation of this method throws an error, as it\n should never be invoked."}, {"method_name": "getBaseline", "method_sig": "public int getBaseline (JComponent c,\n                       int width,\n                       int height)", "description": "Returns the baseline.  The baseline is measured from the top of\n the component.  This method is primarily meant for\n LayoutManagers to align components along their\n baseline.  A return value less than 0 indicates this component\n does not have a reasonable baseline and that\n LayoutManagers should not align this component on\n its baseline.\n \n This method returns -1.  Subclasses that have a meaningful baseline\n should override appropriately."}, {"method_name": "getBaselineResizeBehavior", "method_sig": "public Component.BaselineResizeBehavior getBaselineResizeBehavior (JComponent c)", "description": "Returns an enum indicating how the baseline of the component\n changes as the size changes.  This method is primarily meant for\n layout managers and GUI builders.\n \n This method returns BaselineResizeBehavior.OTHER.\n Subclasses that support a baseline should override appropriately."}, {"method_name": "getAccessibleChildrenCount", "method_sig": "public int getAccessibleChildrenCount (JComponent c)", "description": "Returns the number of accessible children in the object.  If all\n of the children of this object implement Accessible,\n this\n method should return the number of children of this object.\n UIs might wish to override this if they present areas on the\n screen that can be viewed as components, but actual components\n are not used for presenting those areas.\n\n Note: As of v1.3, it is recommended that developers call\n Component.AccessibleAWTComponent.getAccessibleChildrenCount() instead\n of this method."}, {"method_name": "getAccessibleChild", "method_sig": "public Accessible getAccessibleChild (JComponent c,\n                                     int i)", "description": "Returns the ith Accessible child of the object.\n UIs might need to override this if they present areas on the\n screen that can be viewed as components, but actual components\n are not used for presenting those areas.\n\n \n\n Note: As of v1.3, it is recommended that developers call\n Component.AccessibleAWTComponent.getAccessibleChild() instead of\n this method."}]}