{"name": "Class ConcurrentLinkedQueue<E>", "module": "java.base", "package": "java.util.concurrent", "text": "An unbounded thread-safe queue based on linked nodes.\n This queue orders elements FIFO (first-in-first-out).\n The head of the queue is that element that has been on the\n queue the longest time.\n The tail of the queue is that element that has been on the\n queue the shortest time. New elements\n are inserted at the tail of the queue, and the queue retrieval\n operations obtain elements at the head of the queue.\n A ConcurrentLinkedQueue is an appropriate choice when\n many threads will share access to a common collection.\n Like most other concurrent collection implementations, this class\n does not permit the use of null elements.\n\n This implementation employs an efficient non-blocking\n algorithm based on one described in\n \n Simple, Fast, and Practical Non-Blocking and Blocking Concurrent Queue\n Algorithms by Maged M. Michael and Michael L. Scott.\n\n Iterators are weakly consistent, returning elements\n reflecting the state of the queue at some point at or since the\n creation of the iterator.  They do not throw ConcurrentModificationException, and may proceed concurrently\n with other operations.  Elements contained in the queue since the creation\n of the iterator will be returned exactly once.\n\n Beware that, unlike in most collections, the size method\n is NOT a constant-time operation. Because of the\n asynchronous nature of these queues, determining the current number\n of elements requires a traversal of the elements, and so may report\n inaccurate results if this collection is modified during traversal.\n\n Bulk operations that add, remove, or examine multiple elements,\n such as addAll(java.util.Collection<? extends E>), removeIf(java.util.function.Predicate<? super E>) or forEach(java.util.function.Consumer<? super E>),\n are not guaranteed to be performed atomically.\n For example, a forEach traversal concurrent with an \n addAll operation might observe only some of the added elements.\n\n This class and its iterator implement all of the optional\n methods of the Queue and Iterator interfaces.\n\n Memory consistency effects: As with other concurrent\n collections, actions in a thread prior to placing an object into a\n ConcurrentLinkedQueue\nhappen-before\n actions subsequent to the access or removal of that element from\n the ConcurrentLinkedQueue in another thread.\n\n This class is a member of the\n \n Java Collections Framework.", "codes": ["public class ConcurrentLinkedQueue<E>\nextends AbstractQueue<E>\nimplements Queue<E>, Serializable"], "fields": [], "methods": [{"method_name": "add", "method_sig": "public boolean add (E e)", "description": "Inserts the specified element at the tail of this queue.\n As the queue is unbounded, this method will never throw\n IllegalStateException or return false."}, {"method_name": "offer", "method_sig": "public boolean offer (E e)", "description": "Inserts the specified element at the tail of this queue.\n As the queue is unbounded, this method will never return false."}, {"method_name": "isEmpty", "method_sig": "public boolean isEmpty()", "description": "Returns true if this queue contains no elements."}, {"method_name": "size", "method_sig": "public int size()", "description": "Returns the number of elements in this queue.  If this queue\n contains more than Integer.MAX_VALUE elements, returns\n Integer.MAX_VALUE.\n\n Beware that, unlike in most collections, this method is\n NOT a constant-time operation. Because of the\n asynchronous nature of these queues, determining the current\n number of elements requires an O(n) traversal.\n Additionally, if elements are added or removed during execution\n of this method, the returned result may be inaccurate.  Thus,\n this method is typically not very useful in concurrent\n applications."}, {"method_name": "contains", "method_sig": "public boolean contains (Object o)", "description": "Returns true if this queue contains the specified element.\n More formally, returns true if and only if this queue contains\n at least one element e such that o.equals(e)."}, {"method_name": "remove", "method_sig": "public boolean remove (Object o)", "description": "Removes a single instance of the specified element from this queue,\n if it is present.  More formally, removes an element e such\n that o.equals(e), if this queue contains one or more such\n elements.\n Returns true if this queue contained the specified element\n (or equivalently, if this queue changed as a result of the call)."}, {"method_name": "addAll", "method_sig": "public boolean addAll (Collection<? extends E> c)", "description": "Appends all of the elements in the specified collection to the end of\n this queue, in the order that they are returned by the specified\n collection's iterator.  Attempts to addAll of a queue to\n itself result in IllegalArgumentException."}, {"method_name": "toArray", "method_sig": "public Object[] toArray()", "description": "Returns an array containing all of the elements in this queue, in\n proper sequence.\n\n The returned array will be \"safe\" in that no references to it are\n maintained by this queue.  (In other words, this method must allocate\n a new array).  The caller is thus free to modify the returned array.\n\n This method acts as bridge between array-based and collection-based\n APIs."}, {"method_name": "toArray", "method_sig": "public <T> T[] toArray (T[] a)", "description": "Returns an array containing all of the elements in this queue, in\n proper sequence; the runtime type of the returned array is that of\n the specified array.  If the queue fits in the specified array, it\n is returned therein.  Otherwise, a new array is allocated with the\n runtime type of the specified array and the size of this queue.\n\n If this queue fits in the specified array with room to spare\n (i.e., the array has more elements than this queue), the element in\n the array immediately following the end of the queue is set to\n null.\n\n Like the toArray() method, this method acts as bridge between\n array-based and collection-based APIs.  Further, this method allows\n precise control over the runtime type of the output array, and may,\n under certain circumstances, be used to save allocation costs.\n\n Suppose x is a queue known to contain only strings.\n The following code can be used to dump the queue into a newly\n allocated array of String:\n\n  String[] y = x.toArray(new String[0]);\n\n Note that toArray(new Object[0]) is identical in function to\n toArray()."}, {"method_name": "iterator", "method_sig": "public Iterator<E> iterator()", "description": "Returns an iterator over the elements in this queue in proper sequence.\n The elements will be returned in order from first (head) to last (tail).\n\n The returned iterator is\n weakly consistent."}, {"method_name": "spliterator", "method_sig": "public Spliterator<E> spliterator()", "description": "Returns a Spliterator over the elements in this queue.\n\n The returned spliterator is\n weakly consistent.\n\n The Spliterator reports Spliterator.CONCURRENT,\n Spliterator.ORDERED, and Spliterator.NONNULL."}, {"method_name": "removeIf", "method_sig": "public boolean removeIf (Predicate<? super E> filter)", "description": "Description copied from interface: Collection"}, {"method_name": "removeAll", "method_sig": "public boolean removeAll (Collection<?> c)", "description": "Description copied from class: AbstractCollection"}, {"method_name": "retainAll", "method_sig": "public boolean retainAll (Collection<?> c)", "description": "Description copied from class: AbstractCollection"}, {"method_name": "forEach", "method_sig": "public void forEach (Consumer<? super E> action)", "description": "Description copied from interface: Iterable"}]}