{"name": "Interface Control", "module": "java.naming", "package": "javax.naming.ldap", "text": "This interface represents an LDAPv3 control as defined in\n RFC 2251.\n\n The LDAPv3 protocol uses controls to send and receive additional data\n to affect the behavior of predefined operations.\n Controls can be sent along with any LDAP operation to the server.\n These are referred to as request controls. For example, a\n \"sort\" control can be sent with an LDAP search operation to\n request that the results be returned in a particular order.\n Solicited and unsolicited controls can also be returned with\n responses from the server. Such controls are referred to as\n response controls. For example, an LDAP server might\n define a special control to return change notifications.\n\n This interface is used to represent both request and response controls.", "codes": ["public interface Control\nextends Serializable"], "fields": [{"field_name": "CRITICAL", "field_sig": "static final boolean CRITICAL", "description": "Indicates a critical control.\n The value of this constant is true."}, {"field_name": "NONCRITICAL", "field_sig": "static final boolean NONCRITICAL", "description": "Indicates a non-critical control.\n The value of this constant is false."}], "methods": [{"method_name": "getID", "method_sig": "String getID()", "description": "Retrieves the object identifier assigned for the LDAP control."}, {"method_name": "isCritical", "method_sig": "boolean isCritical()", "description": "Determines the criticality of the LDAP control.\n A critical control must not be ignored by the server.\n In other words, if the server receives a critical control\n that it does not support, regardless of whether the control\n makes sense for the operation, the operation will not be performed\n and an OperationNotSupportedException will be thrown."}, {"method_name": "getEncodedValue", "method_sig": "byte[] getEncodedValue()", "description": "Retrieves the ASN.1 BER encoded value of the LDAP control.\n The result is the raw BER bytes including the tag and length of\n the control's value. It does not include the controls OID or criticality.\n\n Null is returned if the value is absent."}]}