{"name": "Class Copies", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class Copies is an integer valued printing attribute class that\n specifies the number of copies to be printed.\n \n On many devices the supported number of collated copies will be limited by\n the number of physical output bins on the device, and may be different from\n the number of uncollated copies which can be supported.\n \n The effect of a Copies attribute with a value of n on a\n multidoc print job (a job with multiple documents) depends on the (perhaps\n defaulted) value of the\n MultipleDocumentHandling attribute:\n \nSINGLE_DOCUMENT -- The result will be n copies of a\n   single output document comprising all the input docs.\n   SINGLE_DOCUMENT_NEW_SHEET -- The result will be n copies\n   of a single output document comprising all the input docs, and the first\n   impression of each input doc will always start on a new media sheet.\n   SEPARATE_DOCUMENTS_UNCOLLATED_COPIES -- The result will be\n   n copies of the first input document, followed by n copies of\n   the second input document, . . . followed by n copies of the last\n   input document.\n   SEPARATE_DOCUMENTS_COLLATED_COPIES -- The result will be the\n   first input document, the second input document, . . . the last input\n   document, the group of documents being repeated n times.\n \n\nIPP Compatibility: The integer value gives the IPP integer value. The\n category name returned by getName() gives the IPP attribute name.", "codes": ["public final class Copies\nextends IntegerSyntax\nimplements PrintRequestAttribute, PrintJobAttribute"], "fields": [], "methods": [{"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this copies attribute is equivalent to the passed in\n object. To be equivalent, all of the following conditions must be true:\n \nobject is not null.\n   object is an instance of class Copies.\n   This copies attribute's value and object's value are equal.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class Copies, the category is class Copies itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class Copies, the category name is \"copies\"."}]}