{"name": "Class DateTimeAtCompleted", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class DateTimeAtCompleted is a printing attribute class, a date-time\n attribute, that indicates the date and time at which the Print Job completed\n (or was canceled or aborted).\n \n To construct a DateTimeAtCompleted attribute from separate values of\n the year, month, day, hour, minute, and so on, use a\n Calendar object to construct a Date object,\n then use the Date object to construct the DateTimeAtCompleted\n attribute. To convert a DateTimeAtCompleted attribute to separate\n values of the year, month, day, hour, minute, and so on, create a\n Calendar object and set it to the Date from the\n DateTimeAtCompleted attribute.\n \nIPP Compatibility: The information needed to construct an IPP\n \"date-time-at-completed\" attribute can be obtained as described above. The\n category name returned by getName() gives the IPP attribute name.", "codes": ["public final class DateTimeAtCompleted\nextends DateTimeSyntax\nimplements PrintJobAttribute"], "fields": [], "methods": [{"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this date-time at completed attribute is equivalent to\n the passed in object. To be equivalent, all of the following conditions\n must be true:\n \nobject is not null.\n   object is an instance of class DateTimeAtCompleted.\n   This date-time at completed attribute's Date\n   value and object's Date value are equal.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class DateTimeAtCompleted, the category is class\n DateTimeAtCompleted itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class DateTimeAtCompleted, the category name is\n \"date-time-at-completed\"."}]}