{"name": "Class DateTimeAtCreation", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class DateTimeAtCreation is a printing attribute class, a date-time\n attribute, that indicates the date and time at which the Print Job was\n created.\n \n To construct a DateTimeAtCreation attribute from separate values of\n the year, month, day, hour, minute, and so on, use a\n Calendar object to construct a Date object,\n then use the Date object to construct the DateTimeAtCreation\n attribute. To convert a DateTimeAtCreation attribute to separate\n values of the year, month, day, hour, minute, and so on, create a\n Calendar object and set it to the Date from the\n DateTimeAtCreation attribute.\n \nIPP Compatibility: The information needed to construct an IPP\n \"date-time-at-creation\" attribute can be obtained as described above. The\n category name returned by getName() gives the IPP attribute name.", "codes": ["public final class DateTimeAtCreation\nextends DateTimeSyntax\nimplements PrintJobAttribute"], "fields": [], "methods": [{"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this date-time at creation attribute is equivalent to the\n passed in object. To be equivalent, all of the following conditions must\n be true:\n \nobject is not null.\n   object is an instance of class DateTimeAtCreation.\n   This date-time at creation attribute's Date\n   value and object's Date value are equal.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class DateTimeAtCreation, the category is class\n DateTimeAtCreation itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class DateTimeAtCreation, the category name is\n \"date-time-at-creation\"."}]}