{"name": "Class Destination", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class Destination is a printing attribute class, a URI, that\n is used to indicate an alternate destination for the spooled printer\n formatted data. Many PrintServices will not support the notion of a\n destination other than the printer device, and so will not support this\n attribute.\n \n A common use for this attribute will be applications which want to redirect\n output to a local disk file : eg.\"file:out.prn\". Note that proper\n construction of \"file:\" scheme URI instances should be performed\n using the toURI() method of class File. See the\n documentation on that class for more information.\n \n If a destination URI is specified in a PrintRequest and it is not\n accessible for output by the PrintService, a PrintException\n will be thrown. The PrintException may implement URIException\n to provide a more specific cause.\n \nIPP Compatibility: Destination is not an IPP attribute.", "codes": ["public final class Destination\nextends URISyntax\nimplements PrintJobAttribute, PrintRequestAttribute"], "fields": [], "methods": [{"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this destination attribute is equivalent to the passed in\n object. To be equivalent, all of the following conditions must be true:\n \nobject is not null.\n   object is an instance of class Destination.\n   This destination attribute's URI and object's\n   URI are equal.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class Destination, the category is class Destination\n itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class Destination, the category name is\n \"spool-data-destination\"."}]}