{"name": "Class Dictionary<K,​V>", "module": "java.base", "package": "java.util", "text": "The Dictionary class is the abstract parent of any\n class, such as Hashtable, which maps keys to values.\n Every key and every value is an object. In any one Dictionary\n object, every key is associated with at most one value. Given a\n Dictionary and a key, the associated element can be looked up.\n Any non-null object can be used as a key and as a value.\n \n As a rule, the equals method should be used by\n implementations of this class to decide if two keys are the same.\n \nNOTE: This class is obsolete.  New implementations should\n implement the Map interface, rather than extending this class.", "codes": ["public abstract class Dictionary<K, V>\nextends Object"], "fields": [], "methods": [{"method_name": "size", "method_sig": "public abstract int size()", "description": "Returns the number of entries (distinct keys) in this dictionary."}, {"method_name": "isEmpty", "method_sig": "public abstract boolean isEmpty()", "description": "Tests if this dictionary maps no keys to value. The general contract\n for the isEmpty method is that the result is true if and only\n if this dictionary contains no entries."}, {"method_name": "keys", "method_sig": "public abstract Enumeration<K> keys()", "description": "Returns an enumeration of the keys in this dictionary. The general\n contract for the keys method is that an Enumeration object\n is returned that will generate all the keys for which this dictionary\n contains entries."}, {"method_name": "elements", "method_sig": "public abstract Enumeration<V> elements()", "description": "Returns an enumeration of the values in this dictionary. The general\n contract for the elements method is that an\n Enumeration is returned that will generate all the elements\n contained in entries in this dictionary."}, {"method_name": "get", "method_sig": "public abstract V get (Object key)", "description": "Returns the value to which the key is mapped in this dictionary.\n The general contract for the isEmpty method is that if this\n dictionary contains an entry for the specified key, the associated\n value is returned; otherwise, null is returned."}, {"method_name": "put", "method_sig": "public abstract V put (K key,\n                      V value)", "description": "Maps the specified key to the specified\n value in this dictionary. Neither the key nor the\n value can be null.\n \n If this dictionary already contains an entry for the specified\n key, the value already in this dictionary for that\n key is returned, after modifying the entry to contain the\n  new element. If this dictionary does not already have an entry\n  for the specified key, an entry is created for the\n  specified key and value, and null is\n  returned.\n \n The value can be retrieved by calling the\n get method with a key that is equal to\n the original key."}, {"method_name": "remove", "method_sig": "public abstract V remove (Object key)", "description": "Removes the key (and its corresponding\n value) from this dictionary. This method does nothing\n if the key is not in this dictionary."}]}