{"name": "Class DigestOutputStream", "module": "java.base", "package": "java.security", "text": "A transparent stream that updates the associated message digest using\n the bits going through the stream.\n\n To complete the message digest computation, call one of the\n digest methods on the associated message\n digest after your calls to one of this digest output stream's\n write methods.\n\n It is possible to turn this stream on or off (see\n on). When it is on, a call to one of the\n write methods results in\n an update on the message digest.  But when it is off, the message\n digest is not updated. The default is for the stream to be on.", "codes": ["public class DigestOutputStream\nextends FilterOutputStream"], "fields": [{"field_name": "digest", "field_sig": "protected MessageDigest digest", "description": "The message digest associated with this stream."}], "methods": [{"method_name": "getMessageDigest", "method_sig": "public MessageDigest getMessageDigest()", "description": "Returns the message digest associated with this stream."}, {"method_name": "setMessageDigest", "method_sig": "public void setMessageDigest (MessageDigest digest)", "description": "Associates the specified message digest with this stream."}, {"method_name": "write", "method_sig": "public void write (int b)\n           throws IOException", "description": "Updates the message digest (if the digest function is on) using\n the specified byte, and in any case writes the byte\n to the output stream. That is, if the digest function is on\n (see on), this method calls\n update on the message digest associated with this\n stream, passing it the byte b. This method then\n writes the byte to the output stream, blocking until the byte\n is actually written."}, {"method_name": "write", "method_sig": "public void write (byte[] b,\n                  int off,\n                  int len)\n           throws IOException", "description": "Updates the message digest (if the digest function is on) using\n the specified subarray, and in any case writes the subarray to\n the output stream. That is, if the digest function is on (see\n on), this method calls update\n on the message digest associated with this stream, passing it\n the subarray specifications. This method then writes the subarray\n bytes to the output stream, blocking until the bytes are actually\n written."}, {"method_name": "on", "method_sig": "public void on (boolean on)", "description": "Turns the digest function on or off. The default is on.  When\n it is on, a call to one of the write methods results in an\n update on the message digest.  But when it is off, the message\n digest is not updated."}, {"method_name": "toString", "method_sig": "public String toString()", "description": "Prints a string representation of this digest output stream and\n its associated message digest object."}]}