{"name": "Class DigestInputStream", "module": "java.base", "package": "java.security", "text": "A transparent stream that updates the associated message digest using\n the bits going through the stream.\n\n To complete the message digest computation, call one of the\n digest methods on the associated message\n digest after your calls to one of this digest input stream's\n read methods.\n\n It is possible to turn this stream on or off (see\n on). When it is on, a call to one of the\n read methods\n results in an update on the message digest.  But when it is off,\n the message digest is not updated. The default is for the stream\n to be on.\n\n Note that digest objects can compute only one digest (see\n MessageDigest),\n so that in order to compute intermediate digests, a caller should\n retain a handle onto the digest object, and clone it for each\n digest to be computed, leaving the original digest untouched.", "codes": ["public class DigestInputStream\nextends FilterInputStream"], "fields": [{"field_name": "digest", "field_sig": "protected MessageDigest digest", "description": "The message digest associated with this stream."}], "methods": [{"method_name": "getMessageDigest", "method_sig": "public MessageDigest getMessageDigest()", "description": "Returns the message digest associated with this stream."}, {"method_name": "setMessageDigest", "method_sig": "public void setMessageDigest (MessageDigest digest)", "description": "Associates the specified message digest with this stream."}, {"method_name": "read", "method_sig": "public int read()\n         throws IOException", "description": "Reads a byte, and updates the message digest (if the digest\n function is on).  That is, this method reads a byte from the\n input stream, blocking until the byte is actually read. If the\n digest function is on (see on), this method\n will then call update on the message digest associated\n with this stream, passing it the byte read."}, {"method_name": "read", "method_sig": "public int read (byte[] b,\n                int off,\n                int len)\n         throws IOException", "description": "Reads into a byte array, and updates the message digest (if the\n digest function is on).  That is, this method reads up to\n len bytes from the input stream into the array\n b, starting at offset off. This method\n blocks until the data is actually\n read. If the digest function is on (see\n on), this method will then call update\n on the message digest associated with this stream, passing it\n the data."}, {"method_name": "on", "method_sig": "public void on (boolean on)", "description": "Turns the digest function on or off. The default is on.  When\n it is on, a call to one of the read methods results in an\n update on the message digest.  But when it is off, the message\n digest is not updated."}, {"method_name": "toString", "method_sig": "public String toString()", "description": "Prints a string representation of this digest input stream and\n its associated message digest object."}]}