{"name": "Interface Doclet", "module": "jdk.javadoc", "package": "jdk.javadoc.doclet", "text": "The user doclet must implement this interface, as described in the\n package description.\n Each implementation of a Doclet must provide a public no-argument constructor\n to be used by tools to instantiate the doclet. The tool infrastructure will\n interact with classes implementing this interface as follows:\n \n The tool will create an instance of a doclet using the no-arg constructor\n  of the doclet class.\n  Next, the tool calls the init method with an appropriate locale\n  and reporter.\n  Afterwards, the tool calls getSupportedOptions,\n and getSupportedSourceVersion.\n These methods are only called once.\n  As appropriate, the tool calls the run method on the doclet\n object, giving it a DocletEnvironment object, from which the doclet can determine\n the elements to be included in the documentation.\n \n\n If a doclet object is created and used without the above protocol being followed,\n then the doclet's behavior is not defined by this interface specification.\n  To start the doclet, pass -doclet followed by the fully-qualified\n name of the entry point class (i.e. the implementation of this interface) on\n the javadoc tool command line.", "codes": ["public interface Doclet"], "fields": [], "methods": [{"method_name": "init", "method_sig": "void init (Locale locale,\n          Reporter reporter)", "description": "Initializes this doclet with the given locale and error reporter.\n This locale will be used by the reporter and the doclet components."}, {"method_name": "getName", "method_sig": "String getName()", "description": "Returns a name identifying the doclet. A name is a simple identifier\n without white spaces, as defined in The Java™ Language Specification,\n section 6.2 \"Names and Identifiers\"."}, {"method_name": "getSupportedOptions", "method_sig": "Set<? extends Doclet.Option> getSupportedOptions()", "description": "Returns all the supported options."}, {"method_name": "getSupportedSourceVersion", "method_sig": "SourceVersion getSupportedSourceVersion()", "description": "Returns the version of the Java Programming Language supported\n by this doclet."}, {"method_name": "run", "method_sig": "boolean run (DocletEnvironment environment)", "description": "The entry point of the doclet. Further processing will commence as\n instructed by this method."}]}