{"name": "Interface DocPrintJob", "module": "java.desktop", "package": "javax.print", "text": "This interface represents a print job that can print a specified document\n with a set of job attributes. An object implementing this interface is\n obtained from a print service.", "codes": ["public interface DocPrintJob"], "fields": [], "methods": [{"method_name": "getPrintService", "method_sig": "PrintService getPrintService()", "description": "Determines the PrintService object to which this print job object\n is bound."}, {"method_name": "getAttributes", "method_sig": "PrintJobAttributeSet getAttributes()", "description": "Obtains this Print Job's set of printing attributes. The returned\n attribute set object is unmodifiable. The returned attribute set object\n is a \"snapshot\" of this Print Job's attribute set at the time of the\n getAttributes() method call; that is, the returned attribute\n set's object's contents will not be updated if this Print Job's attribute\n set's contents change in the future. To detect changes in attribute\n values, call getAttributes() again and compare the new attribute\n set to the previous attribute set; alternatively, register a listener for\n print job events. The returned value may be an empty set but should not\n be null."}, {"method_name": "addPrintJobListener", "method_sig": "void addPrintJobListener (PrintJobListener listener)", "description": "Registers a listener for event occurring during this print job. If\n listener is null, no exception is thrown and no action is\n performed. If listener is already registered, it will be registered\n again."}, {"method_name": "removePrintJobListener", "method_sig": "void removePrintJobListener (PrintJobListener listener)", "description": "Removes a listener from this print job. This method performs no function,\n nor does it throw an exception, if the listener specified by the argument\n was not previously added to this print job. If listener is null,\n no exception is thrown and no action is performed. If a listener was\n registered more than once only one of the registrations will be removed."}, {"method_name": "addPrintJobAttributeListener", "method_sig": "void addPrintJobAttributeListener (PrintJobAttributeListener listener,\n                                  PrintJobAttributeSet attributes)", "description": "Registers a listener for changes in the specified attributes. If listener\n is null, no exception is thrown and no action is performed. To\n determine the attribute updates that may be reported by this job, a\n client can call getAttributes() and identify the subset that are\n interesting and likely to be reported to the listener. Clients expecting\n to be updated about changes in a specific job attribute should verify it\n is in that set, but updates about an attribute will be made only if it\n changes and this is detected by the job. Also updates may be subject to\n batching by the job. To minimize overhead in print job processing it is\n recommended to listen on only that subset of attributes which are likely\n to change. If the specified set is empty no attribute updates will be\n reported to the listener. If the attribute set is null, then this\n means to listen on all dynamic attributes that the job supports. This may\n result in no update notifications if a job can not report any attribute\n updates.\n \n If listener is already registered, it will be registered again."}, {"method_name": "removePrintJobAttributeListener", "method_sig": "void removePrintJobAttributeListener (PrintJobAttributeListener listener)", "description": "Removes an attribute listener from this print job. This method performs\n no function, nor does it throw an exception, if the listener specified by\n the argument was not previously added to this print job. If the listener\n is null, no exception is thrown and no action is performed. If a\n listener is registered more than once, even for a different set of\n attributes, no guarantee is made which listener is removed."}, {"method_name": "print", "method_sig": "void print (Doc doc,\n           PrintRequestAttributeSet attributes)\n    throws PrintException", "description": "Prints a document with the specified job attributes. This method should\n only be called once for a given print job. Calling it again will not\n result in a new job being spooled to the printer. The service\n implementation will define policy for service interruption and recovery.\n When the print method returns, printing may not yet have completed as\n printing may happen asynchronously, perhaps in a different thread.\n Application clients which want to monitor the success or failure should\n register a PrintJobListener.\n \n Print service implementors should close any print data streams (ie\n Reader or InputStream implementations) that they obtain\n from the client doc. Robust clients may still wish to verify this. An\n exception is always generated if a DocFlavor cannot be printed."}]}