{"name": "Class DocumentParser", "module": "java.desktop", "package": "javax.swing.text.html.parser", "text": "A Parser for HTML Documents (actually, you can specify a DTD, but\n you should really only use this class with the html dtd in swing).\n Reads an InputStream of HTML and\n invokes the appropriate methods in the ParserCallback class. This\n is the default parser used by HTMLEditorKit to parse HTML url's.\n This will message the callback for all valid tags, as well as\n tags that are implied but not explicitly specified. For example, the\n html string (<p>blah) only has a p tag defined. The callback\n will see the following methods:\n handleStartTag(html, ...)\nhandleStartTag(head, ...)\nhandleEndTag(head)\nhandleStartTag(body, ...)\nhandleStartTag(p, ...)\nhandleText(...)\nhandleEndTag(p)\nhandleEndTag(body)\nhandleEndTag(html)\n\n The items in italic are implied, that is, although they were not\n explicitly specified, to be correct html they should have been present\n (head isn't necessary, but it is still generated). For tags that\n are implied, the AttributeSet argument will have a value of\n Boolean.TRUE for the key\n HTMLEditorKit.ParserCallback.IMPLIED.\n HTML.Attributes defines a type safe enumeration of html attributes.\n If an attribute key of a tag is defined in HTML.Attribute, the\n HTML.Attribute will be used as the key, otherwise a String will be used.\n For example <p foo=bar class=neat> has two attributes. foo is\n not defined in HTML.Attribute, where as class is, therefore the\n AttributeSet will have two values in it, HTML.Attribute.CLASS with\n a String value of 'neat' and the String key 'foo' with a String value of\n 'bar'.\n The position argument will indicate the start of the tag, comment\n or text. Similar to arrays, the first character in the stream has a\n position of 0. For tags that are\n implied the position will indicate\n the location of the next encountered tag. In the first example,\n the implied start body and html tags will have the same position as the\n p tag, and the implied end p, html and body tags will all have the same\n position.\n As html skips whitespace the position for text will be the position\n of the first valid character, eg in the string '\\n\\n\\nblah'\n the text 'blah' will have a position of 3, the newlines are skipped.\n \n For attributes that do not have a value, eg in the html\n string <foo blah> the attribute blah\n does not have a value, there are two possible values that will be\n placed in the AttributeSet's value:\n \nIf the DTD does not contain an definition for the element, or the\n     definition does not have an explicit value then the value in the\n     AttributeSet will be HTML.NULL_ATTRIBUTE_VALUE.\n If the DTD contains an explicit value, as in:\n     <!ATTLIST OPTION selected (selected) #IMPLIED>\n     this value from the dtd (in this case selected) will be used.\n \n\n Once the stream has been parsed, the callback is notified of the most\n likely end of line string. The end of line string will be one of\n \\n, \\r or \\r\\n, which ever is encountered the most in parsing the\n stream.", "codes": ["public class DocumentParser\nextends Parser"], "fields": [], "methods": [{"method_name": "parse", "method_sig": "public void parse (Reader in,\n                  HTMLEditorKit.ParserCallback callback,\n                  boolean ignoreCharSet)\n           throws IOException", "description": "Parse an HTML stream, given a DTD."}, {"method_name": "handleStartTag", "method_sig": "protected void handleStartTag (TagElement tag)", "description": "Handle Start Tag."}, {"method_name": "handleEmptyTag", "method_sig": "protected void handleEmptyTag (TagElement tag)\n                       throws ChangedCharSetException", "description": "Handle Empty Tag."}, {"method_name": "handleEndTag", "method_sig": "protected void handleEndTag (TagElement tag)", "description": "Handle End Tag."}, {"method_name": "handleText", "method_sig": "protected void handleText (char[] data)", "description": "Handle Text."}]}