{"name": "Interface DocumentEvent", "module": "java.desktop", "package": "javax.swing.event", "text": "Interface for document change notifications.  This provides\n detailed information to Document observers about how the\n Document changed.  It provides high level information such\n as type of change and where it occurred, as well as the more\n detailed structural changes (What Elements were inserted and\n removed).", "codes": ["public interface DocumentEvent"], "fields": [], "methods": [{"method_name": "getOffset", "method_sig": "int getOffset()", "description": "Returns the offset within the document of the start\n of the change."}, {"method_name": "getLength", "method_sig": "int getLength()", "description": "Returns the length of the change."}, {"method_name": "getDocument", "method_sig": "Document getDocument()", "description": "Gets the document that sourced the change event."}, {"method_name": "getType", "method_sig": "DocumentEvent.EventType getType()", "description": "Gets the type of event."}, {"method_name": "getChange", "method_sig": "DocumentEvent.ElementChange getChange (Element elem)", "description": "Gets the change information for the given element.\n The change information describes what elements were\n added and removed and the location.  If there were\n no changes, null is returned.\n \n This method is for observers to discover the structural\n changes that were made.  This means that only elements\n that existed prior to the mutation (and still exist after\n the mutation) need to have ElementChange records.\n The changes made available need not be recursive.\n \n For example, if the an element is removed from it's\n parent, this method should report that the parent\n changed and provide an ElementChange implementation\n that describes the change to the parent.  If the\n child element removed had children, these elements\n do not need to be reported as removed.\n \n If an child element is insert into a parent element,\n the parent element should report a change.  If the\n child element also had elements inserted into it\n (grandchildren to the parent) these elements need\n not report change."}]}