{"name": "Class DragSourceEvent", "module": "java.desktop", "package": "java.awt.dnd", "text": "This class is the base class for\n DragSourceDragEvent and\n DragSourceDropEvent.\n \nDragSourceEvents are generated whenever the drag enters, moves\n over, or exits a drop site, when the drop action changes, and when the drag\n ends. The location for the generated DragSourceEvent specifies\n the mouse cursor location in screen coordinates at the moment this event\n occurred.\n \n In a multi-screen environment without a virtual device, the cursor location is\n specified in the coordinate system of the initiator\nGraphicsConfiguration. The initiator\nGraphicsConfiguration is the GraphicsConfiguration\n of the Component on which the drag gesture for the current drag\n operation was recognized. If the cursor location is outside the bounds of\n the initiator GraphicsConfiguration, the reported coordinates are\n clipped to fit within the bounds of that GraphicsConfiguration.\n \n In a multi-screen environment with a virtual device, the location is specified\n in the corresponding virtual coordinate system. If the cursor location is\n outside the bounds of the virtual device the reported coordinates are\n clipped to fit within the bounds of the virtual device.", "codes": ["public class DragSourceEvent\nextends EventObject"], "fields": [], "methods": [{"method_name": "getDragSourceContext", "method_sig": "public DragSourceContext getDragSourceContext()", "description": "This method returns the DragSourceContext that\n originated the event."}, {"method_name": "getLocation", "method_sig": "public Point getLocation()", "description": "This method returns a Point indicating the cursor\n location in screen coordinates at the moment this event occurred, or\n null if the cursor location is not specified for this\n event."}, {"method_name": "getX", "method_sig": "public int getX()", "description": "This method returns the horizontal coordinate of the cursor location in\n screen coordinates at the moment this event occurred, or zero if the\n cursor location is not specified for this event."}, {"method_name": "getY", "method_sig": "public int getY()", "description": "This method returns the vertical coordinate of the cursor location in\n screen coordinates at the moment this event occurred, or zero if the\n cursor location is not specified for this event."}]}