{"name": "Interface DTDHandler", "module": "java.xml", "package": "org.xml.sax", "text": "Receive notification of basic DTD-related events.\n\n \nThis module, both source code and documentation, is in the\n Public Domain, and comes with NO WARRANTY.\n See http://www.saxproject.org\n for further information.\n \nIf a SAX application needs information about notations and\n unparsed entities, then the application implements this\n interface and registers an instance with the SAX parser using\n the parser's setDTDHandler method.  The parser uses the\n instance to report notation and unparsed entity declarations to\n the application.\nNote that this interface includes only those DTD events that\n the XML recommendation requires processors to report:\n notation and unparsed entity declarations.\nThe SAX parser may report these events in any order, regardless\n of the order in which the notations and unparsed entities were\n declared; however, all DTD events must be reported after the\n document handler's startDocument event, and before the first\n startElement event.\n (If the LexicalHandler is\n used, these events must also be reported before the endDTD event.)\n \nIt is up to the application to store the information for\n future use (perhaps in a hash table or object tree).\n If the application encounters attributes of type \"NOTATION\",\n \"ENTITY\", or \"ENTITIES\", it can use the information that it\n obtained through this interface to find the entity and/or\n notation corresponding with the attribute value.", "codes": ["public interface DTDHandler"], "fields": [], "methods": [{"method_name": "notationDecl", "method_sig": "void notationDecl (String name,\n                  String publicId,\n                  String systemId)\n           throws SAXException", "description": "Receive notification of a notation declaration event.\n\n It is up to the application to record the notation for later\n reference, if necessary;\n notations may appear as attribute values and in unparsed entity\n declarations, and are sometime used with processing instruction\n target names.\nAt least one of publicId and systemId must be non-null.\n If a system identifier is present, and it is a URL, the SAX\n parser must resolve it fully before passing it to the\n application through this event.\nThere is no guarantee that the notation declaration will be\n reported before any unparsed entities that use it."}, {"method_name": "unparsedEntityDecl", "method_sig": "void unparsedEntityDecl (String name,\n                        String publicId,\n                        String systemId,\n                        String notationName)\n                 throws SAXException", "description": "Receive notification of an unparsed entity declaration event.\n\n Note that the notation name corresponds to a notation\n reported by the notationDecl event.\n It is up to the application to record the entity for later\n reference, if necessary;\n unparsed entities may appear as attribute values.\n \nIf the system identifier is a URL, the parser must resolve it\n fully before passing it to the application."}]}