{"name": "Class ElementKindVisitor7<R,​P>", "module": "java.compiler", "package": "javax.lang.model.util", "text": "A visitor of program elements based on their kind with default behavior appropriate for the RELEASE_7 source version.  For elements Xyz that may have more than one\n kind, the visitXyz methods in this class delegate\n to the visitXyzAsKind method corresponding to the\n first argument's kind.  The visitXyzAsKind methods\n call defaultAction, passing their arguments\n to defaultAction's corresponding parameters.\n\n  Methods in this class may be overridden subject to their\n general contract.  Note that annotating methods in concrete\n subclasses with @Override will help\n ensure that methods are overridden as intended.\n\n  WARNING: The ElementVisitor interface\n implemented by this class may have methods added to it or the\n ElementKind enum used in this case may have\n constants added to it in the future to accommodate new, currently\n unknown, language structures added to future versions of the\n Java™ programming language.  Therefore, methods whose names\n begin with \"visit\" may be added to this class in the\n future; to avoid incompatibilities, classes which extend this class\n should not declare any instance methods with names beginning with\n \"visit\".\n\n When such a new visit method is added, the default\n implementation in this class will be to call the visitUnknown method.  A new abstract element kind\n visitor class will also be introduced to correspond to the new\n language level; this visitor will have different default behavior\n for the visit method in question.  When the new visitor is\n introduced, all or portions of this visitor may be deprecated.", "codes": ["@SupportedSourceVersion(RELEASE_7)\npublic class ElementKindVisitor7<R, P>\nextends ElementKindVisitor6<R, P>"], "fields": [], "methods": [{"method_name": "visitVariableAsResourceVariable", "method_sig": "public R visitVariableAsResourceVariable (VariableElement e,\n                                         P p)", "description": "Visits a RESOURCE_VARIABLE variable element."}]}