{"name": "Class Encoder", "module": "java.desktop", "package": "java.beans", "text": "An Encoder is a class which can be used to create\n files or streams that encode the state of a collection of\n JavaBeans in terms of their public APIs. The Encoder,\n in conjunction with its persistence delegates, is responsible for\n breaking the object graph down into a series of Statements\n and Expressions which can be used to create it.\n A subclass typically provides a syntax for these expressions\n using some human readable form - like Java source code or XML.", "codes": ["public class Encoder\nextends Object"], "fields": [], "methods": [{"method_name": "writeObject", "method_sig": "protected void writeObject (Object o)", "description": "Write the specified object to the output stream.\n The serialized form will denote a series of\n expressions, the combined effect of which will create\n an equivalent object when the input stream is read.\n By default, the object is assumed to be a JavaBean\n with a nullary constructor, whose state is defined by\n the matching pairs of \"setter\" and \"getter\" methods\n returned by the Introspector."}, {"method_name": "setExceptionListener", "method_sig": "public void setExceptionListener (ExceptionListener exceptionListener)", "description": "Sets the exception handler for this stream to exceptionListener.\n The exception handler is notified when this stream catches recoverable\n exceptions."}, {"method_name": "getExceptionListener", "method_sig": "public ExceptionListener getExceptionListener()", "description": "Gets the exception handler for this stream."}, {"method_name": "getPersistenceDelegate", "method_sig": "public PersistenceDelegate getPersistenceDelegate (Class<?> type)", "description": "Returns the persistence delegate for the given type.\n The persistence delegate is calculated by applying\n the following rules in order:\n \n\n If a persistence delegate is associated with the given type\n by using the setPersistenceDelegate(java.lang.Class<?>, java.beans.PersistenceDelegate) method\n it is returned.\n \n A persistence delegate is then looked up by the name\n composed of the fully qualified name of the given type\n and the \"PersistenceDelegate\" postfix.\n For example, a persistence delegate for the Bean class\n should be named BeanPersistenceDelegate\n and located in the same package.\n \n public class Bean { ... }\n public class BeanPersistenceDelegate { ... }\n The instance of the BeanPersistenceDelegate class\n is returned for the Bean class.\n \n If the type is null,\n a shared internal persistence delegate is returned\n that encodes null value.\n \n If the type is an enum declaration,\n a shared internal persistence delegate is returned\n that encodes constants of this enumeration\n by their names.\n \n If the type is a primitive type or the corresponding wrapper,\n a shared internal persistence delegate is returned\n that encodes values of the given type.\n \n If the type is an array,\n a shared internal persistence delegate is returned\n that encodes an array of the appropriate type and length,\n and each of its elements as if they are properties.\n \n If the type is a proxy,\n a shared internal persistence delegate is returned\n that encodes a proxy instance by using\n the Proxy.newProxyInstance(java.lang.ClassLoader, java.lang.Class<?>[], java.lang.reflect.InvocationHandler) method.\n \n If the BeanInfo for this type has a BeanDescriptor\n which defined a \"persistenceDelegate\" attribute,\n the value of this named attribute is returned.\n \n In all other cases the default persistence delegate is returned.\n The default persistence delegate assumes the type is a JavaBean,\n implying that it has a default constructor and that its state\n may be characterized by the matching pairs of \"setter\" and \"getter\"\n methods returned by the Introspector class.\n The default constructor is the constructor with the greatest number\n of parameters that has the ConstructorProperties annotation.\n If none of the constructors has the ConstructorProperties annotation,\n then the nullary constructor (constructor with no parameters) will be used.\n For example, in the following code fragment, the nullary constructor\n for the Foo class will be used,\n while the two-parameter constructor\n for the Bar class will be used.\n \n public class Foo {\n     public Foo() { ... }\n     public Foo(int x) { ... }\n }\n public class Bar {\n     public Bar() { ... }\n     @ConstructorProperties({\"x\"})\n     public Bar(int x) { ... }\n     @ConstructorProperties({\"x\", \"y\"})\n     public Bar(int x, int y) { ... }\n }\n"}, {"method_name": "setPersistenceDelegate", "method_sig": "public void setPersistenceDelegate (Class<?> type,\n                                   PersistenceDelegate delegate)", "description": "Associates the specified persistence delegate with the given type."}, {"method_name": "remove", "method_sig": "public Object remove (Object oldInstance)", "description": "Removes the entry for this instance, returning the old entry."}, {"method_name": "get", "method_sig": "public Object get (Object oldInstance)", "description": "Returns a tentative value for oldInstance in\n the environment created by this stream. A persistence\n delegate can use its mutatesTo method to\n determine whether this value may be initialized to\n form the equivalent object at the output or whether\n a new object must be instantiated afresh. If the\n stream has not yet seen this value, null is returned."}, {"method_name": "writeStatement", "method_sig": "public void writeStatement (Statement oldStm)", "description": "Writes statement oldStm to the stream.\n The oldStm should be written entirely\n in terms of the callers environment, i.e. the\n target and all arguments should be part of the\n object graph being written. These expressions\n represent a series of \"what happened\" expressions\n which tell the output stream how to produce an\n object graph like the original.\n \n The implementation of this method will produce\n a second expression to represent the same expression in\n an environment that will exist when the stream is read.\n This is achieved simply by calling writeObject\n on the target and all the arguments and building a new\n expression with the results."}, {"method_name": "writeExpression", "method_sig": "public void writeExpression (Expression oldExp)", "description": "The implementation first checks to see if an\n expression with this value has already been written.\n If not, the expression is cloned, using\n the same procedure as writeStatement,\n and the value of this expression is reconciled\n with the value of the cloned expression\n by calling writeObject."}]}