{"name": "Class EnumControl", "module": "java.desktop", "package": "javax.sound.sampled", "text": "An EnumControl provides control over a set of discrete possible\n values, each represented by an object. In a graphical user interface, such a\n control might be represented by a set of buttons, each of which chooses one\n value or setting. For example, a reverb control might provide several preset\n reverberation settings, instead of providing continuously adjustable\n parameters of the sort that would be represented by FloatControl\n objects.\n \n Controls that provide a choice between only two settings can often be\n implemented instead as a BooleanControl, and controls that provide a\n set of values along some quantifiable dimension might be implemented instead\n as a FloatControl with a coarse resolution. However, a key feature of\n EnumControl is that the returned values are arbitrary objects, rather\n than numerical or boolean values. This means that each returned object can\n provide further information. As an example, the settings of a\n REVERB control are instances of\n ReverbType that can be queried for the parameter values used for each\n setting.", "codes": ["public abstract class EnumControl\nextends Control"], "fields": [], "methods": [{"method_name": "setValue", "method_sig": "public void setValue (Object value)", "description": "Sets the current value for the control. The default implementation simply\n sets the value as indicated. If the value indicated is not supported, an\n IllegalArgumentException is thrown. Some controls require that\n their line be open before they can be affected by setting a value."}, {"method_name": "getValue", "method_sig": "public Object getValue()", "description": "Obtains this control's current value."}, {"method_name": "getValues", "method_sig": "public Object[] getValues()", "description": "Returns the set of possible values for this control."}, {"method_name": "toString", "method_sig": "public String toString()", "description": "Provides a string representation of the control."}]}