{"name": "Interface ErrorHandler", "module": "java.xml", "package": "org.xml.sax", "text": "Basic interface for SAX error handlers.\n\n \nThis module, both source code and documentation, is in the\n Public Domain, and comes with NO WARRANTY.\n See http://www.saxproject.org\n for further information.\n \nIf a SAX application needs to implement customized error\n handling, it must implement this interface and then register an\n instance with the XML reader using the\n setErrorHandler\n method.  The parser will then report all errors and warnings\n through this interface.\nWARNING: If an application does not\n register an ErrorHandler, XML parsing errors will go unreported,\n except that SAXParseExceptions will be thrown for fatal errors.\n In order to detect validity errors, an ErrorHandler that does something\n with error() calls must be registered.\nFor XML processing errors, a SAX driver must use this interface\n in preference to throwing an exception: it is up to the application\n to decide whether to throw an exception for different types of\n errors and warnings.  Note, however, that there is no requirement that\n the parser continue to report additional errors after a call to\n fatalError.  In other words, a SAX driver class\n may throw an exception after reporting any fatalError.\n Also parsers may throw appropriate exceptions for non-XML errors.\n For example, XMLReader.parse() would throw\n an IOException for errors accessing entities or the document.", "codes": ["public interface ErrorHandler"], "fields": [], "methods": [{"method_name": "warning", "method_sig": "void warning (SAXParseException exception)\n      throws SAXException", "description": "Receive notification of a warning.\n\n SAX parsers will use this method to report conditions that\n are not errors or fatal errors as defined by the XML\n recommendation.  The default behaviour is to take no\n action.\nThe SAX parser must continue to provide normal parsing events\n after invoking this method: it should still be possible for the\n application to process the document through to the end.\nFilters may use this method to report other, non-XML warnings\n as well."}, {"method_name": "error", "method_sig": "void error (SAXParseException exception)\n    throws SAXException", "description": "Receive notification of a recoverable error.\n\n This corresponds to the definition of \"error\" in section 1.2\n of the W3C XML 1.0 Recommendation.  For example, a validating\n parser would use this callback to report the violation of a\n validity constraint.  The default behaviour is to take no\n action.\nThe SAX parser must continue to provide normal parsing\n events after invoking this method: it should still be possible\n for the application to process the document through to the end.\n If the application cannot do so, then the parser should report\n a fatal error even if the XML recommendation does not require\n it to do so.\nFilters may use this method to report other, non-XML errors\n as well."}, {"method_name": "fatalError", "method_sig": "void fatalError (SAXParseException exception)\n         throws SAXException", "description": "Receive notification of a non-recoverable error.\n\n There is an apparent contradiction between the\n documentation for this method and the documentation for ContentHandler.endDocument().  Until this ambiguity\n is resolved in a future major release, clients should make no\n assumptions about whether endDocument() will or will not be\n invoked when the parser has reported a fatalError() or thrown\n an exception.\nThis corresponds to the definition of \"fatal error\" in\n section 1.2 of the W3C XML 1.0 Recommendation.  For example, a\n parser would use this callback to report the violation of a\n well-formedness constraint.\nThe application must assume that the document is unusable\n after the parser has invoked this method, and should continue\n (if at all) only for the sake of collecting additional error\n messages: in fact, SAX parsers are free to stop reporting any\n other events once this method has been invoked."}]}