{"name": "Interface ErrorListener", "module": "java.xml", "package": "javax.xml.transform", "text": "To provide customized error handling, implement this interface and\n use the setErrorListener method to register an instance of the\n implementation with the Transformer.  The\n Transformer then reports all errors and warnings through this\n interface.\nIf an application does not register its own custom\n ErrorListener, the default ErrorListener\n is used which reports all warnings and errors to System.err\n and does not throw any Exceptions.\n Applications are strongly encouraged to register and use\n ErrorListeners that insure proper behavior for warnings and\n errors.\nFor transformation errors, a Transformer must use this\n interface instead of throwing an Exception: it is up to the\n application to decide whether to throw an Exception for\n different types of errors and warnings.  Note however that the\n Transformer is not required to continue with the transformation\n after a call to fatalError(TransformerException exception).\nTransformers may use this mechanism to report XML parsing\n errors as well as transformation errors.", "codes": ["public interface ErrorListener"], "fields": [], "methods": [{"method_name": "warning", "method_sig": "void warning (TransformerException exception)\n      throws TransformerException", "description": "Receive notification of a warning.\n\n Transformer can use this method to report\n conditions that are not errors or fatal errors.  The default behaviour\n is to take no action.\nAfter invoking this method, the Transformer must continue with\n the transformation. It should still be possible for the\n application to process the document through to the end."}, {"method_name": "error", "method_sig": "void error (TransformerException exception)\n    throws TransformerException", "description": "Receive notification of a recoverable error.\n\n The transformer must continue to try and provide normal transformation\n after invoking this method.  It should still be possible for the\n application to process the document through to the end if no other errors\n are encountered."}, {"method_name": "fatalError", "method_sig": "void fatalError (TransformerException exception)\n         throws TransformerException", "description": "Receive notification of a non-recoverable error.\nThe processor may choose to continue, but will not normally\n proceed to a successful completion.\nThe method should throw an exception if it is unable to\n process the error, or if it wishes execution to terminate\n immediately. The processor will not necessarily honor this\n request."}]}