{"name": "Interface EventTarget", "module": "java.xml", "package": "org.w3c.dom.events", "text": "The EventTarget interface is implemented by all\n Nodes in an implementation which supports the DOM Event\n Model. Therefore, this interface can be obtained by using\n binding-specific casting methods on an instance of the Node\n interface. The interface allows registration and removal of\n EventListeners on an EventTarget and dispatch\n of events to that EventTarget.\n See also the Document Object Model (DOM) Level 2 Events Specification.", "codes": ["public interface EventTarget"], "fields": [], "methods": [{"method_name": "addEventListener", "method_sig": "void addEventListener (String type,\n                      EventListener listener,\n                      boolean useCapture)", "description": "This method allows the registration of event listeners on the event\n target. If an EventListener is added to an\n EventTarget while it is processing an event, it will not\n be triggered by the current actions but may be triggered during a\n later stage of event flow, such as the bubbling phase.\n  If multiple identical EventListeners are registered\n on the same EventTarget with the same parameters the\n duplicate instances are discarded. They do not cause the\n EventListener to be called twice and since they are\n discarded they do not need to be removed with the\n removeEventListener method."}, {"method_name": "removeEventListener", "method_sig": "void removeEventListener (String type,\n                         EventListener listener,\n                         boolean useCapture)", "description": "This method allows the removal of event listeners from the event\n target. If an EventListener is removed from an\n EventTarget while it is processing an event, it will not\n be triggered by the current actions. EventListeners can\n never be invoked after being removed.\n Calling removeEventListener with arguments which do\n not identify any currently registered EventListener on\n the EventTarget has no effect."}, {"method_name": "dispatchEvent", "method_sig": "boolean dispatchEvent (Event evt)\n               throws EventException", "description": "This method allows the dispatch of events into the implementations\n event model. Events dispatched in this manner will have the same\n capturing and bubbling behavior as events dispatched directly by the\n implementation. The target of the event is the\n  EventTarget on which dispatchEvent is\n called."}]}