{"name": "Class Expression", "module": "java.desktop", "package": "java.beans", "text": "An Expression object represents a primitive expression\n in which a single method is applied to a target and a set of\n arguments to return a result - as in \"a.getFoo()\".\n \n In addition to the properties of the super class, the\n Expression object provides a value which\n is the object returned when this expression is evaluated.\n The return value is typically not provided by the caller and\n is instead computed by dynamically finding the method and invoking\n it when the first call to getValue is made.", "codes": ["public class Expression\nextends Statement"], "fields": [], "methods": [{"method_name": "execute", "method_sig": "public void execute()\n             throws Exception", "description": "The execute method finds a method whose name is the same\n as the methodName property, and invokes the method on\n the target.\n\n When the target's class defines many methods with the given name\n the implementation should choose the most specific method using\n the algorithm specified in the Java Language Specification\n (15.11). The dynamic class of the target and arguments are used\n in place of the compile-time type information and, like the\n Method class itself, conversion between\n primitive values and their associated wrapper classes is handled\n internally.\n \n The following method types are handled as special cases:\n \n\n Static methods may be called by using a class object as the target.\n \n The reserved method name \"new\" may be used to call a class's constructor\n as if all classes defined static \"new\" methods. Constructor invocations\n are typically considered Expressions rather than Statements\n as they return a value.\n \n The method names \"get\" and \"set\" defined in the List\n interface may also be applied to array instances, mapping to\n the static methods of the same name in the Array class.\n \n\n If the invoked method completes normally,\n the value it returns is copied in the value property.\n Note that the value property is set to null,\n if the return type of the underlying method is void."}, {"method_name": "getValue", "method_sig": "public Object getValue()\n                throws Exception", "description": "If the value property of this instance is not already set,\n this method dynamically finds the method with the specified\n methodName on this target with these arguments and calls it.\n The result of the method invocation is first copied\n into the value property of this expression and then returned\n as the result of getValue. If the value property\n was already set, either by a call to setValue\n or a previous call to getValue then the value\n property is returned without either looking up or calling the method.\n \n The value property of an Expression is set to\n a unique private (non-null) value by default and\n this value is used as an internal indication that the method\n has not yet been called. A return value of null\n replaces this default value in the same way that any other value\n would, ensuring that expressions are never evaluated more than once.\n \n See the execute method for details on how\n methods are chosen using the dynamic types of the target\n and arguments."}, {"method_name": "setValue", "method_sig": "public void setValue (Object value)", "description": "Sets the value of this expression to value.\n This value will be returned by the getValue method\n without calling the method associated with this\n expression."}, {"method_name": "toString", "method_sig": "public String toString()", "description": "Prints the value of this expression using a Java-style syntax."}]}