{"name": "Interface Externalizable", "module": "java.base", "package": "java.io", "text": "Only the identity of the class of an Externalizable instance is\n written in the serialization stream and it is the responsibility\n of the class to save and restore the contents of its instances.\n\n The writeExternal and readExternal methods of the Externalizable\n interface are implemented by a class to give the class complete\n control over the format and contents of the stream for an object\n and its supertypes. These methods must explicitly\n coordinate with the supertype to save its state. These methods supersede\n customized implementations of writeObject and readObject methods.\n\n Object Serialization uses the Serializable and Externalizable\n interfaces.  Object persistence mechanisms can use them as well.  Each\n object to be stored is tested for the Externalizable interface. If\n the object supports Externalizable, the writeExternal method is called. If the\n object does not support Externalizable and does implement\n Serializable, the object is saved using\n ObjectOutputStream.  When an Externalizable object is\n reconstructed, an instance is created using the public no-arg\n constructor, then the readExternal method called.  Serializable\n objects are restored by reading them from an ObjectInputStream.\n\n An Externalizable instance can designate a substitution object via\n the writeReplace and readResolve methods documented in the Serializable\n interface.", "codes": ["public interface Externalizable\nextends Serializable"], "fields": [], "methods": [{"method_name": "writeExternal", "method_sig": "void writeExternal (ObjectOutput out)\n            throws IOException", "description": "The object implements the writeExternal method to save its contents\n by calling the methods of DataOutput for its primitive values or\n calling the writeObject method of ObjectOutput for objects, strings,\n and arrays."}, {"method_name": "readExternal", "method_sig": "void readExternal (ObjectInput in)\n           throws IOException,\n                  ClassNotFoundException", "description": "The object implements the readExternal method to restore its\n contents by calling the methods of DataInput for primitive\n types and readObject for objects, strings and arrays.  The\n readExternal method must read the values in the same sequence\n and with the same types as were written by writeExternal."}]}