{"name": "Interface ExtendedResponse", "module": "java.naming", "package": "javax.naming.ldap", "text": "This interface represents an LDAP extended operation response as defined in\n RFC 2251.\n \n     ExtendedResponse ::= [APPLICATION 24] SEQUENCE {\n          COMPONENTS OF LDAPResult,\n          responseName     [10] LDAPOID OPTIONAL,\n          response         [11] OCTET STRING OPTIONAL }\n \n It comprises an optional object identifier and an optional ASN.1 BER\n encoded value.\n\n\n The methods in this class can be used by the application to get low\n level information about the extended operation response. However, typically,\n the application will be using methods specific to the class that\n implements this interface. Such a class should have decoded the BER buffer\n in the response and should provide methods that allow the user to\n access that data in the response in a type-safe and friendly manner.\n\n For example, suppose the LDAP server supported a 'get time' extended operation.\n It would supply GetTimeRequest and GetTimeResponse classes.\n The GetTimeResponse class might look like:\n\n public class GetTimeResponse implements ExtendedResponse {\n     public java.util.Date getDate() {...};\n     public long getTime() {...};\n     ....\n }\n\n A program would use then these classes as follows:\n\n GetTimeResponse resp =\n     (GetTimeResponse) ectx.extendedOperation(new GetTimeRequest());\n java.util.Date now = resp.getDate();\n", "codes": ["public interface ExtendedResponse\nextends Serializable"], "fields": [], "methods": [{"method_name": "getID", "method_sig": "String getID()", "description": "Retrieves the object identifier of the response.\n The LDAP protocol specifies that the response object identifier is optional.\n If the server does not send it, the response will contain no ID (i.e. null)."}, {"method_name": "getEncodedValue", "method_sig": "byte[] getEncodedValue()", "description": "Retrieves the ASN.1 BER encoded value of the LDAP extended operation\n response. Null is returned if the value is absent from the response\n sent by the LDAP server.\n The result is the raw BER bytes including the tag and length of\n the response value. It does not include the response OID."}]}