{"name": "Class FileDescriptor", "module": "java.base", "package": "java.io", "text": "Instances of the file descriptor class serve as an opaque handle\n to the underlying machine-specific structure representing an open\n file, an open socket, or another source or sink of bytes.\n The main practical use for a file descriptor is to create a\n FileInputStream or FileOutputStream to contain it.\n \n Applications should not create their own file descriptors.", "codes": ["public final class FileDescriptor\nextends Object"], "fields": [{"field_name": "in", "field_sig": "public static final FileDescriptor in", "description": "A handle to the standard input stream. Usually, this file\n descriptor is not used directly, but rather via the input stream\n known as System.in."}, {"field_name": "out", "field_sig": "public static final FileDescriptor out", "description": "A handle to the standard output stream. Usually, this file\n descriptor is not used directly, but rather via the output stream\n known as System.out."}, {"field_name": "err", "field_sig": "public static final FileDescriptor err", "description": "A handle to the standard error stream. Usually, this file\n descriptor is not used directly, but rather via the output stream\n known as System.err."}], "methods": [{"method_name": "valid", "method_sig": "public boolean valid()", "description": "Tests if this file descriptor object is valid."}, {"method_name": "sync", "method_sig": "public void sync()\n          throws SyncFailedException", "description": "Force all system buffers to synchronize with the underlying\n device.  This method returns after all modified data and\n attributes of this FileDescriptor have been written to the\n relevant device(s).  In particular, if this FileDescriptor\n refers to a physical storage medium, such as a file in a file\n system, sync will not return until all in-memory modified copies\n of buffers associated with this FileDescriptor have been\n written to the physical medium.\n\n sync is meant to be used by code that requires physical\n storage (such as a file) to be in a known state  For\n example, a class that provided a simple transaction facility\n might use sync to ensure that all changes to a file caused\n by a given transaction were recorded on a storage medium.\n\n sync only affects buffers downstream of this FileDescriptor.  If\n any in-memory buffering is being done by the application (for\n example, by a BufferedOutputStream object), those buffers must\n be flushed into the FileDescriptor (for example, by invoking\n OutputStream.flush) before that data will be affected by sync."}]}