{"name": "Class Files", "module": "java.base", "package": "java.nio.file", "text": "This class consists exclusively of static methods that operate on files,\n directories, or other types of files.\n\n  In most cases, the methods defined here will delegate to the associated\n file system provider to perform the file operations.", "codes": ["public final class Files\nextends Object"], "fields": [], "methods": [{"method_name": "newInputStream", "method_sig": "public static InputStream newInputStream (Path path,\n                                         OpenOption... options)\n                                  throws IOException", "description": "Opens a file, returning an input stream to read from the file. The stream\n will not be buffered, and is not required to support the mark or reset methods. The\n stream will be safe for access by multiple concurrent threads. Reading\n commences at the beginning of the file. Whether the returned stream is\n asynchronously closeable and/or interruptible is highly\n file system provider specific and therefore not specified.\n\n  The options parameter determines how the file is opened.\n If no options are present then it is equivalent to opening the file with\n the READ option. In addition to the \n READ option, an implementation may also support additional implementation\n specific options."}, {"method_name": "newOutputStream", "method_sig": "public static OutputStream newOutputStream (Path path,\n                                           OpenOption... options)\n                                    throws IOException", "description": "Opens or creates a file, returning an output stream that may be used to\n write bytes to the file. The resulting stream will not be buffered. The\n stream will be safe for access by multiple concurrent threads. Whether\n the returned stream is asynchronously closeable and/or\n interruptible is highly file system provider specific and\n therefore not specified.\n\n  This method opens or creates a file in exactly the manner specified\n by the newByteChannel\n method with the exception that the READ\n option may not be present in the array of options. If no options are\n present then this method works as if the CREATE, TRUNCATE_EXISTING,\n and WRITE options are present. In other\n words, it opens the file for writing, creating the file if it doesn't\n exist, or initially truncating an existing regular-file to a size of 0 if it exists.\n\n  Usage Examples:\n\n     Path path = ...\n\n     // truncate and overwrite an existing file, or create the file if\n     // it doesn't initially exist\n     OutputStream out = Files.newOutputStream(path);\n\n     // append to an existing file, fail if the file does not exist\n     out = Files.newOutputStream(path, APPEND);\n\n     // append to an existing file, create file if it doesn't initially exist\n     out = Files.newOutputStream(path, CREATE, APPEND);\n\n     // always create new file, failing if it already exists\n     out = Files.newOutputStream(path, CREATE_NEW);\n "}, {"method_name": "newByteChannel", "method_sig": "public static SeekableByteChannel newByteChannel (Path path,\n                                                 Set<? extends OpenOption> options,\n                                                 FileAttribute<?>... attrs)\n                                          throws IOException", "description": "Opens or creates a file, returning a seekable byte channel to access the\n file.\n\n  The options parameter determines how the file is opened.\n The READ and WRITE options determine if the file should be\n opened for reading and/or writing. If neither option (or the APPEND option) is present then the file is\n opened for reading. By default reading or writing commence at the\n beginning of the file.\n\n  In the addition to READ and WRITE, the following\n options may be present:\n\n \nOptions\n\n Option Description \n\n\n\n APPEND \n If this option is present then the file is opened for writing and\n     each invocation of the channel's write method first advances\n     the position to the end of the file and then writes the requested\n     data. Whether the advancement of the position and the writing of the\n     data are done in a single atomic operation is system-dependent and\n     therefore unspecified. This option may not be used in conjunction\n     with the READ or TRUNCATE_EXISTING options. \n\n\n TRUNCATE_EXISTING \n If this option is present then the existing file is truncated to\n   a size of 0 bytes. This option is ignored when the file is opened only\n   for reading. \n\n\n CREATE_NEW \n If this option is present then a new file is created, failing if\n   the file already exists or is a symbolic link. When creating a file the\n   check for the existence of the file and the creation of the file if it\n   does not exist is atomic with respect to other file system operations.\n   This option is ignored when the file is opened only for reading. \n\n\n CREATE \n If this option is present then an existing file is opened if it\n   exists, otherwise a new file is created. This option is ignored if the\n   CREATE_NEW option is also present or the file is opened only\n   for reading. \n\n\n DELETE_ON_CLOSE \n When this option is present then the implementation makes a\n   best effort attempt to delete the file when closed by the\n   close method. If the close\n   method is not invoked then a best effort attempt is made to\n   delete the file when the Java virtual machine terminates. \n\n\nSPARSE \n When creating a new file this option is a hint that the\n   new file will be sparse. This option is ignored when not creating\n   a new file. \n\n\n SYNC \n Requires that every update to the file's content or metadata be\n   written synchronously to the underlying storage device. (see  Synchronized I/O file\n   integrity). \n\n\n DSYNC \n Requires that every update to the file's content be written\n   synchronously to the underlying storage device. (see  Synchronized I/O file\n   integrity). \n\n\n\n An implementation may also support additional implementation specific\n options.\n\n  The attrs parameter is optional file-attributes to set atomically when a new file is created.\n\n  In the case of the default provider, the returned seekable byte channel\n is a FileChannel.\n\n  Usage Examples:\n\n     Path path = ...\n\n     // open file for reading\n     ReadableByteChannel rbc = Files.newByteChannel(path, EnumSet.of(READ)));\n\n     // open file for writing to the end of an existing file, creating\n     // the file if it doesn't already exist\n     WritableByteChannel wbc = Files.newByteChannel(path, EnumSet.of(CREATE,APPEND));\n\n     // create file with initial permissions, opening it for both reading and writing\n     FileAttribute<Set<PosixFilePermission>> perms = ...\n     SeekableByteChannel sbc =\n         Files.newByteChannel(path, EnumSet.of(CREATE_NEW,READ,WRITE), perms);\n "}, {"method_name": "newByteChannel", "method_sig": "public static SeekableByteChannel newByteChannel (Path path,\n                                                 OpenOption... options)\n                                          throws IOException", "description": "Opens or creates a file, returning a seekable byte channel to access the\n file.\n\n  This method opens or creates a file in exactly the manner specified\n by the newByteChannel\n method."}, {"method_name": "newDirectoryStream", "method_sig": "public static DirectoryStream<Path> newDirectoryStream (Path dir)\n                                                throws IOException", "description": "Opens a directory, returning a DirectoryStream to iterate over\n all entries in the directory. The elements returned by the directory\n stream's iterator are of type \n Path, each one representing an entry in the directory. The Path\n objects are obtained as if by resolving the\n name of the directory entry against dir.\n\n  When not using the try-with-resources construct, then directory\n stream's close method should be invoked after iteration is\n completed so as to free any resources held for the open directory.\n\n  When an implementation supports operations on entries in the\n directory that execute in a race-free manner then the returned directory\n stream is a SecureDirectoryStream."}, {"method_name": "newDirectoryStream", "method_sig": "public static DirectoryStream<Path> newDirectoryStream (Path dir,\n                                                       String glob)\n                                                throws IOException", "description": "Opens a directory, returning a DirectoryStream to iterate over\n the entries in the directory. The elements returned by the directory\n stream's iterator are of type \n Path, each one representing an entry in the directory. The Path\n objects are obtained as if by resolving the\n name of the directory entry against dir. The entries returned by\n the iterator are filtered by matching the String representation\n of their file names against the given globbing pattern.\n\n  For example, suppose we want to iterate over the files ending with\n \".java\" in a directory:\n \n     Path dir = ...\n     try (DirectoryStream<Path> stream = Files.newDirectoryStream(dir, \"*.java\")) {\n         :\n     }\n \n The globbing pattern is specified by the getPathMatcher method.\n\n  When not using the try-with-resources construct, then directory\n stream's close method should be invoked after iteration is\n completed so as to free any resources held for the open directory.\n\n  When an implementation supports operations on entries in the\n directory that execute in a race-free manner then the returned directory\n stream is a SecureDirectoryStream."}, {"method_name": "newDirectoryStream", "method_sig": "public static DirectoryStream<Path> newDirectoryStream (Path dir,\n                                                       DirectoryStream.Filter<? super Path> filter)\n                                                throws IOException", "description": "Opens a directory, returning a DirectoryStream to iterate over\n the entries in the directory. The elements returned by the directory\n stream's iterator are of type \n Path, each one representing an entry in the directory. The Path\n objects are obtained as if by resolving the\n name of the directory entry against dir. The entries returned by\n the iterator are filtered by the given filter.\n\n  When not using the try-with-resources construct, then directory\n stream's close method should be invoked after iteration is\n completed so as to free any resources held for the open directory.\n\n  Where the filter terminates due to an uncaught error or runtime\n exception then it is propagated to the hasNext or next method. Where an \n IOException is thrown, it results in the hasNext or \n next method throwing a DirectoryIteratorException with the\n IOException as the cause.\n\n  When an implementation supports operations on entries in the\n directory that execute in a race-free manner then the returned directory\n stream is a SecureDirectoryStream.\n\n  Usage Example:\n Suppose we want to iterate over the files in a directory that are\n larger than 8K.\n \n     DirectoryStream.Filter<Path> filter = new DirectoryStream.Filter<Path>() {\n         public boolean accept(Path file) throws IOException {\n             return (Files.size(file) > 8192L);\n         }\n     };\n     Path dir = ...\n     try (DirectoryStream<Path> stream = Files.newDirectoryStream(dir, filter)) {\n         :\n     }\n "}, {"method_name": "createFile", "method_sig": "public static Path createFile (Path path,\n                              FileAttribute<?>... attrs)\n                       throws IOException", "description": "Creates a new and empty file, failing if the file already exists. The\n check for the existence of the file and the creation of the new file if\n it does not exist are a single operation that is atomic with respect to\n all other filesystem activities that might affect the directory.\n\n  The attrs parameter is optional file-attributes to set atomically when creating the file. Each attribute\n is identified by its name. If more than one\n attribute of the same name is included in the array then all but the last\n occurrence is ignored."}, {"method_name": "createDirectory", "method_sig": "public static Path createDirectory (Path dir,\n                                   FileAttribute<?>... attrs)\n                            throws IOException", "description": "Creates a new directory. The check for the existence of the file and the\n creation of the directory if it does not exist are a single operation\n that is atomic with respect to all other filesystem activities that might\n affect the directory. The createDirectories\n method should be used where it is required to create all nonexistent\n parent directories first.\n\n  The attrs parameter is optional file-attributes to set atomically when creating the directory. Each\n attribute is identified by its name. If more\n than one attribute of the same name is included in the array then all but\n the last occurrence is ignored."}, {"method_name": "createDirectories", "method_sig": "public static Path createDirectories (Path dir,\n                                     FileAttribute<?>... attrs)\n                              throws IOException", "description": "Creates a directory by creating all nonexistent parent directories first.\n Unlike the createDirectory method, an exception\n is not thrown if the directory could not be created because it already\n exists.\n\n  The attrs parameter is optional file-attributes to set atomically when creating the nonexistent\n directories. Each file attribute is identified by its name. If more than one attribute of the same name is\n included in the array then all but the last occurrence is ignored.\n\n  If this method fails, then it may do so after creating some, but not\n all, of the parent directories."}, {"method_name": "createTempFile", "method_sig": "public static Path createTempFile (Path dir,\n                                  String prefix,\n                                  String suffix,\n                                  FileAttribute<?>... attrs)\n                           throws IOException", "description": "Creates a new empty file in the specified directory, using the given\n prefix and suffix strings to generate its name. The resulting\n Path is associated with the same FileSystem as the given\n directory.\n\n  The details as to how the name of the file is constructed is\n implementation dependent and therefore not specified. Where possible\n the prefix and suffix are used to construct candidate\n names in the same manner as the File.createTempFile(String,String,File) method.\n\n  As with the File.createTempFile methods, this method is only\n part of a temporary-file facility. Where used as a work files,\n the resulting file may be opened using the DELETE_ON_CLOSE option so that the\n file is deleted when the appropriate close method is invoked.\n Alternatively, a shutdown-hook, or the\n File.deleteOnExit() mechanism may be used to delete the\n file automatically.\n\n  The attrs parameter is optional file-attributes to set atomically when creating the file. Each attribute\n is identified by its name. If more than one\n attribute of the same name is included in the array then all but the last\n occurrence is ignored. When no file attributes are specified, then the\n resulting file may have more restrictive access permissions to files\n created by the File.createTempFile(String,String,File)\n method."}, {"method_name": "createTempFile", "method_sig": "public static Path createTempFile (String prefix,\n                                  String suffix,\n                                  FileAttribute<?>... attrs)\n                           throws IOException", "description": "Creates an empty file in the default temporary-file directory, using\n the given prefix and suffix to generate its name. The resulting \n Path is associated with the default FileSystem.\n\n  This method works in exactly the manner specified by the\n createTempFile(Path,String,String,FileAttribute[]) method for\n the case that the dir parameter is the temporary-file directory."}, {"method_name": "createTempDirectory", "method_sig": "public static Path createTempDirectory (Path dir,\n                                       String prefix,\n                                       FileAttribute<?>... attrs)\n                                throws IOException", "description": "Creates a new directory in the specified directory, using the given\n prefix to generate its name.  The resulting Path is associated\n with the same FileSystem as the given directory.\n\n  The details as to how the name of the directory is constructed is\n implementation dependent and therefore not specified. Where possible\n the prefix is used to construct candidate names.\n\n  As with the createTempFile methods, this method is only\n part of a temporary-file facility. A shutdown-hook, or the File.deleteOnExit() mechanism may be\n used to delete the directory automatically.\n\n  The attrs parameter is optional file-attributes to set atomically when creating the directory. Each\n attribute is identified by its name. If more\n than one attribute of the same name is included in the array then all but\n the last occurrence is ignored."}, {"method_name": "createTempDirectory", "method_sig": "public static Path createTempDirectory (String prefix,\n                                       FileAttribute<?>... attrs)\n                                throws IOException", "description": "Creates a new directory in the default temporary-file directory, using\n the given prefix to generate its name. The resulting Path is\n associated with the default FileSystem.\n\n  This method works in exactly the manner specified by createTempDirectory(Path,String,FileAttribute[]) method for the case\n that the dir parameter is the temporary-file directory."}, {"method_name": "createSymbolicLink", "method_sig": "public static Path createSymbolicLink (Path link,\n                                      Path target,\n                                      FileAttribute<?>... attrs)\n                               throws IOException", "description": "Creates a symbolic link to a target (optional operation).\n\n  The target parameter is the target of the link. It may be an\n absolute or relative path and may not exist. When\n the target is a relative path then file system operations on the resulting\n link are relative to the path of the link.\n\n  The attrs parameter is optional attributes to set atomically when creating the link. Each attribute is\n identified by its name. If more than one attribute\n of the same name is included in the array then all but the last occurrence\n is ignored.\n\n  Where symbolic links are supported, but the underlying FileStore\n does not support symbolic links, then this may fail with an IOException. Additionally, some operating systems may require that the\n Java virtual machine be started with implementation specific privileges to\n create symbolic links, in which case this method may throw IOException."}, {"method_name": "createLink", "method_sig": "public static Path createLink (Path link,\n                              Path existing)\n                       throws IOException", "description": "Creates a new link (directory entry) for an existing file (optional\n operation).\n\n  The link parameter locates the directory entry to create.\n The existing parameter is the path to an existing file. This\n method creates a new directory entry for the file so that it can be\n accessed using link as the path. On some file systems this is\n known as creating a \"hard link\". Whether the file attributes are\n maintained for the file or for each directory entry is file system\n specific and therefore not specified. Typically, a file system requires\n that all links (directory entries) for a file be on the same file system.\n Furthermore, on some platforms, the Java virtual machine may require to\n be started with implementation specific privileges to create hard links\n or to create links to directories."}, {"method_name": "delete", "method_sig": "public static void delete (Path path)\n                   throws IOException", "description": "Deletes a file.\n\n  An implementation may require to examine the file to determine if the\n file is a directory. Consequently this method may not be atomic with respect\n to other file system operations.  If the file is a symbolic link then the\n symbolic link itself, not the final target of the link, is deleted.\n\n  If the file is a directory then the directory must be empty. In some\n implementations a directory has entries for special files or links that\n are created when the directory is created. In such implementations a\n directory is considered empty when only the special entries exist.\n This method can be used with the walkFileTree\n method to delete a directory and all entries in the directory, or an\n entire file-tree where required.\n\n  On some operating systems it may not be possible to remove a file when\n it is open and in use by this Java virtual machine or other programs."}, {"method_name": "deleteIfExists", "method_sig": "public static boolean deleteIfExists (Path path)\n                              throws IOException", "description": "Deletes a file if it exists.\n\n  As with the delete(Path) method, an\n implementation may need to examine the file to determine if the file is a\n directory. Consequently this method may not be atomic with respect to\n other file system operations.  If the file is a symbolic link, then the\n symbolic link itself, not the final target of the link, is deleted.\n\n  If the file is a directory then the directory must be empty. In some\n implementations a directory has entries for special files or links that\n are created when the directory is created. In such implementations a\n directory is considered empty when only the special entries exist.\n\n  On some operating systems it may not be possible to remove a file when\n it is open and in use by this Java virtual machine or other programs."}, {"method_name": "copy", "method_sig": "public static Path copy (Path source,\n                        Path target,\n                        CopyOption... options)\n                 throws IOException", "description": "Copy a file to a target file.\n\n  This method copies a file to the target file with the \n options parameter specifying how the copy is performed. By default, the\n copy fails if the target file already exists or is a symbolic link,\n except if the source and target are the same file, in\n which case the method completes without copying the file. File attributes\n are not required to be copied to the target file. If symbolic links are\n supported, and the file is a symbolic link, then the final target of the\n link is copied. If the file is a directory then it creates an empty\n directory in the target location (entries in the directory are not\n copied). This method can be used with the walkFileTree method to copy a directory and all entries in the directory,\n or an entire file-tree where required.\n\n  The options parameter may include any of the following:\n\n \nOptions\n\n Option Description \n\n\n\n REPLACE_EXISTING \n If the target file exists, then the target file is replaced if it\n     is not a non-empty directory. If the target file exists and is a\n     symbolic link, then the symbolic link itself, not the target of\n     the link, is replaced. \n\n\n COPY_ATTRIBUTES \n Attempts to copy the file attributes associated with this file to\n     the target file. The exact file attributes that are copied is platform\n     and file system dependent and therefore unspecified. Minimally, the\n     last-modified-time is\n     copied to the target file if supported by both the source and target\n     file stores. Copying of file timestamps may result in precision\n     loss. \n\n\n NOFOLLOW_LINKS \n Symbolic links are not followed. If the file is a symbolic link,\n     then the symbolic link itself, not the target of the link, is copied.\n     It is implementation specific if file attributes can be copied to the\n     new link. In other words, the COPY_ATTRIBUTES option may be\n     ignored when copying a symbolic link. \n\n\n\n An implementation of this interface may support additional\n implementation specific options.\n\n  Copying a file is not an atomic operation. If an IOException\n is thrown, then it is possible that the target file is incomplete or some\n of its file attributes have not been copied from the source file. When\n the REPLACE_EXISTING option is specified and the target file\n exists, then the target file is replaced. The check for the existence of\n the file and the creation of the new file may not be atomic with respect\n to other file system activities.\n\n  Usage Example:\n Suppose we want to copy a file into a directory, giving it the same file\n name as the source file:\n \n     Path source = ...\n     Path newdir = ...\n     Files.copy(source, newdir.resolve(source.getFileName());\n "}, {"method_name": "move", "method_sig": "public static Path move (Path source,\n                        Path target,\n                        CopyOption... options)\n                 throws IOException", "description": "Move or rename a file to a target file.\n\n  By default, this method attempts to move the file to the target\n file, failing if the target file exists except if the source and\n target are the same file, in which case this method\n has no effect. If the file is a symbolic link then the symbolic link\n itself, not the target of the link, is moved. This method may be\n invoked to move an empty directory. In some implementations a directory\n has entries for special files or links that are created when the\n directory is created. In such implementations a directory is considered\n empty when only the special entries exist. When invoked to move a\n directory that is not empty then the directory is moved if it does not\n require moving the entries in the directory.  For example, renaming a\n directory on the same FileStore will usually not require moving\n the entries in the directory. When moving a directory requires that its\n entries be moved then this method fails (by throwing an \n IOException). To move a file tree may involve copying rather\n than moving directories and this can be done using the copy method in conjunction with the Files.walkFileTree utility method.\n\n  The options parameter may include any of the following:\n\n \nOptions\n\n Option Description \n\n\n\n REPLACE_EXISTING \n If the target file exists, then the target file is replaced if it\n     is not a non-empty directory. If the target file exists and is a\n     symbolic link, then the symbolic link itself, not the target of\n     the link, is replaced. \n\n\n ATOMIC_MOVE \n The move is performed as an atomic file system operation and all\n     other options are ignored. If the target file exists then it is\n     implementation specific if the existing file is replaced or this method\n     fails by throwing an IOException. If the move cannot be\n     performed as an atomic file system operation then AtomicMoveNotSupportedException is thrown. This can arise, for\n     example, when the target location is on a different FileStore\n     and would require that the file be copied, or target location is\n     associated with a different provider to this object. \n\n\n An implementation of this interface may support additional\n implementation specific options.\n\n  Moving a file will copy the last-modified-time to the target\n file if supported by both source and target file stores. Copying of file\n timestamps may result in precision loss. An implementation may also\n attempt to copy other file attributes but is not required to fail if the\n file attributes cannot be copied. When the move is performed as\n a non-atomic operation, and an IOException is thrown, then the\n state of the files is not defined. The original file and the target file\n may both exist, the target file may be incomplete or some of its file\n attributes may not been copied from the original file.\n\n  Usage Examples:\n Suppose we want to rename a file to \"newname\", keeping the file in the\n same directory:\n \n     Path source = ...\n     Files.move(source, source.resolveSibling(\"newname\"));\n \n Alternatively, suppose we want to move a file to new directory, keeping\n the same file name, and replacing any existing file of that name in the\n directory:\n \n     Path source = ...\n     Path newdir = ...\n     Files.move(source, newdir.resolve(source.getFileName()), REPLACE_EXISTING);\n "}, {"method_name": "readSymbolicLink", "method_sig": "public static Path readSymbolicLink (Path link)\n                             throws IOException", "description": "Reads the target of a symbolic link (optional operation).\n\n  If the file system supports symbolic\n links then this method is used to read the target of the link, failing\n if the file is not a symbolic link. The target of the link need not exist.\n The returned Path object will be associated with the same file\n system as link."}, {"method_name": "getFileStore", "method_sig": "public static FileStore getFileStore (Path path)\n                              throws IOException", "description": "Returns the FileStore representing the file store where a file\n is located.\n\n  Once a reference to the FileStore is obtained it is\n implementation specific if operations on the returned FileStore,\n or FileStoreAttributeView objects obtained from it, continue\n to depend on the existence of the file. In particular the behavior is not\n defined for the case that the file is deleted or moved to a different\n file store."}, {"method_name": "isSameFile", "method_sig": "public static boolean isSameFile (Path path,\n                                 Path path2)\n                          throws IOException", "description": "Tests if two paths locate the same file.\n\n  If both Path objects are equal\n then this method returns true without checking if the file exists.\n If the two Path objects are associated with different providers\n then this method returns false. Otherwise, this method checks if\n both Path objects locate the same file, and depending on the\n implementation, may require to open or access both files.\n\n  If the file system and files remain static, then this method implements\n an equivalence relation for non-null Paths.\n \nIt is reflexive: for Path f,\n     isSameFile(f,f) should return true.\n It is symmetric: for two Paths f and g,\n     isSameFile(f,g) will equal isSameFile(g,f).\n It is transitive: for three Paths\nf, g, and h, if isSameFile(f,g) returns\n     true and isSameFile(g,h) returns true, then\n     isSameFile(f,h) will return true.\n "}, {"method_name": "isHidden", "method_sig": "public static boolean isHidden (Path path)\n                        throws IOException", "description": "Tells whether or not a file is considered hidden. The exact\n definition of hidden is platform or provider dependent. On UNIX for\n example a file is considered to be hidden if its name begins with a\n period character ('.'). On Windows a file is considered hidden if it\n isn't a directory and the DOS hidden\n attribute is set.\n\n  Depending on the implementation this method may require to access\n the file system to determine if the file is considered hidden."}, {"method_name": "probeContentType", "method_sig": "public static String probeContentType (Path path)\n                               throws IOException", "description": "Probes the content type of a file.\n\n  This method uses the installed FileTypeDetector implementations\n to probe the given file to determine its content type. Each file type\n detector's probeContentType is\n invoked, in turn, to probe the file type. If the file is recognized then\n the content type is returned. If the file is not recognized by any of the\n installed file type detectors then a system-default file type detector is\n invoked to guess the content type.\n\n  A given invocation of the Java virtual machine maintains a system-wide\n list of file type detectors. Installed file type detectors are loaded\n using the service-provider loading facility defined by the ServiceLoader\n class. Installed file type detectors are loaded using the system class\n loader. If the system class loader cannot be found then the platform class\n loader is used. File type detectors are typically installed\n by placing them in a JAR file on the application class path,\n the JAR file contains a provider-configuration file\n named java.nio.file.spi.FileTypeDetector in the resource directory\n META-INF/services, and the file lists one or more fully-qualified\n names of concrete subclass of FileTypeDetector  that have a zero\n argument constructor. If the process of locating or instantiating the\n installed file type detectors fails then an unspecified error is thrown.\n The ordering that installed providers are located is implementation\n specific.\n\n  The return value of this method is the string form of the value of a\n Multipurpose Internet Mail Extension (MIME) content type as\n defined by RFC 2045:\n Multipurpose Internet Mail Extensions (MIME) Part One: Format of Internet\n Message Bodies. The string is guaranteed to be parsable according\n to the grammar in the RFC."}, {"method_name": "getFileAttributeView", "method_sig": "public static <V extends FileAttributeView> V getFileAttributeView (Path path,\n                                                                   Class<V> type,\n                                                                   LinkOption... options)", "description": "Returns a file attribute view of a given type.\n\n  A file attribute view provides a read-only or updatable view of a\n set of file attributes. This method is intended to be used where the file\n attribute view defines type-safe methods to read or update the file\n attributes. The type parameter is the type of the attribute view\n required and the method returns an instance of that type if supported.\n The BasicFileAttributeView type supports access to the basic\n attributes of a file. Invoking this method to select a file attribute\n view of that type will always return an instance of that class.\n\n  The options array may be used to indicate how symbolic links\n are handled by the resulting file attribute view for the case that the\n file is a symbolic link. By default, symbolic links are followed. If the\n option NOFOLLOW_LINKS is present then\n symbolic links are not followed. This option is ignored by implementations\n that do not support symbolic links.\n\n  Usage Example:\n Suppose we want read or set a file's ACL, if supported:\n \n     Path path = ...\n     AclFileAttributeView view = Files.getFileAttributeView(path, AclFileAttributeView.class);\n     if (view != null) {\n         List<AclEntry> acl = view.getAcl();\n         :\n     }\n "}, {"method_name": "readAttributes", "method_sig": "public static <A extends BasicFileAttributes> A readAttributes (Path path,\n                                                               Class<A> type,\n                                                               LinkOption... options)\n                                                        throws IOException", "description": "Reads a file's attributes as a bulk operation.\n\n  The type parameter is the type of the attributes required\n and this method returns an instance of that type if supported. All\n implementations support a basic set of file attributes and so invoking\n this method with a  type parameter of \n BasicFileAttributes.class will not throw \n UnsupportedOperationException.\n\n  The options array may be used to indicate how symbolic links\n are handled for the case that the file is a symbolic link. By default,\n symbolic links are followed and the file attribute of the final target\n of the link is read. If the option NOFOLLOW_LINKS is present then symbolic links are not followed.\n\n  It is implementation specific if all file attributes are read as an\n atomic operation with respect to other file system operations.\n\n  Usage Example:\n Suppose we want to read a file's attributes in bulk:\n \n    Path path = ...\n    BasicFileAttributes attrs = Files.readAttributes(path, BasicFileAttributes.class);\n \n Alternatively, suppose we want to read file's POSIX attributes without\n following symbolic links:\n \n    PosixFileAttributes attrs =\n        Files.readAttributes(path, PosixFileAttributes.class, NOFOLLOW_LINKS);\n "}, {"method_name": "setAttribute", "method_sig": "public static Path setAttribute (Path path,\n                                String attribute,\n                                Object value,\n                                LinkOption... options)\n                         throws IOException", "description": "Sets the value of a file attribute.\n\n  The attribute parameter identifies the attribute to be set\n and takes the form:\n \n [view-name:]attribute-name\n\n where square brackets [...] delineate an optional component and the\n character ':' stands for itself.\n\n  view-name is the name of a FileAttributeView that identifies a set of file attributes. If not\n specified then it defaults to \"basic\", the name of the file\n attribute view that identifies the basic set of file attributes common to\n many file systems. attribute-name is the name of the attribute\n within the set.\n\n  The options array may be used to indicate how symbolic links\n are handled for the case that the file is a symbolic link. By default,\n symbolic links are followed and the file attribute of the final target\n of the link is set. If the option NOFOLLOW_LINKS is present then symbolic links are not followed.\n\n  Usage Example:\n Suppose we want to set the DOS \"hidden\" attribute:\n \n    Path path = ...\n    Files.setAttribute(path, \"dos:hidden\", true);\n "}, {"method_name": "getAttribute", "method_sig": "public static Object getAttribute (Path path,\n                                  String attribute,\n                                  LinkOption... options)\n                           throws IOException", "description": "Reads the value of a file attribute.\n\n  The attribute parameter identifies the attribute to be read\n and takes the form:\n \n [view-name:]attribute-name\n\n where square brackets [...] delineate an optional component and the\n character ':' stands for itself.\n\n  view-name is the name of a FileAttributeView that identifies a set of file attributes. If not\n specified then it defaults to \"basic\", the name of the file\n attribute view that identifies the basic set of file attributes common to\n many file systems. attribute-name is the name of the attribute.\n\n  The options array may be used to indicate how symbolic links\n are handled for the case that the file is a symbolic link. By default,\n symbolic links are followed and the file attribute of the final target\n of the link is read. If the option NOFOLLOW_LINKS is present then symbolic links are not followed.\n\n  Usage Example:\n Suppose we require the user ID of the file owner on a system that\n supports a \"unix\" view:\n \n    Path path = ...\n    int uid = (Integer)Files.getAttribute(path, \"unix:uid\");\n "}, {"method_name": "readAttributes", "method_sig": "public static Map<String, Object> readAttributes (Path path,\n                                                      String attributes,\n                                                      LinkOption... options)\n                                               throws IOException", "description": "Reads a set of file attributes as a bulk operation.\n\n  The attributes parameter identifies the attributes to be read\n and takes the form:\n \n [view-name:]attribute-list\n\n where square brackets [...] delineate an optional component and the\n character ':' stands for itself.\n\n  view-name is the name of a FileAttributeView that identifies a set of file attributes. If not\n specified then it defaults to \"basic\", the name of the file\n attribute view that identifies the basic set of file attributes common to\n many file systems.\n\n  The attribute-list component is a comma separated list of\n one or more names of attributes to read. If the list contains the value\n \"*\" then all attributes are read. Attributes that are not supported\n are ignored and will not be present in the returned map. It is\n implementation specific if all attributes are read as an atomic operation\n with respect to other file system operations.\n\n  The following examples demonstrate possible values for the \n attributes parameter:\n\n \nPossible values\n\n\nExample\n  Description\n \n\n\n \"*\" \n Read all basic-file-attributes. \n\n\n \"size,lastModifiedTime,lastAccessTime\" \n Reads the file size, last modified time, and last access time\n     attributes. \n\n\n \"posix:*\" \n Read all POSIX-file-attributes. \n\n\n \"posix:permissions,owner,size\" \n Reads the POSIX file permissions, owner, and file size. \n\n\n\n The options array may be used to indicate how symbolic links\n are handled for the case that the file is a symbolic link. By default,\n symbolic links are followed and the file attribute of the final target\n of the link is read. If the option NOFOLLOW_LINKS is present then symbolic links are not followed."}, {"method_name": "getPosixFilePermissions", "method_sig": "public static Set<PosixFilePermission> getPosixFilePermissions (Path path,\n                                                               LinkOption... options)\n                                                        throws IOException", "description": "Returns a file's POSIX file permissions.\n\n  The path parameter is associated with a FileSystem\n that supports the PosixFileAttributeView. This attribute view\n provides access to file attributes commonly associated with files on file\n systems used by operating systems that implement the Portable Operating\n System Interface (POSIX) family of standards.\n\n  The options array may be used to indicate how symbolic links\n are handled for the case that the file is a symbolic link. By default,\n symbolic links are followed and the file attribute of the final target\n of the link is read. If the option NOFOLLOW_LINKS is present then symbolic links are not followed."}, {"method_name": "setPosixFilePermissions", "method_sig": "public static Path setPosixFilePermissions (Path path,\n                                           Set<PosixFilePermission> perms)\n                                    throws IOException", "description": "Sets a file's POSIX permissions.\n\n  The path parameter is associated with a FileSystem\n that supports the PosixFileAttributeView. This attribute view\n provides access to file attributes commonly associated with files on file\n systems used by operating systems that implement the Portable Operating\n System Interface (POSIX) family of standards."}, {"method_name": "getOwner", "method_sig": "public static UserPrincipal getOwner (Path path,\n                                     LinkOption... options)\n                              throws IOException", "description": "Returns the owner of a file.\n\n  The path parameter is associated with a file system that\n supports FileOwnerAttributeView. This file attribute view provides\n access to a file attribute that is the owner of the file."}, {"method_name": "setOwner", "method_sig": "public static Path setOwner (Path path,\n                            UserPrincipal owner)\n                     throws IOException", "description": "Updates the file owner.\n\n  The path parameter is associated with a file system that\n supports FileOwnerAttributeView. This file attribute view provides\n access to a file attribute that is the owner of the file.\n\n  Usage Example:\n Suppose we want to make \"joe\" the owner of a file:\n \n     Path path = ...\n     UserPrincipalLookupService lookupService =\n         provider(path).getUserPrincipalLookupService();\n     UserPrincipal joe = lookupService.lookupPrincipalByName(\"joe\");\n     Files.setOwner(path, joe);\n "}, {"method_name": "isSymbolicLink", "method_sig": "public static boolean isSymbolicLink (Path path)", "description": "Tests whether a file is a symbolic link.\n\n  Where it is required to distinguish an I/O exception from the case\n that the file is not a symbolic link then the file attributes can be\n read with the readAttributes method and the file type tested with the BasicFileAttributes.isSymbolicLink() method."}, {"method_name": "isDirectory", "method_sig": "public static boolean isDirectory (Path path,\n                                  LinkOption... options)", "description": "Tests whether a file is a directory.\n\n  The options array may be used to indicate how symbolic links\n are handled for the case that the file is a symbolic link. By default,\n symbolic links are followed and the file attribute of the final target\n of the link is read. If the option NOFOLLOW_LINKS is present then symbolic links are not followed.\n\n  Where it is required to distinguish an I/O exception from the case\n that the file is not a directory then the file attributes can be\n read with the readAttributes method and the file type tested with the BasicFileAttributes.isDirectory() method."}, {"method_name": "isRegularFile", "method_sig": "public static boolean isRegularFile (Path path,\n                                    LinkOption... options)", "description": "Tests whether a file is a regular file with opaque content.\n\n  The options array may be used to indicate how symbolic links\n are handled for the case that the file is a symbolic link. By default,\n symbolic links are followed and the file attribute of the final target\n of the link is read. If the option NOFOLLOW_LINKS is present then symbolic links are not followed.\n\n  Where it is required to distinguish an I/O exception from the case\n that the file is not a regular file then the file attributes can be\n read with the readAttributes method and the file type tested with the BasicFileAttributes.isRegularFile() method."}, {"method_name": "getLastModifiedTime", "method_sig": "public static FileTime getLastModifiedTime (Path path,\n                                           LinkOption... options)\n                                    throws IOException", "description": "Returns a file's last modified time.\n\n  The options array may be used to indicate how symbolic links\n are handled for the case that the file is a symbolic link. By default,\n symbolic links are followed and the file attribute of the final target\n of the link is read. If the option NOFOLLOW_LINKS is present then symbolic links are not followed."}, {"method_name": "setLastModifiedTime", "method_sig": "public static Path setLastModifiedTime (Path path,\n                                       FileTime time)\n                                throws IOException", "description": "Updates a file's last modified time attribute. The file time is converted\n to the epoch and precision supported by the file system. Converting from\n finer to coarser granularities result in precision loss. The behavior of\n this method when attempting to set the last modified time when it is not\n supported by the file system or is outside the range supported by the\n underlying file store is not defined. It may or not fail by throwing an\n IOException.\n\n  Usage Example:\n Suppose we want to set the last modified time to the current time:\n \n    Path path = ...\n    FileTime now = FileTime.fromMillis(System.currentTimeMillis());\n    Files.setLastModifiedTime(path, now);\n "}, {"method_name": "size", "method_sig": "public static long size (Path path)\n                 throws IOException", "description": "Returns the size of a file (in bytes). The size may differ from the\n actual size on the file system due to compression, support for sparse\n files, or other reasons. The size of files that are not regular files is implementation specific and\n therefore unspecified."}, {"method_name": "exists", "method_sig": "public static boolean exists (Path path,\n                             LinkOption... options)", "description": "Tests whether a file exists.\n\n  The options parameter may be used to indicate how symbolic links\n are handled for the case that the file is a symbolic link. By default,\n symbolic links are followed. If the option NOFOLLOW_LINKS is present then symbolic links are not followed.\n\n  Note that the result of this method is immediately outdated. If this\n method indicates the file exists then there is no guarantee that a\n subsequent access will succeed. Care should be taken when using this\n method in security sensitive applications."}, {"method_name": "notExists", "method_sig": "public static boolean notExists (Path path,\n                                LinkOption... options)", "description": "Tests whether the file located by this path does not exist. This method\n is intended for cases where it is required to take action when it can be\n confirmed that a file does not exist.\n\n  The options parameter may be used to indicate how symbolic links\n are handled for the case that the file is a symbolic link. By default,\n symbolic links are followed. If the option NOFOLLOW_LINKS is present then symbolic links are not followed.\n\n  Note that this method is not the complement of the exists method. Where it is not possible to determine if a file exists\n or not then both methods return false. As with the exists\n method, the result of this method is immediately outdated. If this\n method indicates the file does exist then there is no guarantee that a\n subsequent attempt to create the file will succeed. Care should be taken\n when using this method in security sensitive applications."}, {"method_name": "isReadable", "method_sig": "public static boolean isReadable (Path path)", "description": "Tests whether a file is readable. This method checks that a file exists\n and that this Java virtual machine has appropriate privileges that would\n allow it open the file for reading. Depending on the implementation, this\n method may require to read file permissions, access control lists, or\n other file attributes in order to check the effective access to the file.\n Consequently, this method may not be atomic with respect to other file\n system operations.\n\n  Note that the result of this method is immediately outdated, there is\n no guarantee that a subsequent attempt to open the file for reading will\n succeed (or even that it will access the same file). Care should be taken\n when using this method in security sensitive applications."}, {"method_name": "isWritable", "method_sig": "public static boolean isWritable (Path path)", "description": "Tests whether a file is writable. This method checks that a file exists\n and that this Java virtual machine has appropriate privileges that would\n allow it open the file for writing. Depending on the implementation, this\n method may require to read file permissions, access control lists, or\n other file attributes in order to check the effective access to the file.\n Consequently, this method may not be atomic with respect to other file\n system operations.\n\n  Note that result of this method is immediately outdated, there is no\n guarantee that a subsequent attempt to open the file for writing will\n succeed (or even that it will access the same file). Care should be taken\n when using this method in security sensitive applications."}, {"method_name": "isExecutable", "method_sig": "public static boolean isExecutable (Path path)", "description": "Tests whether a file is executable. This method checks that a file exists\n and that this Java virtual machine has appropriate privileges to execute the file. The semantics may differ when checking\n access to a directory. For example, on UNIX systems, checking for\n execute access checks that the Java virtual machine has permission to\n search the directory in order to access file or subdirectories.\n\n  Depending on the implementation, this method may require to read file\n permissions, access control lists, or other file attributes in order to\n check the effective access to the file. Consequently, this method may not\n be atomic with respect to other file system operations.\n\n  Note that the result of this method is immediately outdated, there is\n no guarantee that a subsequent attempt to execute the file will succeed\n (or even that it will access the same file). Care should be taken when\n using this method in security sensitive applications."}, {"method_name": "walkFileTree", "method_sig": "public static Path walkFileTree (Path start,\n                                Set<FileVisitOption> options,\n                                int maxDepth,\n                                FileVisitor<? super Path> visitor)\n                         throws IOException", "description": "Walks a file tree.\n\n  This method walks a file tree rooted at a given starting file. The\n file tree traversal is depth-first with the given FileVisitor invoked for each file encountered. File tree traversal\n completes when all accessible files in the tree have been visited, or a\n visit method returns a result of TERMINATE. Where a visit method terminates due an IOException,\n an uncaught error, or runtime exception, then the traversal is terminated\n and the error or exception is propagated to the caller of this method.\n\n  For each file encountered this method attempts to read its BasicFileAttributes. If the file is not a\n directory then the visitFile method is\n invoked with the file attributes. If the file attributes cannot be read,\n due to an I/O exception, then the visitFileFailed method is invoked with the I/O exception.\n\n  Where the file is a directory, and the directory could not be opened,\n then the visitFileFailed method is invoked with the I/O exception,\n after which, the file tree walk continues, by default, at the next\n sibling of the directory.\n\n  Where the directory is opened successfully, then the entries in the\n directory, and their descendants are visited. When all entries\n have been visited, or an I/O error occurs during iteration of the\n directory, then the directory is closed and the visitor's postVisitDirectory method is invoked.\n The file tree walk then continues, by default, at the next sibling\n of the directory.\n\n  By default, symbolic links are not automatically followed by this\n method. If the options parameter contains the FOLLOW_LINKS option then symbolic links are\n followed. When following links, and the attributes of the target cannot\n be read, then this method attempts to get the BasicFileAttributes\n of the link. If they can be read then the visitFile method is\n invoked with the attributes of the link (otherwise the visitFileFailed\n method is invoked as specified above).\n\n  If the options parameter contains the FOLLOW_LINKS option then this method keeps\n track of directories visited so that cycles can be detected. A cycle\n arises when there is an entry in a directory that is an ancestor of the\n directory. Cycle detection is done by recording the file-key of directories,\n or if file keys are not available, by invoking the isSameFile method to test if a directory is the same file as an\n ancestor. When a cycle is detected it is treated as an I/O error, and the\n visitFileFailed method is invoked with\n an instance of FileSystemLoopException.\n\n  The maxDepth parameter is the maximum number of levels of\n directories to visit. A value of 0 means that only the starting\n file is visited, unless denied by the security manager. A value of\n MAX_VALUE may be used to indicate that all\n levels should be visited. The visitFile method is invoked for all\n files, including directories, encountered at maxDepth, unless the\n basic file attributes cannot be read, in which case the \n visitFileFailed method is invoked.\n\n  If a visitor returns a result of null then \n NullPointerException is thrown.\n\n  When a security manager is installed and it denies access to a file\n (or directory), then it is ignored and the visitor is not invoked for\n that file (or directory)."}, {"method_name": "walkFileTree", "method_sig": "public static Path walkFileTree (Path start,\n                                FileVisitor<? super Path> visitor)\n                         throws IOException", "description": "Walks a file tree.\n\n  This method works as if invoking it were equivalent to evaluating the\n expression:\n \n walkFileTree(start, EnumSet.noneOf(FileVisitOption.class), Integer.MAX_VALUE, visitor)\n \n In other words, it does not follow symbolic links, and visits all levels\n of the file tree."}, {"method_name": "newBufferedReader", "method_sig": "public static BufferedReader newBufferedReader (Path path,\n                                               Charset cs)\n                                        throws IOException", "description": "Opens a file for reading, returning a BufferedReader that may be\n used to read text from the file in an efficient manner. Bytes from the\n file are decoded into characters using the specified charset. Reading\n commences at the beginning of the file.\n\n  The Reader methods that read from the file throw \n IOException if a malformed or unmappable byte sequence is read."}, {"method_name": "newBufferedReader", "method_sig": "public static BufferedReader newBufferedReader (Path path)\n                                        throws IOException", "description": "Opens a file for reading, returning a BufferedReader to read text\n from the file in an efficient manner. Bytes from the file are decoded into\n characters using the UTF-8 charset.\n\n  This method works as if invoking it were equivalent to evaluating the\n expression:\n \n Files.newBufferedReader(path, StandardCharsets.UTF_8)\n "}, {"method_name": "newBufferedWriter", "method_sig": "public static BufferedWriter newBufferedWriter (Path path,\n                                               Charset cs,\n                                               OpenOption... options)\n                                        throws IOException", "description": "Opens or creates a file for writing, returning a BufferedWriter\n that may be used to write text to the file in an efficient manner.\n The options parameter specifies how the file is created or\n opened. If no options are present then this method works as if the CREATE, TRUNCATE_EXISTING, and WRITE options are present. In other words, it\n opens the file for writing, creating the file if it doesn't exist, or\n initially truncating an existing regular-file to\n a size of 0 if it exists.\n\n  The Writer methods to write text throw IOException\n if the text cannot be encoded using the specified charset."}, {"method_name": "newBufferedWriter", "method_sig": "public static BufferedWriter newBufferedWriter (Path path,\n                                               OpenOption... options)\n                                        throws IOException", "description": "Opens or creates a file for writing, returning a BufferedWriter\n to write text to the file in an efficient manner. The text is encoded\n into bytes for writing using the UTF-8\ncharset.\n\n  This method works as if invoking it were equivalent to evaluating the\n expression:\n \n Files.newBufferedWriter(path, StandardCharsets.UTF_8, options)\n "}, {"method_name": "copy", "method_sig": "public static long copy (InputStream in,\n                        Path target,\n                        CopyOption... options)\n                 throws IOException", "description": "Copies all bytes from an input stream to a file. On return, the input\n stream will be at end of stream.\n\n  By default, the copy fails if the target file already exists or is a\n symbolic link. If the REPLACE_EXISTING option is specified, and the target file already exists,\n then it is replaced if it is not a non-empty directory. If the target\n file exists and is a symbolic link, then the symbolic link is replaced.\n In this release, the REPLACE_EXISTING option is the only option\n required to be supported by this method. Additional options may be\n supported in future releases.\n\n   If an I/O error occurs reading from the input stream or writing to\n the file, then it may do so after the target file has been created and\n after some bytes have been read or written. Consequently the input\n stream may not be at end of stream and may be in an inconsistent state.\n It is strongly recommended that the input stream be promptly closed if an\n I/O error occurs.\n\n  This method may block indefinitely reading from the input stream (or\n writing to the file). The behavior for the case that the input stream is\n asynchronously closed or the thread interrupted during the copy is\n highly input stream and file system provider specific and therefore not\n specified.\n\n  Usage example: Suppose we want to capture a web page and save\n it to a file:\n \n     Path path = ...\n     URI u = URI.create(\"http://java.sun.com/\");\n     try (InputStream in = u.toURL().openStream()) {\n         Files.copy(in, path);\n     }\n "}, {"method_name": "copy", "method_sig": "public static long copy (Path source,\n                        OutputStream out)\n                 throws IOException", "description": "Copies all bytes from a file to an output stream.\n\n  If an I/O error occurs reading from the file or writing to the output\n stream, then it may do so after some bytes have been read or written.\n Consequently the output stream may be in an inconsistent state. It is\n strongly recommended that the output stream be promptly closed if an I/O\n error occurs.\n\n  This method may block indefinitely writing to the output stream (or\n reading from the file). The behavior for the case that the output stream\n is asynchronously closed or the thread interrupted during the copy\n is highly output stream and file system provider specific and therefore\n not specified.\n\n  Note that if the given output stream is Flushable\n then its flush method may need to invoked\n after this method completes so as to flush any buffered output."}, {"method_name": "readAllBytes", "method_sig": "public static byte[] readAllBytes (Path path)\n                           throws IOException", "description": "Reads all the bytes from a file. The method ensures that the file is\n closed when all bytes have been read or an I/O error, or other runtime\n exception, is thrown.\n\n  Note that this method is intended for simple cases where it is\n convenient to read all bytes into a byte array. It is not intended for\n reading in large files."}, {"method_name": "readString", "method_sig": "public static String readString (Path path)\n                         throws IOException", "description": "Reads all content from a file into a string, decoding from bytes to characters\n using the UTF-8 charset.\n The method ensures that the file is closed when all content have been read\n or an I/O error, or other runtime exception, is thrown.\n\n  This method is equivalent to:\n readString(path, StandardCharsets.UTF_8) "}, {"method_name": "readString", "method_sig": "public static String readString (Path path,\n                                Charset cs)\n                         throws IOException", "description": "Reads all characters from a file into a string, decoding from bytes to characters\n using the specified charset.\n The method ensures that the file is closed when all content have been read\n or an I/O error, or other runtime exception, is thrown.\n\n  This method reads all content including the line separators in the middle\n and/or at the end. The resulting string will contain line separators as they\n appear in the file."}, {"method_name": "readAllLines", "method_sig": "public static List<String> readAllLines (Path path,\n                                        Charset cs)\n                                 throws IOException", "description": "Read all lines from a file. This method ensures that the file is\n closed when all bytes have been read or an I/O error, or other runtime\n exception, is thrown. Bytes from the file are decoded into characters\n using the specified charset.\n\n  This method recognizes the following as line terminators:\n \n \\u000D followed by \\u000A,\n     CARRIAGE RETURN followed by LINE FEED \n \\u000A, LINE FEED \n \\u000D, CARRIAGE RETURN \n\n Additional Unicode line terminators may be recognized in future\n releases.\n\n  Note that this method is intended for simple cases where it is\n convenient to read all lines in a single operation. It is not intended\n for reading in large files."}, {"method_name": "readAllLines", "method_sig": "public static List<String> readAllLines (Path path)\n                                 throws IOException", "description": "Read all lines from a file. Bytes from the file are decoded into characters\n using the UTF-8 charset.\n\n  This method works as if invoking it were equivalent to evaluating the\n expression:\n \n Files.readAllLines(path, StandardCharsets.UTF_8)\n "}, {"method_name": "write", "method_sig": "public static Path write (Path path,\n                         byte[] bytes,\n                         OpenOption... options)\n                  throws IOException", "description": "Writes bytes to a file. The options parameter specifies how\n the file is created or opened. If no options are present then this method\n works as if the CREATE, TRUNCATE_EXISTING, and WRITE options are present. In other words, it\n opens the file for writing, creating the file if it doesn't exist, or\n initially truncating an existing regular-file to\n a size of 0. All bytes in the byte array are written to the file.\n The method ensures that the file is closed when all bytes have been\n written (or an I/O error or other runtime exception is thrown). If an I/O\n error occurs then it may do so after the file has been created or\n truncated, or after some bytes have been written to the file.\n\n  Usage example: By default the method creates a new file or\n overwrites an existing file. Suppose you instead want to append bytes\n to an existing file:\n \n     Path path = ...\n     byte[] bytes = ...\n     Files.write(path, bytes, StandardOpenOption.APPEND);\n "}, {"method_name": "write", "method_sig": "public static Path write (Path path,\n                         Iterable<? extends CharSequence> lines,\n                         Charset cs,\n                         OpenOption... options)\n                  throws IOException", "description": "Write lines of text to a file. Each line is a char sequence and is\n written to the file in sequence with each line terminated by the\n platform's line separator, as defined by the system property \n line.separator. Characters are encoded into bytes using the specified\n charset.\n\n  The options parameter specifies how the file is created\n or opened. If no options are present then this method works as if the\n CREATE, TRUNCATE_EXISTING, and WRITE options are present. In other words, it\n opens the file for writing, creating the file if it doesn't exist, or\n initially truncating an existing regular-file to\n a size of 0. The method ensures that the file is closed when all\n lines have been written (or an I/O error or other runtime exception is\n thrown). If an I/O error occurs then it may do so after the file has\n been created or truncated, or after some bytes have been written to the\n file."}, {"method_name": "write", "method_sig": "public static Path write (Path path,\n                         Iterable<? extends CharSequence> lines,\n                         OpenOption... options)\n                  throws IOException", "description": "Write lines of text to a file. Characters are encoded into bytes using\n the UTF-8 charset.\n\n  This method works as if invoking it were equivalent to evaluating the\n expression:\n \n Files.write(path, lines, StandardCharsets.UTF_8, options);\n "}, {"method_name": "writeString", "method_sig": "public static Path writeString (Path path,\n                               CharSequence csq,\n                               OpenOption... options)\n                        throws IOException", "description": "Write a CharSequence to a file.\n Characters are encoded into bytes using the\n UTF-8 charset.\n\n  This method is equivalent to:\n writeString(path, test, StandardCharsets.UTF_8, options) "}, {"method_name": "writeString", "method_sig": "public static Path writeString (Path path,\n                               CharSequence csq,\n                               Charset cs,\n                               OpenOption... options)\n                        throws IOException", "description": "Write a CharSequence to a file.\n Characters are encoded into bytes using the specified\n charset.\n\n  All characters are written as they are, including the line separators in\n the char sequence. No extra characters are added.\n\n  The options parameter specifies how the file is created\n or opened. If no options are present then this method works as if the\n CREATE, TRUNCATE_EXISTING, and WRITE options are present. In other words, it\n opens the file for writing, creating the file if it doesn't exist, or\n initially truncating an existing regular-file to\n a size of 0."}, {"method_name": "list", "method_sig": "public static Stream<Path> list (Path dir)\n                         throws IOException", "description": "Return a lazily populated Stream, the elements of\n which are the entries in the directory.  The listing is not recursive.\n\n  The elements of the stream are Path objects that are\n obtained as if by resolving the name of the\n directory entry against dir. Some file systems maintain special\n links to the directory itself and the directory's parent directory.\n Entries representing these links are not included.\n\n  The stream is weakly consistent. It is thread safe but does\n not freeze the directory while iterating, so it may (or may not)\n reflect updates to the directory that occur after returning from this\n method.\n\n  The returned stream contains a reference to an open directory.\n The directory is closed by closing the stream.\n\n  Operating on a closed stream behaves as if the end of stream\n has been reached. Due to read-ahead, one or more elements may be\n returned after the stream has been closed.\n\n  If an IOException is thrown when accessing the directory\n after this method has returned, it is wrapped in an UncheckedIOException which will be thrown from the method that caused\n the access to take place."}, {"method_name": "walk", "method_sig": "public static Stream<Path> walk (Path start,\n                                int maxDepth,\n                                FileVisitOption... options)\n                         throws IOException", "description": "Return a Stream that is lazily populated with \n Path by walking the file tree rooted at a given starting file.  The\n file tree is traversed depth-first, the elements in the stream\n are Path objects that are obtained as if by resolving the relative path against start.\n\n  The stream walks the file tree as elements are consumed.\n The Stream returned is guaranteed to have at least one\n element, the starting file itself. For each file visited, the stream\n attempts to read its BasicFileAttributes. If the file is a\n directory and can be opened successfully, entries in the directory, and\n their descendants will follow the directory in the stream as\n they are encountered. When all entries have been visited, then the\n directory is closed. The file tree walk then continues at the next\n sibling of the directory.\n\n  The stream is weakly consistent. It does not freeze the\n file tree while iterating, so it may (or may not) reflect updates to\n the file tree that occur after returned from this method.\n\n  By default, symbolic links are not automatically followed by this\n method. If the options parameter contains the FOLLOW_LINKS option then symbolic links are\n followed. When following links, and the attributes of the target cannot\n be read, then this method attempts to get the BasicFileAttributes\n of the link.\n\n  If the options parameter contains the FOLLOW_LINKS option then the stream keeps\n track of directories visited so that cycles can be detected. A cycle\n arises when there is an entry in a directory that is an ancestor of the\n directory. Cycle detection is done by recording the file-key of directories,\n or if file keys are not available, by invoking the isSameFile method to test if a directory is the same file as an\n ancestor. When a cycle is detected it is treated as an I/O error with\n an instance of FileSystemLoopException.\n\n  The maxDepth parameter is the maximum number of levels of\n directories to visit. A value of 0 means that only the starting\n file is visited, unless denied by the security manager. A value of\n MAX_VALUE may be used to indicate that all\n levels should be visited.\n\n  When a security manager is installed and it denies access to a file\n (or directory), then it is ignored and not included in the stream.\n\n  The returned stream contains references to one or more open directories.\n The directories are closed by closing the stream.\n\n  If an IOException is thrown when accessing the directory\n after this method has returned, it is wrapped in an UncheckedIOException which will be thrown from the method that caused\n the access to take place."}, {"method_name": "walk", "method_sig": "public static Stream<Path> walk (Path start,\n                                FileVisitOption... options)\n                         throws IOException", "description": "Return a Stream that is lazily populated with \n Path by walking the file tree rooted at a given starting file.  The\n file tree is traversed depth-first, the elements in the stream\n are Path objects that are obtained as if by resolving the relative path against start.\n\n  This method works as if invoking it were equivalent to evaluating the\n expression:\n \n walk(start, Integer.MAX_VALUE, options)\n \n In other words, it visits all levels of the file tree.\n\n  The returned stream contains references to one or more open directories.\n The directories are closed by closing the stream."}, {"method_name": "find", "method_sig": "public static Stream<Path> find (Path start,\n                                int maxDepth,\n                                BiPredicate<Path, BasicFileAttributes> matcher,\n                                FileVisitOption... options)\n                         throws IOException", "description": "Return a Stream that is lazily populated with \n Path by searching for files in a file tree rooted at a given starting\n file.\n\n  This method walks the file tree in exactly the manner specified by\n the walk method. For each file encountered, the given\n BiPredicate is invoked with its Path and BasicFileAttributes. The Path object is obtained as if by\n resolving the relative path against \n start and is only included in the returned Stream if\n the BiPredicate returns true. Compare to calling filter on the Stream\n returned by walk method, this method may be more efficient by\n avoiding redundant retrieval of the BasicFileAttributes.\n\n  The returned stream contains references to one or more open directories.\n The directories are closed by closing the stream.\n\n  If an IOException is thrown when accessing the directory\n after returned from this method, it is wrapped in an UncheckedIOException which will be thrown from the method that caused\n the access to take place."}, {"method_name": "lines", "method_sig": "public static Stream<String> lines (Path path,\n                                   Charset cs)\n                            throws IOException", "description": "Read all lines from a file as a Stream. Unlike readAllLines, this method does not read\n all lines into a List, but instead populates lazily as the stream\n is consumed.\n\n  Bytes from the file are decoded into characters using the specified\n charset and the same line terminators as specified by \n readAllLines are supported.\n\n  The returned stream contains a reference to an open file. The file\n is closed by closing the stream.\n\n  The file contents should not be modified during the execution of the\n terminal stream operation. Otherwise, the result of the terminal stream\n operation is undefined.\n\n  After this method returns, then any subsequent I/O exception that\n occurs while reading from the file or when a malformed or unmappable byte\n sequence is read, is wrapped in an UncheckedIOException that will\n be thrown from the\n Stream method that caused the read to take\n place. In case an IOException is thrown when closing the file,\n it is also wrapped as an UncheckedIOException."}, {"method_name": "lines", "method_sig": "public static Stream<String> lines (Path path)\n                            throws IOException", "description": "Read all lines from a file as a Stream. Bytes from the file are\n decoded into characters using the UTF-8\ncharset.\n\n  The returned stream contains a reference to an open file. The file\n is closed by closing the stream.\n\n  The file contents should not be modified during the execution of the\n terminal stream operation. Otherwise, the result of the terminal stream\n operation is undefined.\n\n  This method works as if invoking it were equivalent to evaluating the\n expression:\n \n Files.lines(path, StandardCharsets.UTF_8)\n "}]}