{"name": "Class FloatControl", "module": "java.desktop", "package": "javax.sound.sampled", "text": "A FloatControl object provides control over a range of floating-point\n values. Float controls are often represented in graphical user interfaces by\n continuously adjustable objects such as sliders or rotary knobs. Concrete\n subclasses of FloatControl implement controls, such as gain and pan,\n that affect a line's audio signal in some way that an application can\n manipulate. The FloatControl.Type inner class provides static\n instances of types that are used to identify some common kinds of float\n control.\n \n The FloatControl abstract class provides methods to set and get the\n control's current floating-point value. Other methods obtain the possible\n range of values and the control's resolution (the smallest increment between\n returned values). Some float controls allow ramping to a new value over a\n specified period of time. FloatControl also includes methods that\n return string labels for the minimum, maximum, and midpoint positions of the\n control.", "codes": ["public abstract class FloatControl\nextends Control"], "fields": [], "methods": [{"method_name": "setValue", "method_sig": "public void setValue (float newValue)", "description": "Sets the current value for the control. The default implementation simply\n sets the value as indicated. If the value indicated is greater than the\n maximum value, or smaller than the minimum value, an\n IllegalArgumentException is thrown. Some controls require that\n their line be open before they can be affected by setting a value."}, {"method_name": "getValue", "method_sig": "public float getValue()", "description": "Obtains this control's current value."}, {"method_name": "getMaximum", "method_sig": "public float getMaximum()", "description": "Obtains the maximum value permitted."}, {"method_name": "getMinimum", "method_sig": "public float getMinimum()", "description": "Obtains the minimum value permitted."}, {"method_name": "getUnits", "method_sig": "public String getUnits()", "description": "Obtains the label for the units in which the control's values are\n expressed, such as \"dB\" or \"frames per second.\""}, {"method_name": "getMinLabel", "method_sig": "public String getMinLabel()", "description": "Obtains the label for the minimum value, such as \"Left\" or \"Off\"."}, {"method_name": "getMidLabel", "method_sig": "public String getMidLabel()", "description": "Obtains the label for the mid-point value, such as \"Center\" or \"Default\"."}, {"method_name": "getMaxLabel", "method_sig": "public String getMaxLabel()", "description": "Obtains the label for the maximum value, such as \"Right\" or \"Full\"."}, {"method_name": "getPrecision", "method_sig": "public float getPrecision()", "description": "Obtains the resolution or granularity of the control, in the units that\n the control measures. The precision is the size of the increment between\n discrete valid values for this control, over the set of supported\n floating-point values."}, {"method_name": "getUpdatePeriod", "method_sig": "public int getUpdatePeriod()", "description": "Obtains the smallest time interval, in microseconds, over which the\n control's value can change during a shift. The update period is the\n inverse of the frequency with which the control updates its value during\n a shift. If the implementation does not support value shifting over time,\n it should set the control's value to the final value immediately and\n return -1 from this method."}, {"method_name": "shift", "method_sig": "public void shift (float from,\n                  float to,\n                  int microseconds)", "description": "Changes the control value from the initial value to the final value\n linearly over the specified time period, specified in microseconds. This\n method returns without blocking; it does not wait for the shift to\n complete. An implementation should complete the operation within the time\n specified. The default implementation simply changes the value to the\n final value immediately."}, {"method_name": "toString", "method_sig": "public String toString()", "description": "Provides a string representation of the control."}]}