{"name": "Class FloatControl.Type", "module": "java.desktop", "package": "javax.sound.sampled", "text": "An instance of the FloatControl.Type inner class identifies one\n kind of float control. Static instances are provided for the common\n types.", "codes": ["public static class FloatControl.Type\nextends Control.Type"], "fields": [{"field_name": "MASTER_GAIN", "field_sig": "public static final FloatControl.Type MASTER_GAIN", "description": "Represents a control for the overall gain on a line.\n \n Gain is a quantity in decibels (dB) that is added to the intrinsic\n decibel level of the audio signal--that is, the level of the signal\n before it is altered by the gain control. A positive gain amplifies\n (boosts) the signal's volume, and a negative gain attenuates(cuts)it.\n The gain setting defaults to a value of 0.0 dB, meaning the signal's\n loudness is unaffected. Note that gain measures dB, not amplitude.\n The relationship between a gain in decibels and the corresponding\n linear amplitude multiplier is:\n \nlinearScalar = pow(10.0, gainDB/20.0)\n\n The FloatControl class has methods to impose a maximum and\n minimum allowable value for gain. However, because an audio signal\n might already be at a high amplitude, the maximum setting does not\n guarantee that the signal will be undistorted when the gain is\n applied to it (unless the maximum is zero or negative). To avoid\n numeric overflow from excessively large gain settings, a gain control\n can implement clipping, meaning that the signal's amplitude will be\n limited to the maximum value representable by its audio format,\n instead of wrapping around.\n \n These comments apply to gain controls in general, not just master\n gain controls. A line can have more than one gain control. For\n example, a mixer (which is itself a line) might have a master gain\n control, an auxiliary return control, a reverb return control, and,\n on each of its source lines, an individual aux send and reverb send."}, {"field_name": "AUX_SEND", "field_sig": "public static final FloatControl.Type AUX_SEND", "description": "Represents a control for the auxiliary send gain on a line."}, {"field_name": "AUX_RETURN", "field_sig": "public static final FloatControl.Type AUX_RETURN", "description": "Represents a control for the auxiliary return gain on a line."}, {"field_name": "REVERB_SEND", "field_sig": "public static final FloatControl.Type REVERB_SEND", "description": "Represents a control for the pre-reverb gain on a line. This control\n may be used to affect how much of a line's signal is directed to a\n mixer's internal reverberation unit."}, {"field_name": "REVERB_RETURN", "field_sig": "public static final FloatControl.Type REVERB_RETURN", "description": "Represents a control for the post-reverb gain on a line. This control\n may be used to control the relative amplitude of the signal returned\n from an internal reverberation unit."}, {"field_name": "VOLUME", "field_sig": "public static final FloatControl.Type VOLUME", "description": "Represents a control for the volume on a line."}, {"field_name": "PAN", "field_sig": "public static final FloatControl.Type PAN", "description": "Represents a control for the relative pan (left-right positioning) of\n the signal. The signal may be mono; the pan setting affects how it is\n distributed by the mixer in a stereo mix. The valid range of values\n is -1.0 (left channel only) to 1.0 (right channel only). The default\n is 0.0 (centered)."}, {"field_name": "BALANCE", "field_sig": "public static final FloatControl.Type BALANCE", "description": "Represents a control for the relative balance of a stereo signal\n between two stereo speakers. The valid range of values is -1.0 (left\n channel only) to 1.0 (right channel only). The default is 0.0\n (centered)."}, {"field_name": "SAMPLE_RATE", "field_sig": "public static final FloatControl.Type SAMPLE_RATE", "description": "Represents a control that changes the sample rate of audio playback.\n The net effect of changing the sample rate depends on the\n relationship between the media's natural rate and the rate that is\n set via this control. The natural rate is the sample rate that is\n specified in the data line's AudioFormat object. For example,\n if the natural rate of the media is 11025 samples per second and the\n sample rate is set to 22050 samples per second, the media will play\n back at twice the normal speed.\n \n Changing the sample rate with this control does not affect the data\n line's audio format. Also note that whenever you change a sound's\n sample rate, a change in the sound's pitch results. For example,\n doubling the sample rate has the effect of doubling the frequencies\n in the sound's spectrum, which raises the pitch by an octave."}], "methods": []}