{"name": "Class FocusEvent", "module": "java.desktop", "package": "java.awt.event", "text": "A low-level event which indicates that a Component has gained or lost the\n input focus. This low-level event is generated by a Component (such as a\n TextField). The event is passed to every FocusListener or\n FocusAdapter object which registered to receive such events\n using the Component's addFocusListener method.\n (FocusAdapter objects implement the FocusListener\n interface.) Each such listener object gets this FocusEvent when\n the event occurs.\n \n There are two levels of focus events: permanent and temporary. Permanent\n focus change events occur when focus is directly moved from one Component to\n another, such as through a call to requestFocus() or as the user uses the\n TAB key to traverse Components. Temporary focus change events occur when\n focus is temporarily lost for a Component as the indirect result of another\n operation, such as Window deactivation or a Scrollbar drag. In this case,\n the original focus state will automatically be restored once that operation\n is finished, or, for the case of Window deactivation, when the Window is\n reactivated. Both permanent and temporary focus events are delivered using\n the FOCUS_GAINED and FOCUS_LOST event ids; the level may be distinguished in\n the event using the isTemporary() method.\n \n Every FocusEvent records its cause - the reason why this event was\n generated. The cause is assigned during the focus event creation and may be\n retrieved by calling getCause().\n \n An unspecified behavior will be caused if the id parameter\n of any particular FocusEvent instance is not\n in the range from FOCUS_FIRST to FOCUS_LAST.", "codes": ["public class FocusEvent\nextends ComponentEvent"], "fields": [{"field_name": "FOCUS_FIRST", "field_sig": "public static final int FOCUS_FIRST", "description": "The first number in the range of ids used for focus events."}, {"field_name": "FOCUS_LAST", "field_sig": "public static final int FOCUS_LAST", "description": "The last number in the range of ids used for focus events."}, {"field_name": "FOCUS_GAINED", "field_sig": "public static final int FOCUS_GAINED", "description": "This event indicates that the Component is now the focus owner."}, {"field_name": "FOCUS_LOST", "field_sig": "public static final int FOCUS_LOST", "description": "This event indicates that the Component is no longer the focus owner."}], "methods": [{"method_name": "isTemporary", "method_sig": "public boolean isTemporary()", "description": "Identifies the focus change event as temporary or permanent."}, {"method_name": "getOppositeComponent", "method_sig": "public Component getOppositeComponent()", "description": "Returns the other Component involved in this focus change. For a\n FOCUS_GAINED event, this is the Component that lost focus. For a\n FOCUS_LOST event, this is the Component that gained focus. If this\n focus change occurs with a native application, with a Java application\n in a different VM or context, or with no other Component, then null is\n returned."}, {"method_name": "paramString", "method_sig": "public String paramString()", "description": "Returns a parameter string identifying this event.\n This method is useful for event-logging and for debugging."}, {"method_name": "getCause", "method_sig": "public final FocusEvent.Cause getCause()", "description": "Returns the event cause."}]}