{"name": "Interface Future<V>", "module": "java.base", "package": "java.util.concurrent", "text": "A Future represents the result of an asynchronous\n computation.  Methods are provided to check if the computation is\n complete, to wait for its completion, and to retrieve the result of\n the computation.  The result can only be retrieved using method\n get when the computation has completed, blocking if\n necessary until it is ready.  Cancellation is performed by the\n cancel method.  Additional methods are provided to\n determine if the task completed normally or was cancelled. Once a\n computation has completed, the computation cannot be cancelled.\n If you would like to use a Future for the sake\n of cancellability but not provide a usable result, you can\n declare types of the form Future<?> and\n return null as a result of the underlying task.\n\n Sample Usage (Note that the following classes are all\n made-up.)\n\n  \n interface ArchiveSearcher { String search(String target); }\n class App {\n   ExecutorService executor = ...\n   ArchiveSearcher searcher = ...\n   void showSearch(String target) throws InterruptedException {\n     Callable<String> task = () -> searcher.search(target);\n     Future<String> future = executor.submit(task);\n     displayOtherThings(); // do other things while searching\n     try {\n       displayText(future.get()); // use future\n     } catch (ExecutionException ex) { cleanup(); return; }\n   }\n }\n\n The FutureTask class is an implementation of Future that\n implements Runnable, and so may be executed by an Executor.\n For example, the above construction with submit could be replaced by:\n  \n FutureTask<String> future = new FutureTask<>(task);\n executor.execute(future);\nMemory consistency effects: Actions taken by the asynchronous computation\n  happen-before\n actions following the corresponding Future.get() in another thread.", "codes": ["public interface Future<V>"], "fields": [], "methods": [{"method_name": "cancel", "method_sig": "boolean cancel (boolean mayInterruptIfRunning)", "description": "Attempts to cancel execution of this task.  This attempt will\n fail if the task has already completed, has already been cancelled,\n or could not be cancelled for some other reason. If successful,\n and this task has not started when cancel is called,\n this task should never run.  If the task has already started,\n then the mayInterruptIfRunning parameter determines\n whether the thread executing this task should be interrupted in\n an attempt to stop the task.\n\n After this method returns, subsequent calls to isDone() will\n always return true.  Subsequent calls to isCancelled()\n will always return true if this method returned true."}, {"method_name": "isCancelled", "method_sig": "boolean isCancelled()", "description": "Returns true if this task was cancelled before it completed\n normally."}, {"method_name": "isDone", "method_sig": "boolean isDone()", "description": "Returns true if this task completed.\n\n Completion may be due to normal termination, an exception, or\n cancellation -- in all of these cases, this method will return\n true."}, {"method_name": "get", "method_sig": "V get()\nthrows InterruptedException,\n      ExecutionException", "description": "Waits if necessary for the computation to complete, and then\n retrieves its result."}, {"method_name": "get", "method_sig": "V get (long timeout,\n      TimeUnit unit)\nthrows InterruptedException,\n      ExecutionException,\n      TimeoutException", "description": "Waits if necessary for at most the given time for the computation\n to complete, and then retrieves its result, if available."}]}