{"name": "Class GroupLayout", "module": "java.desktop", "package": "javax.swing", "text": "GroupLayout is a LayoutManager that hierarchically\n groups components in order to position them in a Container.\n GroupLayout is intended for use by builders, but may be\n hand-coded as well.\n Grouping is done by instances of the Group class. \n GroupLayout supports two types of groups. A sequential group\n positions its child elements sequentially, one after another. A\n parallel group aligns its child elements in one of four ways.\n \n Each group may contain any number of elements, where an element is\n a Group, Component, or gap. A gap can be thought\n of as an invisible component with a minimum, preferred and maximum\n size. In addition GroupLayout supports a preferred gap,\n whose value comes from LayoutStyle.\n \n Elements are similar to a spring. Each element has a range as\n specified by a minimum, preferred and maximum.  Gaps have either a\n developer-specified range, or a range determined by \n LayoutStyle. The range for Components is determined from\n the Component's getMinimumSize, \n getPreferredSize and getMaximumSize methods. In addition,\n when adding Components you may specify a particular range\n to use instead of that from the component. The range for a \n Group is determined by the type of group. A ParallelGroup's\n range is the maximum of the ranges of its elements. A \n SequentialGroup's range is the sum of the ranges of its elements.\n \nGroupLayout treats each axis independently.  That is, there\n is a group representing the horizontal axis, and a group\n representing the vertical axis.  The horizontal group is\n responsible for determining the minimum, preferred and maximum size\n along the horizontal axis as well as setting the x and width of the\n components contained in it. The vertical group is responsible for\n determining the minimum, preferred and maximum size along the\n vertical axis as well as setting the y and height of the\n components contained in it. Each Component must exist in both\n a horizontal and vertical group, otherwise an IllegalStateException\n is thrown during layout, or when the minimum, preferred or\n maximum size is requested.\n \n The following diagram shows a sequential group along the horizontal\n axis. The sequential group contains three components. A parallel group\n was used along the vertical axis.\n \n\n\n To reinforce that each axis is treated independently the diagram shows\n the range of each group and element along each axis. The\n range of each component has been projected onto the axes,\n and the groups are rendered in blue (horizontal) and red (vertical).\n For readability there is a gap between each of the elements in the\n sequential group.\n \n The sequential group along the horizontal axis is rendered as a solid\n blue line. Notice the sequential group is the sum of the children elements\n it contains.\n \n Along the vertical axis the parallel group is the maximum of the height\n of each of the components. As all three components have the same height,\n the parallel group has the same height.\n \n The following diagram shows the same three components, but with the\n parallel group along the horizontal axis and the sequential group along\n the vertical axis.\n\n \n\n\n As c1 is the largest of the three components, the parallel\n group is sized to c1. As c2 and c3 are smaller\n than c1 they are aligned based on the alignment specified\n for the component (if specified) or the default alignment of the\n parallel group. In the diagram c2 and c3 were created\n with an alignment of LEADING. If the component orientation were\n right-to-left then c2 and c3 would be positioned on\n the opposite side.\n \n The following diagram shows a sequential group along both the horizontal\n and vertical axis.\n \n\n\nGroupLayout provides the ability to insert gaps between\n Components. The size of the gap is determined by an\n instance of LayoutStyle. This may be turned on using the\n setAutoCreateGaps method.  Similarly, you may use\n the setAutoCreateContainerGaps method to insert gaps\n between components that touch the edge of the parent container and the\n container.\n \n The following builds a panel consisting of two labels in\n one column, followed by two textfields in the next column:\n \n   JComponent panel = ...;\n   GroupLayout layout = new GroupLayout(panel);\n   panel.setLayout(layout);\n\n   // Turn on automatically adding gaps between components\n   layout.setAutoCreateGaps(true);\n\n   // Turn on automatically creating gaps between components that touch\n   // the edge of the container and the container.\n   layout.setAutoCreateContainerGaps(true);\n\n   // Create a sequential group for the horizontal axis.\n\n   GroupLayout.SequentialGroup hGroup = layout.createSequentialGroup();\n\n   // The sequential group in turn contains two parallel groups.\n   // One parallel group contains the labels, the other the text fields.\n   // Putting the labels in a parallel group along the horizontal axis\n   // positions them at the same x location.\n   //\n   // Variable indentation is used to reinforce the level of grouping.\n   hGroup.addGroup(layout.createParallelGroup().\n            addComponent(label1).addComponent(label2));\n   hGroup.addGroup(layout.createParallelGroup().\n            addComponent(tf1).addComponent(tf2));\n   layout.setHorizontalGroup(hGroup);\n\n   // Create a sequential group for the vertical axis.\n   GroupLayout.SequentialGroup vGroup = layout.createSequentialGroup();\n\n   // The sequential group contains two parallel groups that align\n   // the contents along the baseline. The first parallel group contains\n   // the first label and text field, and the second parallel group contains\n   // the second label and text field. By using a sequential group\n   // the labels and text fields are positioned vertically after one another.\n   vGroup.addGroup(layout.createParallelGroup(Alignment.BASELINE).\n            addComponent(label1).addComponent(tf1));\n   vGroup.addGroup(layout.createParallelGroup(Alignment.BASELINE).\n            addComponent(label2).addComponent(tf2));\n   layout.setVerticalGroup(vGroup);\n \n\n When run the following is produced.\n \n\n\n This layout consists of the following.\n The horizontal axis consists of a sequential group containing two\n         parallel groups.  The first parallel group contains the labels,\n         and the second parallel group contains the text fields.\n     The vertical axis consists of a sequential group\n         containing two parallel groups.  The parallel groups are configured\n         to align their components along the baseline. The first parallel\n         group contains the first label and first text field, and\n         the second group consists of the second label and second\n         text field.\n \n There are a couple of things to notice in this code:\n \nYou need not explicitly add the components to the container; this\n       is indirectly done by using one of the add methods of\n       Group.\n   The various add methods return\n       the caller.  This allows for easy chaining of invocations.  For\n       example, group.addComponent(label1).addComponent(label2); is\n       equivalent to\n       group.addComponent(label1); group.addComponent(label2);.\n   There are no public constructors for Groups; instead\n       use the create methods of GroupLayout.\n ", "codes": ["public class GroupLayout\nextends Object\nimplements LayoutManager2"], "fields": [{"field_name": "DEFAULT_SIZE", "field_sig": "public static final int DEFAULT_SIZE", "description": "Indicates the size from the component or gap should be used for a\n particular range value."}, {"field_name": "PREFERRED_SIZE", "field_sig": "public static final int PREFERRED_SIZE", "description": "Indicates the preferred size from the component or gap should\n be used for a particular range value."}], "methods": [{"method_name": "setHonorsVisibility", "method_sig": "public void setHonorsVisibility (boolean honorsVisibility)", "description": "Sets whether component visibility is considered when sizing and\n positioning components. A value of true indicates that\n non-visible components should not be treated as part of the\n layout. A value of false indicates that components should be\n positioned and sized regardless of visibility.\n \n A value of false is useful when the visibility of components\n is dynamically adjusted and you don't want surrounding components and\n the sizing to change.\n \n The specified value is used for components that do not have an\n explicit visibility specified.\n \n The default is true."}, {"method_name": "getHonorsVisibility", "method_sig": "public boolean getHonorsVisibility()", "description": "Returns whether component visibility is considered when sizing and\n positioning components."}, {"method_name": "setHonorsVisibility", "method_sig": "public void setHonorsVisibility (Component component,\n                                Boolean honorsVisibility)", "description": "Sets whether the component's visibility is considered for\n sizing and positioning. A value of Boolean.TRUE\n indicates that if component is not visible it should\n not be treated as part of the layout. A value of false\n indicates that component is positioned and sized\n regardless of it's visibility.  A value of null\n indicates the value specified by the single argument method \n setHonorsVisibility should be used.\n \n If component is not a child of the Container this\n GroupLayout is managing, it will be added to the\n Container."}, {"method_name": "setAutoCreateGaps", "method_sig": "public void setAutoCreateGaps (boolean autoCreatePadding)", "description": "Sets whether a gap between components should automatically be\n created.  For example, if this is true and you add two\n components to a SequentialGroup a gap between the\n two components is automatically be created.  The default is\n false."}, {"method_name": "getAutoCreateGaps", "method_sig": "public boolean getAutoCreateGaps()", "description": "Returns true if gaps between components are automatically\n created."}, {"method_name": "setAutoCreateContainerGaps", "method_sig": "public void setAutoCreateContainerGaps (boolean autoCreateContainerPadding)", "description": "Sets whether a gap between the container and components that\n touch the border of the container should automatically be\n created. The default is false."}, {"method_name": "getAutoCreateContainerGaps", "method_sig": "public boolean getAutoCreateContainerGaps()", "description": "Returns true if gaps between the container and components that\n border the container are automatically created."}, {"method_name": "setHorizontalGroup", "method_sig": "public void setHorizontalGroup (GroupLayout.Group group)", "description": "Sets the Group that positions and sizes\n components along the horizontal axis."}, {"method_name": "setVerticalGroup", "method_sig": "public void setVerticalGroup (GroupLayout.Group group)", "description": "Sets the Group that positions and sizes\n components along the vertical axis."}, {"method_name": "createSequentialGroup", "method_sig": "public GroupLayout.SequentialGroup createSequentialGroup()", "description": "Creates and returns a SequentialGroup."}, {"method_name": "createParallelGroup", "method_sig": "public GroupLayout.ParallelGroup createParallelGroup()", "description": "Creates and returns a ParallelGroup with an alignment of\n Alignment.LEADING.  This is a cover method for the more\n general createParallelGroup(Alignment) method."}, {"method_name": "createParallelGroup", "method_sig": "public GroupLayout.ParallelGroup createParallelGroup (GroupLayout.Alignment alignment)", "description": "Creates and returns a ParallelGroup with the specified\n alignment.  This is a cover method for the more general \n createParallelGroup(Alignment,boolean) method with true\n supplied for the second argument."}, {"method_name": "createParallelGroup", "method_sig": "public GroupLayout.ParallelGroup createParallelGroup (GroupLayout.Alignment alignment,\n                                                     boolean resizable)", "description": "Creates and returns a ParallelGroup with the specified\n alignment and resize behavior. The \n alignment argument specifies how children elements are\n positioned that do not fill the group. For example, if a \n ParallelGroup with an alignment of TRAILING is given\n 100 and a child only needs 50, the child is\n positioned at the position 50 (with a component orientation of\n left-to-right).\n \n Baseline alignment is only useful when used along the vertical\n axis. A ParallelGroup created with a baseline alignment\n along the horizontal axis is treated as LEADING.\n \n Refer to ParallelGroup for details on\n the behavior of baseline groups."}, {"method_name": "createBaselineGroup", "method_sig": "public GroupLayout.ParallelGroup createBaselineGroup (boolean resizable,\n                                                     boolean anchorBaselineToTop)", "description": "Creates and returns a ParallelGroup that aligns it's\n elements along the baseline."}, {"method_name": "linkSize", "method_sig": "public void linkSize (Component... components)", "description": "Forces the specified components to have the same size\n regardless of their preferred, minimum or maximum sizes. Components that\n are linked are given the maximum of the preferred size of each of\n the linked components. For example, if you link two components with\n a preferred width of 10 and 20, both components are given a width of 20.\n \n This can be used multiple times to force any number of\n components to share the same size.\n \n Linked Components are not be resizable."}, {"method_name": "linkSize", "method_sig": "public void linkSize (int axis,\n                     Component... components)", "description": "Forces the specified components to have the same size along the\n specified axis regardless of their preferred, minimum or\n maximum sizes. Components that are linked are given the maximum\n of the preferred size of each of the linked components. For\n example, if you link two components along the horizontal axis\n and the preferred width is 10 and 20, both components are given\n a width of 20.\n \n This can be used multiple times to force any number of\n components to share the same size.\n \n Linked Components are not be resizable."}, {"method_name": "replace", "method_sig": "public void replace (Component existingComponent,\n                    Component newComponent)", "description": "Replaces an existing component with a new one."}, {"method_name": "setLayoutStyle", "method_sig": "public void setLayoutStyle (LayoutStyle layoutStyle)", "description": "Sets the LayoutStyle used to calculate the preferred\n gaps between components. A value of null indicates the\n shared instance of LayoutStyle should be used."}, {"method_name": "getLayoutStyle", "method_sig": "public LayoutStyle getLayoutStyle()", "description": "Returns the LayoutStyle used for calculating the preferred\n gap between components. This returns the value specified to\n setLayoutStyle, which may be null."}, {"method_name": "addLayoutComponent", "method_sig": "public void addLayoutComponent (String name,\n                               Component component)", "description": "Notification that a Component has been added to\n the parent container.  You should not invoke this method\n directly, instead you should use one of the Group\n methods to add a Component."}, {"method_name": "removeLayoutComponent", "method_sig": "public void removeLayoutComponent (Component component)", "description": "Notification that a Component has been removed from\n the parent container.  You should not invoke this method\n directly, instead invoke remove on the parent\n Container."}, {"method_name": "preferredLayoutSize", "method_sig": "public Dimension preferredLayoutSize (Container parent)", "description": "Returns the preferred size for the specified container."}, {"method_name": "minimumLayoutSize", "method_sig": "public Dimension minimumLayoutSize (Container parent)", "description": "Returns the minimum size for the specified container."}, {"method_name": "layoutContainer", "method_sig": "public void layoutContainer (Container parent)", "description": "Lays out the specified container."}, {"method_name": "addLayoutComponent", "method_sig": "public void addLayoutComponent (Component component,\n                               Object constraints)", "description": "Notification that a Component has been added to\n the parent container.  You should not invoke this method\n directly, instead you should use one of the Group\n methods to add a Component."}, {"method_name": "maximumLayoutSize", "method_sig": "public Dimension maximumLayoutSize (Container parent)", "description": "Returns the maximum size for the specified container."}, {"method_name": "getLayoutAlignmentX", "method_sig": "public float getLayoutAlignmentX (Container parent)", "description": "Returns the alignment along the x axis.  This specifies how\n the component would like to be aligned relative to other\n components.  The value should be a number between 0 and 1\n where 0 represents alignment along the origin, 1 is aligned\n the furthest away from the origin, 0.5 is centered, etc."}, {"method_name": "getLayoutAlignmentY", "method_sig": "public float getLayoutAlignmentY (Container parent)", "description": "Returns the alignment along the y axis.  This specifies how\n the component would like to be aligned relative to other\n components.  The value should be a number between 0 and 1\n where 0 represents alignment along the origin, 1 is aligned\n the furthest away from the origin, 0.5 is centered, etc."}, {"method_name": "invalidateLayout", "method_sig": "public void invalidateLayout (Container parent)", "description": "Invalidates the layout, indicating that if the layout manager\n has cached information it should be discarded."}, {"method_name": "toString", "method_sig": "public String toString()", "description": "Returns a string representation of this GroupLayout.\n This method is intended to be used for debugging purposes,\n and the content and format of the returned string may vary\n between implementations."}]}