{"name": "Class GroupLayout.ParallelGroup", "module": "java.desktop", "package": "javax.swing", "text": "A Group that aligns and sizes it's children.\n ParallelGroup aligns it's children in\n four possible ways: along the baseline, centered, anchored to the\n leading edge, or anchored to the trailing edge.\n Baseline\n A ParallelGroup that aligns it's children along the\n baseline must first decide where the baseline is\n anchored. The baseline can either be anchored to the top, or\n anchored to the bottom of the group. That is, the distance between the\n baseline and the beginning of the group can be a constant\n distance, or the distance between the end of the group and the\n baseline can be a constant distance. The possible choices\n correspond to the BaselineResizeBehavior constants\n CONSTANT_ASCENT and\n CONSTANT_DESCENT.\n \n The baseline anchor may be explicitly specified by the\n createBaselineGroup method, or determined based on the elements.\n If not explicitly specified, the baseline will be anchored to\n the bottom if all the elements with a baseline, and that are\n aligned to the baseline, have a baseline resize behavior of\n CONSTANT_DESCENT; otherwise the baseline is anchored to the top\n of the group.\n \n Elements aligned to the baseline are resizable if they have\n a baseline resize behavior of CONSTANT_ASCENT or\n CONSTANT_DESCENT. Elements with a baseline resize\n behavior of OTHER or CENTER_OFFSET are not resizable.\n \n The baseline is calculated based on the preferred height of each\n of the elements that have a baseline. The baseline is\n calculated using the following algorithm:\n max(maxNonBaselineHeight, maxAscent + maxDescent), where the\n maxNonBaselineHeight is the maximum height of all elements\n that do not have a baseline, or are not aligned along the baseline.\n maxAscent is the maximum ascent (baseline) of all elements that\n have a baseline and are aligned along the baseline.\n maxDescent is the maximum descent (preferred height - baseline)\n of all elements that have a baseline and are aligned along the baseline.\n \n A ParallelGroup that aligns it's elements along the baseline\n is only useful along the vertical axis. If you create a\n baseline group and use it along the horizontal axis an\n IllegalStateException is thrown when you ask\n GroupLayout for the minimum, preferred or maximum size or\n attempt to layout the components.\n \n Elements that are not aligned to the baseline and smaller than the size\n of the ParallelGroup are positioned in one of three\n ways: centered, anchored to the leading edge, or anchored to the\n trailing edge.\n\n Non-baseline ParallelGroup\nParallelGroups created with an alignment other than\n BASELINE align elements that are smaller than the size\n of the group in one of three ways: centered, anchored to the\n leading edge, or anchored to the trailing edge.\n \n The leading edge is based on the axis and \n ComponentOrientation.  For the vertical axis the top edge is\n always the leading edge, and the bottom edge is always the\n trailing edge. When the ComponentOrientation is \n LEFT_TO_RIGHT, the leading edge is the left edge and the\n trailing edge the right edge. A ComponentOrientation of\n RIGHT_TO_LEFT flips the left and right edges. Child\n elements are aligned based on the specified alignment the\n element was added with. If you do not specify an alignment, the\n alignment specified for the ParallelGroup is used.\n \n To align elements along the baseline you createBaselineGroup,\n or createParallelGroup with an alignment of BASELINE.\n If the group was not created with a baseline alignment, and you attempt\n to add an element specifying a baseline alignment, an\n IllegalArgumentException is thrown.", "codes": ["public class GroupLayout.ParallelGroup\nextends GroupLayout.Group"], "fields": [], "methods": [{"method_name": "addGroup", "method_sig": "public GroupLayout.ParallelGroup addGroup (GroupLayout.Alignment alignment,\n                                          GroupLayout.Group group)", "description": "Adds a Group to this ParallelGroup with the\n specified alignment. If the child is smaller than the\n Group it is aligned based on the specified\n alignment."}, {"method_name": "addComponent", "method_sig": "public GroupLayout.ParallelGroup addComponent (Component component,\n                                              GroupLayout.Alignment alignment)", "description": "Adds a Component to this ParallelGroup with\n the specified alignment."}, {"method_name": "addComponent", "method_sig": "public GroupLayout.ParallelGroup addComponent (Component component,\n                                              GroupLayout.Alignment alignment,\n                                              int min,\n                                              int pref,\n                                              int max)", "description": "Adds a Component to this ParallelGroup with the\n specified alignment and size."}]}