{"name": "Class Headers", "module": "jdk.httpserver", "package": "com.sun.net.httpserver", "text": "HTTP request and response headers are represented by this class which implements\n the interface\n Map<String, List\n <String>>.\n The keys are case-insensitive Strings representing the header names and\n the value associated with each key is\n a List<String> with one\n element for each occurrence of the header name in the request or response.\n \n For example, if a response header instance contains\n one key \"HeaderName\" with two values \"value1 and value2\"\n then this object is output as two header lines:\n \n HeaderName: value1\n HeaderName: value2\n \n\n All the normal Map methods are provided, but the following\n additional convenience methods are most likely to be used:\n \ngetFirst(String) returns a single valued header or the first value of\n a multi-valued header.\nadd(String,String) adds the given header value to the list for the given key\nset(String,String) sets the given header field to the single value given\n overwriting any existing values in the value list.\n \n All methods in this class accept null values for keys and values. However, null\n keys will never will be present in HTTP request headers, and will not be output/sent in response headers.\n Null values can be represented as either a null entry for the key (i.e. the list is null) or\n where the key has a list, but one (or more) of the list's values is null. Null values are output\n as a header line containing the key but no associated value.", "codes": ["public class Headers\nextends Object\nimplements Map<String, List<String>>"], "fields": [], "methods": [{"method_name": "getFirst", "method_sig": "public String getFirst (String key)", "description": "returns the first value from the List of String values\n for the given key (if at least one exists)."}, {"method_name": "add", "method_sig": "public void add (String key,\n                String value)", "description": "adds the given value to the list of headers\n for the given key. If the mapping does not\n already exist, then it is created"}, {"method_name": "set", "method_sig": "public void set (String key,\n                String value)", "description": "sets the given value as the sole header value\n for the given key. If the mapping does not\n already exist, then it is created"}]}