{"name": "Class HTML", "module": "java.desktop", "package": "javax.swing.text.html", "text": "Constants used in the HTMLDocument.  These\n are basically tag and attribute definitions.", "codes": ["public class HTML\nextends Object"], "fields": [{"field_name": "NULL_ATTRIBUTE_VALUE", "field_sig": "public static final String NULL_ATTRIBUTE_VALUE", "description": "NULL_ATTRIBUTE_VALUE used in cases where the value for the attribute has not\n  been specified."}], "methods": [{"method_name": "getAllTags", "method_sig": "public static HTML.Tag[] getAllTags()", "description": "Returns the set of actual HTML tags that\n are recognized by the default HTML reader.\n This set does not include tags that are\n manufactured by the reader."}, {"method_name": "getTag", "method_sig": "public static HTML.Tag getTag (String tagName)", "description": "Fetches a tag constant for a well-known tag name (i.e. one of\n the tags in the set {A, ADDRESS, APPLET, AREA, B,\n BASE, BASEFONT, BIG,\n BLOCKQUOTE, BODY, BR, CAPTION, CENTER, CITE, CODE,\n DD, DFN, DIR, DIV, DL, DT, EM, FONT, FORM, FRAME,\n FRAMESET, H1, H2, H3, H4, H5, H6, HEAD, HR, HTML,\n I, IMG, INPUT, ISINDEX, KBD, LI, LINK, MAP, MENU,\n META, NOBR, NOFRAMES, OBJECT, OL, OPTION, P, PARAM,\n PRE, SAMP, SCRIPT, SELECT, SMALL, SPAN, STRIKE, S,\n STRONG, STYLE, SUB, SUP, TABLE, TD, TEXTAREA,\n TH, TITLE, TR, TT, U, UL, VAR}.  If the given\n name does not represent one of the well-known tags, then\n null will be returned."}, {"method_name": "getIntegerAttributeValue", "method_sig": "public static int getIntegerAttributeValue (AttributeSet attr,\n                                           HTML.Attribute key,\n                                           int def)", "description": "Fetches an integer attribute value.  Attribute values\n are stored as a string, and this is a convenience method\n to convert to an actual integer."}, {"method_name": "getAllAttributeKeys", "method_sig": "public static HTML.Attribute[] getAllAttributeKeys()", "description": "Returns the set of HTML attributes recognized."}, {"method_name": "getAttributeKey", "method_sig": "public static HTML.Attribute getAttributeKey (String attName)", "description": "Fetches an attribute constant for a well-known attribute name\n (i.e. one of the attributes in the set {FACE, COMMENT, SIZE,\n COLOR, CLEAR, BACKGROUND, BGCOLOR, TEXT, LINK, VLINK, ALINK,\n WIDTH, HEIGHT, ALIGN, NAME, HREF, REL, REV, TITLE, TARGET,\n SHAPE, COORDS, ISMAP, NOHREF, ALT, ID, SRC, HSPACE, VSPACE,\n USEMAP, LOWSRC, CODEBASE, CODE, ARCHIVE, VALUE, VALUETYPE,\n TYPE, CLASS, STYLE, LANG, DIR, DECLARE, CLASSID, DATA, CODETYPE,\n STANDBY, BORDER, SHAPES, NOSHADE, COMPACT, START, ACTION, METHOD,\n ENCTYPE, CHECKED, MAXLENGTH, MULTIPLE, SELECTED, ROWS, COLS,\n DUMMY, CELLSPACING, CELLPADDING, VALIGN, HALIGN, NOWRAP, ROWSPAN,\n COLSPAN, PROMPT, HTTPEQUIV, CONTENT, LANGUAGE, VERSION, N,\n FRAMEBORDER, MARGINWIDTH, MARGINHEIGHT, SCROLLING, NORESIZE,\n MEDIA, ENDTAG}).\n If the given name does not represent one of the well-known attributes,\n then null will be returned."}]}