{"name": "Interface HttpResponse<T>", "module": "java.net.http", "package": "java.net.http", "text": "An HTTP response.\n\n  An HttpResponse is not created directly, but rather returned as\n a result of sending an HttpRequest. An HttpResponse is\n made available when the response status code and headers have been received,\n and typically after the response body has also been completely received.\n Whether or not the HttpResponse is made available before the response\n body has been completely received depends on the BodyHandler provided when sending the HttpRequest.\n\n  This class provides methods for accessing the response status code,\n headers, the response body, and the HttpRequest corresponding\n to this response.\n\n  The following is an example of retrieving a response as a String:\n\n    HttpResponse<String> response = client\n     .send(request, BodyHandlers.ofString()); \n The class BodyHandlers provides implementations\n of many common response handlers. Alternatively, a custom BodyHandler\n implementation can be used.", "codes": ["public interface HttpResponse<T>"], "fields": [], "methods": [{"method_name": "statusCode", "method_sig": "int statusCode()", "description": "Returns the status code for this response."}, {"method_name": "request", "method_sig": "HttpRequest request()", "description": "Returns the HttpRequest corresponding to this response.\n\n  The returned HttpRequest may not be the initiating request\n provided when sending. For example, if the initiating request was redirected, then the\n request returned by this method will have the redirected URI, which will\n be different from the initiating request URI."}, {"method_name": "previousResponse", "method_sig": "Optional<HttpResponse<T>> previousResponse()", "description": "Returns an Optional containing the previous intermediate response\n if one was received. An intermediate response is one that is received\n as a result of redirection or authentication. If no previous response\n was received then an empty Optional is returned."}, {"method_name": "headers", "method_sig": "HttpHeaders headers()", "description": "Returns the received response headers."}, {"method_name": "body", "method_sig": "T body()", "description": "Returns the body. Depending on the type of T, the returned body\n may represent the body after it was read (such as byte[], or\n String, or Path) or it may represent an object with\n which the body is read, such as an InputStream.\n\n  If this HttpResponse was returned from an invocation of\n previousResponse() then this method returns null"}, {"method_name": "sslSession", "method_sig": "Optional<SSLSession> sslSession()", "description": "Returns an Optional containing the SSLSession in effect\n for this response. Returns an empty Optional if this is not a\n HTTPS response."}, {"method_name": "uri", "method_sig": "URI uri()", "description": "Returns the URI that the response was received from. This may be\n different from the request URI if redirection occurred."}, {"method_name": "version", "method_sig": "HttpClient.Version version()", "description": "Returns the HTTP protocol version that was used for this response."}]}