{"name": "Interface HttpRequest.BodyPublisher", "module": "java.net.http", "package": "java.net.http", "text": "A BodyPublisher converts high-level Java objects into a flow of\n byte buffers suitable for sending as a request body.  The class\n BodyPublishers provides implementations of many\n common publishers.\n\n  The BodyPublisher interface extends Flow.Publisher<ByteBuffer>, which means that a BodyPublisher\n acts as a publisher of byte buffers.\n\n  When sending a request that contains a body, the HTTP Client\n subscribes to the request's BodyPublisher in order to receive the\n flow of outgoing request body data. The normal semantics of Flow.Subscriber and Flow.Publisher are implemented by the HTTP\n Client and are expected from BodyPublisher implementations. Each\n outgoing request results in one HTTP Client Subscriber\n subscribing to the BodyPublisher in order to provide the sequence\n of byte buffers containing the request body. Instances of \n ByteBuffer published by the publisher must be allocated by the\n publisher, and must not be accessed after being published to the HTTP\n Client. These subscriptions complete normally when the request body is\n fully sent, and can be canceled or terminated early through error. If a\n request needs to be resent for any reason, then a new subscription is\n created which is expected to generate the same data as before.\n\n  A BodyPublisher that reports a content length of 0 may not be subscribed to by the HTTP Client,\n as it has effectively no data to publish.", "codes": ["public static interface HttpRequest.BodyPublisher\nextends Flow.Publisher<ByteBuffer>"], "fields": [], "methods": [{"method_name": "contentLength", "method_sig": "long contentLength()", "description": "Returns the content length for this request body. May be zero\n if no request body being sent, greater than zero for a fixed\n length content, or less than zero for an unknown content length.\n\n  This method may be invoked before the publisher is subscribed to.\n This method may be invoked more than once by the HTTP client\n implementation, and MUST return the same constant value each time."}]}