{"name": "Class ICC_ProfileGray", "module": "java.desktop", "package": "java.awt.color", "text": "A subclass of the ICC_Profile class which represents profiles\n which meet the following criteria: the color space type of the\n profile is TYPE_GRAY and the profile includes the grayTRCTag and\n mediaWhitePointTag tags.  Examples of this kind of profile are\n monochrome input profiles, monochrome display profiles, and\n monochrome output profiles.  The getInstance methods in the\n ICC_Profile class will\n return an ICC_ProfileGray object when the above conditions are\n met.  The advantage of this class is that it provides a lookup\n table that Java or native methods may be able to use directly to\n optimize color conversion in some cases.\n \n To transform from a GRAY device profile color space to the CIEXYZ Profile\n Connection Space, the device gray component is transformed by\n a lookup through the tone reproduction curve (TRC).  The result is\n treated as the achromatic component of the PCS.\n\n\n                PCSY = grayTRC[deviceGray]\n\n\n The inverse transform is done by converting the PCS Y components to\n device Gray via the inverse of the grayTRC.", "codes": ["public class ICC_ProfileGray\nextends ICC_Profile"], "fields": [], "methods": [{"method_name": "getMediaWhitePoint", "method_sig": "public float[] getMediaWhitePoint()", "description": "Returns a float array of length 3 containing the X, Y, and Z\n components of the mediaWhitePointTag in the ICC profile."}, {"method_name": "getGamma", "method_sig": "public float getGamma()", "description": "Returns a gamma value representing the tone reproduction\n curve (TRC).  If the profile represents the TRC as a table rather\n than a single gamma value, then an exception is thrown.  In this\n case the actual table can be obtained via getTRC().  When\n using a gamma value, the PCS Y component is computed as follows:\n\n\n                          gamma\n         PCSY = deviceGray\n\n"}, {"method_name": "getTRC", "method_sig": "public short[] getTRC()", "description": "Returns the TRC as an array of shorts.  If the profile has\n specified the TRC as linear (gamma = 1.0) or as a simple gamma\n value, this method throws an exception, and the getGamma() method\n should be used to get the gamma value.  Otherwise the short array\n returned here represents a lookup table where the input Gray value\n is conceptually in the range [0.0, 1.0].  Value 0.0 maps\n to array index 0 and value 1.0 maps to array index length-1.\n Interpolation may be used to generate output values for\n input values which do not map exactly to an index in the\n array.  Output values also map linearly to the range [0.0, 1.0].\n Value 0.0 is represented by an array value of 0x0000 and\n value 1.0 by 0xFFFF, i.e. the values are really unsigned\n short values, although they are returned in a short array."}]}