{"name": "Class IDN", "module": "java.base", "package": "java.net", "text": "Provides methods to convert internationalized domain names (IDNs) between\n a normal Unicode representation and an ASCII Compatible Encoding (ACE) representation.\n Internationalized domain names can use characters from the entire range of\n Unicode, while traditional domain names are restricted to ASCII characters.\n ACE is an encoding of Unicode strings that uses only ASCII characters and\n can be used with software (such as the Domain Name System) that only\n understands traditional domain names.\n\n Internationalized domain names are defined in RFC 3490.\n RFC 3490 defines two operations: ToASCII and ToUnicode. These 2 operations employ\n Nameprep algorithm, which is a\n profile of Stringprep, and\n Punycode algorithm to convert\n domain name string back and forth.\n\n The behavior of aforementioned conversion process can be adjusted by various flags:\n   \nIf the ALLOW_UNASSIGNED flag is used, the domain name string to be converted\n         can contain code points that are unassigned in Unicode 3.2, which is the\n         Unicode version on which IDN conversion is based. If the flag is not used,\n         the presence of such unassigned code points is treated as an error.\n     If the USE_STD3_ASCII_RULES flag is used, ASCII strings are checked against RFC 1122 and RFC 1123.\n         It is an error if they don't meet the requirements.\n   \n These flags can be logically OR'ed together.\n\n The security consideration is important with respect to internationalization\n domain name support. For example, English domain names may be homographed\n - maliciously misspelled by substitution of non-Latin letters.\n Unicode Technical Report #36\n discusses security issues of IDN support as well as possible solutions.\n Applications are responsible for taking adequate security measures when using\n international domain names.", "codes": ["public final class IDN\nextends Object"], "fields": [{"field_name": "ALLOW_UNASSIGNED", "field_sig": "public static final int ALLOW_UNASSIGNED", "description": "Flag to allow processing of unassigned code points"}, {"field_name": "USE_STD3_ASCII_RULES", "field_sig": "public static final int USE_STD3_ASCII_RULES", "description": "Flag to turn on the check against STD-3 ASCII rules"}], "methods": [{"method_name": "toASCII", "method_sig": "public static String toASCII (String input,\n                             int flag)", "description": "Translates a string from Unicode to ASCII Compatible Encoding (ACE),\n as defined by the ToASCII operation of RFC 3490.\n\n ToASCII operation can fail. ToASCII fails if any step of it fails.\n If ToASCII operation fails, an IllegalArgumentException will be thrown.\n In this case, the input string should not be used in an internationalized domain name.\n\n  A label is an individual part of a domain name. The original ToASCII operation,\n as defined in RFC 3490, only operates on a single label. This method can handle\n both label and entire domain name, by assuming that labels in a domain name are\n always separated by dots. The following characters are recognized as dots:\n \\u002E (full stop), \\u3002 (ideographic full stop), \\uFF0E (fullwidth full stop),\n and \\uFF61 (halfwidth ideographic full stop). if dots are\n used as label separators, this method also changes all of them to \\u002E (full stop)\n in output translated string."}, {"method_name": "toASCII", "method_sig": "public static String toASCII (String input)", "description": "Translates a string from Unicode to ASCII Compatible Encoding (ACE),\n as defined by the ToASCII operation of RFC 3490.\n\n  This convenience method works as if by invoking the\n two-argument counterpart as follows:\n \ntoASCII(input, 0);\n "}, {"method_name": "toUnicode", "method_sig": "public static String toUnicode (String input,\n                               int flag)", "description": "Translates a string from ASCII Compatible Encoding (ACE) to Unicode,\n as defined by the ToUnicode operation of RFC 3490.\n\n ToUnicode never fails. In case of any error, the input string is returned unmodified.\n\n  A label is an individual part of a domain name. The original ToUnicode operation,\n as defined in RFC 3490, only operates on a single label. This method can handle\n both label and entire domain name, by assuming that labels in a domain name are\n always separated by dots. The following characters are recognized as dots:\n \\u002E (full stop), \\u3002 (ideographic full stop), \\uFF0E (fullwidth full stop),\n and \\uFF61 (halfwidth ideographic full stop)."}, {"method_name": "toUnicode", "method_sig": "public static String toUnicode (String input)", "description": "Translates a string from ASCII Compatible Encoding (ACE) to Unicode,\n as defined by the ToUnicode operation of RFC 3490.\n\n  This convenience method works as if by invoking the\n two-argument counterpart as follows:\n \ntoUnicode(input, 0);\n "}]}