{"name": "Interface ImageConsumer", "module": "java.desktop", "package": "java.awt.image", "text": "The interface for objects expressing interest in image data through\n the ImageProducer interfaces.  When a consumer is added to an image\n producer, the producer delivers all of the data about the image\n using the method calls defined in this interface.", "codes": ["public interface ImageConsumer"], "fields": [{"field_name": "RANDOMPIXELORDER", "field_sig": "static final int RANDOMPIXELORDER", "description": "The pixels will be delivered in a random order.  This tells the\n ImageConsumer not to use any optimizations that depend on the\n order of pixel delivery, which should be the default assumption\n in the absence of any call to the setHints method."}, {"field_name": "TOPDOWNLEFTRIGHT", "field_sig": "static final int TOPDOWNLEFTRIGHT", "description": "The pixels will be delivered in top-down, left-to-right order."}, {"field_name": "COMPLETESCANLINES", "field_sig": "static final int COMPLETESCANLINES", "description": "The pixels will be delivered in (multiples of) complete scanlines\n at a time."}, {"field_name": "SINGLEPASS", "field_sig": "static final int SINGLEPASS", "description": "The pixels will be delivered in a single pass.  Each pixel will\n appear in only one call to any of the setPixels methods.  An\n example of an image format which does not meet this criterion\n is a progressive JPEG image which defines pixels in multiple\n passes, each more refined than the previous."}, {"field_name": "SINGLEFRAME", "field_sig": "static final int SINGLEFRAME", "description": "The image contain a single static image.  The pixels will be defined\n in calls to the setPixels methods and then the imageComplete method\n will be called with the STATICIMAGEDONE flag after which no more\n image data will be delivered.  An example of an image type which\n would not meet these criteria would be the output of a video feed,\n or the representation of a 3D rendering being manipulated\n by the user.  The end of each frame in those types of images will\n be indicated by calling imageComplete with the SINGLEFRAMEDONE flag."}, {"field_name": "IMAGEERROR", "field_sig": "static final int IMAGEERROR", "description": "An error was encountered while producing the image."}, {"field_name": "SINGLEFRAMEDONE", "field_sig": "static final int SINGLEFRAMEDONE", "description": "One frame of the image is complete but there are more frames\n to be delivered."}, {"field_name": "STATICIMAGEDONE", "field_sig": "static final int STATICIMAGEDONE", "description": "The image is complete and there are no more pixels or frames\n to be delivered."}, {"field_name": "IMAGEABORTED", "field_sig": "static final int IMAGEABORTED", "description": "The image creation process was deliberately aborted."}], "methods": [{"method_name": "setDimensions", "method_sig": "void setDimensions (int width,\n                   int height)", "description": "The dimensions of the source image are reported using the\n setDimensions method call."}, {"method_name": "setProperties", "method_sig": "void setProperties (Hashtable<?, ?> props)", "description": "Sets the extensible list of properties associated with this image."}, {"method_name": "setColorModel", "method_sig": "void setColorModel (ColorModel model)", "description": "Sets the ColorModel object used for the majority of\n the pixels reported using the setPixels method\n calls.  Note that each set of pixels delivered using setPixels\n contains its own ColorModel object, so no assumption should\n be made that this model will be the only one used in delivering\n pixel values.  A notable case where multiple ColorModel objects\n may be seen is a filtered image when for each set of pixels\n that it filters, the filter\n determines  whether the\n pixels can be sent on untouched, using the original ColorModel,\n or whether the pixels should be modified (filtered) and passed\n on using a ColorModel more convenient for the filtering process."}, {"method_name": "setHints", "method_sig": "void setHints (int hintflags)", "description": "Sets the hints that the ImageConsumer uses to process the\n pixels delivered by the ImageProducer.\n The ImageProducer can deliver the pixels in any order, but\n the ImageConsumer may be able to scale or convert the pixels\n to the destination ColorModel more efficiently or with higher\n quality if it knows some information about how the pixels will\n be delivered up front.  The setHints method should be called\n before any calls to any of the setPixels methods with a bit mask\n of hints about the manner in which the pixels will be delivered.\n If the ImageProducer does not follow the guidelines for the\n indicated hint, the results are undefined."}, {"method_name": "setPixels", "method_sig": "void setPixels (int x,\n               int y,\n               int w,\n               int h,\n               ColorModel model,\n               byte[] pixels,\n               int off,\n               int scansize)", "description": "Delivers the pixels of the image with one or more calls\n to this method.  Each call specifies the location and\n size of the rectangle of source pixels that are contained in\n the array of pixels.  The specified ColorModel object should\n be used to convert the pixels into their corresponding color\n and alpha components.  Pixel (m,n) is stored in the pixels array\n at index (n * scansize + m + off).  The pixels delivered using\n this method are all stored as bytes."}, {"method_name": "setPixels", "method_sig": "void setPixels (int x,\n               int y,\n               int w,\n               int h,\n               ColorModel model,\n               int[] pixels,\n               int off,\n               int scansize)", "description": "The pixels of the image are delivered using one or more calls\n to the setPixels method.  Each call specifies the location and\n size of the rectangle of source pixels that are contained in\n the array of pixels.  The specified ColorModel object should\n be used to convert the pixels into their corresponding color\n and alpha components.  Pixel (m,n) is stored in the pixels array\n at index (n * scansize + m + off).  The pixels delivered using\n this method are all stored as ints.\n this method are all stored as ints."}, {"method_name": "imageComplete", "method_sig": "void imageComplete (int status)", "description": "The imageComplete method is called when the ImageProducer is\n finished delivering all of the pixels that the source image\n contains, or when a single frame of a multi-frame animation has\n been completed, or when an error in loading or producing the\n image has occurred.  The ImageConsumer should remove itself from the\n list of consumers registered with the ImageProducer at this time,\n unless it is interested in successive frames."}]}