{"name": "Interface ImageObserver", "module": "java.desktop", "package": "java.awt.image", "text": "An asynchronous update interface for receiving notifications about\n Image information as the Image is constructed.", "codes": ["public interface ImageObserver"], "fields": [{"field_name": "WIDTH", "field_sig": "static final int WIDTH", "description": "This flag in the infoflags argument to imageUpdate indicates that\n the width of the base image is now available and can be taken\n from the width argument to the imageUpdate callback method."}, {"field_name": "HEIGHT", "field_sig": "static final int HEIGHT", "description": "This flag in the infoflags argument to imageUpdate indicates that\n the height of the base image is now available and can be taken\n from the height argument to the imageUpdate callback method."}, {"field_name": "PROPERTIES", "field_sig": "static final int PROPERTIES", "description": "This flag in the infoflags argument to imageUpdate indicates that\n the properties of the image are now available."}, {"field_name": "SOMEBITS", "field_sig": "static final int SOMEBITS", "description": "This flag in the infoflags argument to imageUpdate indicates that\n more pixels needed for drawing a scaled variation of the image\n are available.  The bounding box of the new pixels can be taken\n from the x, y, width, and height arguments to the imageUpdate\n callback method."}, {"field_name": "FRAMEBITS", "field_sig": "static final int FRAMEBITS", "description": "This flag in the infoflags argument to imageUpdate indicates that\n another complete frame of a multi-frame image which was previously\n drawn is now available to be drawn again.  The x, y, width, and height\n arguments to the imageUpdate callback method should be ignored."}, {"field_name": "ALLBITS", "field_sig": "static final int ALLBITS", "description": "This flag in the infoflags argument to imageUpdate indicates that\n a static image which was previously drawn is now complete and can\n be drawn again in its final form.  The x, y, width, and height\n arguments to the imageUpdate callback method should be ignored."}, {"field_name": "ERROR", "field_sig": "static final int ERROR", "description": "This flag in the infoflags argument to imageUpdate indicates that\n an image which was being tracked asynchronously has encountered\n an error.  No further information will become available and\n drawing the image will fail.\n As a convenience, the ABORT flag will be indicated at the same\n time to indicate that the image production was aborted."}, {"field_name": "ABORT", "field_sig": "static final int ABORT", "description": "This flag in the infoflags argument to imageUpdate indicates that\n an image which was being tracked asynchronously was aborted before\n production was complete.  No more information will become available\n without further action to trigger another image production sequence.\n If the ERROR flag was not also set in this image update, then\n accessing any of the data in the image will restart the production\n again, probably from the beginning."}], "methods": [{"method_name": "imageUpdate", "method_sig": "boolean imageUpdate (Image img,\n                    int infoflags,\n                    int x,\n                    int y,\n                    int width,\n                    int height)", "description": "This method is called when information about an image which was\n previously requested using an asynchronous interface becomes\n available.  Asynchronous interfaces are method calls such as\n getWidth(ImageObserver) and drawImage(img, x, y, ImageObserver)\n which take an ImageObserver object as an argument.  Those methods\n register the caller as interested either in information about\n the overall image itself (in the case of getWidth(ImageObserver))\n or about an output version of an image (in the case of the\n drawImage(img, x, y, [w, h,] ImageObserver) call).\n\n This method\n should return true if further updates are needed or false if the\n required information has been acquired.  The image which was being\n tracked is passed in using the img argument.  Various constants\n are combined to form the infoflags argument which indicates what\n information about the image is now available.  The interpretation\n of the x, y, width, and height arguments depends on the contents\n of the infoflags argument.\n \n The infoflags argument should be the bitwise inclusive\n OR of the following flags: WIDTH,\n HEIGHT, PROPERTIES, SOMEBITS,\n FRAMEBITS, ALLBITS, ERROR,\n ABORT."}]}