{"name": "Class InetAddress", "module": "java.base", "package": "java.net", "text": "This class represents an Internet Protocol (IP) address.\n\n  An IP address is either a 32-bit or 128-bit unsigned number\n used by IP, a lower-level protocol on which protocols like UDP and\n TCP are built. The IP address architecture is defined by RFC 790:\n Assigned Numbers,  RFC 1918:\n Address Allocation for Private Internets, RFC 2365:\n Administratively Scoped IP Multicast, and RFC 2373: IP\n Version 6 Addressing Architecture. An instance of an\n InetAddress consists of an IP address and possibly its\n corresponding host name (depending on whether it is constructed\n with a host name or whether it has already done reverse host name\n resolution).\n\n  Address types \n\nDescription of unicast and multicast address types\n\nAddress TypeDescription\n\n\nunicast\nAn identifier for a single interface. A packet sent to\n         a unicast address is delivered to the interface identified by\n         that address.\n\n          The Unspecified Address -- Also called anylocal or wildcard\n         address. It must never be assigned to any node. It indicates the\n         absence of an address. One example of its use is as the target of\n         bind, which allows a server to accept a client connection on any\n         interface, in case the server host has multiple interfaces.\n\n          The unspecified address must not be used as\n         the destination address of an IP packet.\n\n          The Loopback Addresses -- This is the address\n         assigned to the loopback interface. Anything sent to this\n         IP address loops around and becomes IP input on the local\n         host. This address is often used when testing a\n         client.\nmulticast\nAn identifier for a set of interfaces (typically belonging\n         to different nodes). A packet sent to a multicast address is\n         delivered to all interfaces identified by that address.\n\n\n IP address scope \n Link-local addresses are designed to be used for addressing\n on a single link for purposes such as auto-address configuration,\n neighbor discovery, or when no routers are present.\n\n  Site-local addresses are designed to be used for addressing\n inside of a site without the need for a global prefix.\n\n  Global addresses are unique across the internet.\n\n  Textual representation of IP addresses \n\n The textual representation of an IP address is address family specific.\n\n \n\n For IPv4 address format, please refer to Inet4Address#format; For IPv6\n address format, please refer to Inet6Address#format.\n\n There is a couple of\n System Properties affecting how IPv4 and IPv6 addresses are used.\n Host Name Resolution \n\n Host name-to-IP address resolution is accomplished through\n the use of a combination of local machine configuration information\n and network naming services such as the Domain Name System (DNS)\n and Network Information Service(NIS). The particular naming\n services(s) being used is by default the local machine configured\n one. For any host name, its corresponding IP address is returned.\n\n  Reverse name resolution means that for any IP address,\n the host associated with the IP address is returned.\n\n  The InetAddress class provides methods to resolve host names to\n their IP addresses and vice versa.\n\n  InetAddress Caching \n\n The InetAddress class has a cache to store successful as well as\n unsuccessful host name resolutions.\n\n  By default, when a security manager is installed, in order to\n protect against DNS spoofing attacks,\n the result of positive host name resolutions are\n cached forever. When a security manager is not installed, the default\n behavior is to cache entries for a finite (implementation dependent)\n period of time. The result of unsuccessful host\n name resolution is cached for a very short period of time (10\n seconds) to improve performance.\n\n  If the default behavior is not desired, then a Java security property\n can be set to a different Time-to-live (TTL) value for positive\n caching. Likewise, a system admin can configure a different\n negative caching TTL value when needed.\n\n  Two Java security properties control the TTL values used for\n  positive and negative host name resolution caching:\n\n \nnetworkaddress.cache.ttl\nIndicates the caching policy for successful name lookups from\n the name service. The value is specified as an integer to indicate\n the number of seconds to cache the successful lookup. The default\n setting is to cache for an implementation specific period of time.\n \n A value of -1 indicates \"cache forever\".\n \nnetworkaddress.cache.negative.ttl (default: 10)\nIndicates the caching policy for un-successful name lookups\n from the name service. The value is specified as an integer to\n indicate the number of seconds to cache the failure for\n un-successful lookups.\n \n A value of 0 indicates \"never cache\".\n A value of -1 indicates \"cache forever\".\n \n", "codes": ["public class InetAddress\nextends Object\nimplements Serializable"], "fields": [], "methods": [{"method_name": "isMulticastAddress", "method_sig": "public boolean isMulticastAddress()", "description": "Utility routine to check if the InetAddress is an\n IP multicast address."}, {"method_name": "isAnyLocalAddress", "method_sig": "public boolean isAnyLocalAddress()", "description": "Utility routine to check if the InetAddress is a wildcard address."}, {"method_name": "isLoopbackAddress", "method_sig": "public boolean isLoopbackAddress()", "description": "Utility routine to check if the InetAddress is a loopback address."}, {"method_name": "isLinkLocalAddress", "method_sig": "public boolean isLinkLocalAddress()", "description": "Utility routine to check if the InetAddress is an link local address."}, {"method_name": "isSiteLocalAddress", "method_sig": "public boolean isSiteLocalAddress()", "description": "Utility routine to check if the InetAddress is a site local address."}, {"method_name": "isMCGlobal", "method_sig": "public boolean isMCGlobal()", "description": "Utility routine to check if the multicast address has global scope."}, {"method_name": "isMCNodeLocal", "method_sig": "public boolean isMCNodeLocal()", "description": "Utility routine to check if the multicast address has node scope."}, {"method_name": "isMCLinkLocal", "method_sig": "public boolean isMCLinkLocal()", "description": "Utility routine to check if the multicast address has link scope."}, {"method_name": "isMCSiteLocal", "method_sig": "public boolean isMCSiteLocal()", "description": "Utility routine to check if the multicast address has site scope."}, {"method_name": "isMCOrgLocal", "method_sig": "public boolean isMCOrgLocal()", "description": "Utility routine to check if the multicast address has organization scope."}, {"method_name": "isReachable", "method_sig": "public boolean isReachable (int timeout)\n                    throws IOException", "description": "Test whether that address is reachable. Best effort is made by the\n implementation to try to reach the host, but firewalls and server\n configuration may block requests resulting in a unreachable status\n while some specific ports may be accessible.\n A typical implementation will use ICMP ECHO REQUESTs if the\n privilege can be obtained, otherwise it will try to establish\n a TCP connection on port 7 (Echo) of the destination host.\n \n The timeout value, in milliseconds, indicates the maximum amount of time\n the try should take. If the operation times out before getting an\n answer, the host is deemed unreachable. A negative value will result\n in an IllegalArgumentException being thrown."}, {"method_name": "isReachable", "method_sig": "public boolean isReachable (NetworkInterface netif,\n                           int ttl,\n                           int timeout)\n                    throws IOException", "description": "Test whether that address is reachable. Best effort is made by the\n implementation to try to reach the host, but firewalls and server\n configuration may block requests resulting in a unreachable status\n while some specific ports may be accessible.\n A typical implementation will use ICMP ECHO REQUESTs if the\n privilege can be obtained, otherwise it will try to establish\n a TCP connection on port 7 (Echo) of the destination host.\n \n The network interface and ttl parameters\n let the caller specify which network interface the test will go through\n and the maximum number of hops the packets should go through.\n A negative value for the ttl will result in an\n IllegalArgumentException being thrown.\n \n The timeout value, in milliseconds, indicates the maximum amount of time\n the try should take. If the operation times out before getting an\n answer, the host is deemed unreachable. A negative value will result\n in an IllegalArgumentException being thrown."}, {"method_name": "getHostName", "method_sig": "public String getHostName()", "description": "Gets the host name for this IP address.\n\n If this InetAddress was created with a host name,\n this host name will be remembered and returned;\n otherwise, a reverse name lookup will be performed\n and the result will be returned based on the system\n configured name lookup service. If a lookup of the name service\n is required, call\n getCanonicalHostName.\n\n If there is a security manager, its\n checkConnect method is first called\n with the hostname and -1\n as its arguments to see if the operation is allowed.\n If the operation is not allowed, it will return\n the textual representation of the IP address."}, {"method_name": "getCanonicalHostName", "method_sig": "public String getCanonicalHostName()", "description": "Gets the fully qualified domain name for this IP address.\n Best effort method, meaning we may not be able to return\n the FQDN depending on the underlying system configuration.\n\n If there is a security manager, this method first\n calls its checkConnect method\n with the hostname and -1\n as its arguments to see if the calling code is allowed to know\n the hostname for this IP address, i.e., to connect to the host.\n If the operation is not allowed, it will return\n the textual representation of the IP address."}, {"method_name": "getAddress", "method_sig": "public byte[] getAddress()", "description": "Returns the raw IP address of this InetAddress\n object. The result is in network byte order: the highest order\n byte of the address is in getAddress()[0]."}, {"method_name": "getHostAddress", "method_sig": "public String getHostAddress()", "description": "Returns the IP address string in textual presentation."}, {"method_name": "hashCode", "method_sig": "public int hashCode()", "description": "Returns a hashcode for this IP address."}, {"method_name": "equals", "method_sig": "public boolean equals (Object obj)", "description": "Compares this object against the specified object.\n The result is true if and only if the argument is\n not null and it represents the same IP address as\n this object.\n \n Two instances of InetAddress represent the same IP\n address if the length of the byte arrays returned by\n getAddress is the same for both, and each of the\n array components is the same for the byte arrays."}, {"method_name": "toString", "method_sig": "public String toString()", "description": "Converts this IP address to a String. The\n string returned is of the form: hostname / literal IP\n address.\n\n If the host name is unresolved, no reverse name service lookup\n is performed. The hostname part will be represented by an empty string."}, {"method_name": "getByAddress", "method_sig": "public static InetAddress getByAddress (String host,\n                                       byte[] addr)\n                                throws UnknownHostException", "description": "Creates an InetAddress based on the provided host name and IP address.\n No name service is checked for the validity of the address.\n\n  The host name can either be a machine name, such as\n \"java.sun.com\", or a textual representation of its IP\n address.\n  No validity checking is done on the host name either.\n\n  If addr specifies an IPv4 address an instance of Inet4Address\n will be returned; otherwise, an instance of Inet6Address\n will be returned.\n\n  IPv4 address byte array must be 4 bytes long and IPv6 byte array\n must be 16 bytes long"}, {"method_name": "getByName", "method_sig": "public static InetAddress getByName (String host)\n                             throws UnknownHostException", "description": "Determines the IP address of a host, given the host's name.\n\n  The host name can either be a machine name, such as\n \"java.sun.com\", or a textual representation of its\n IP address. If a literal IP address is supplied, only the\n validity of the address format is checked.\n\n  For host specified in literal IPv6 address,\n either the form defined in RFC 2732 or the literal IPv6 address\n format defined in RFC 2373 is accepted. IPv6 scoped addresses are also\n supported. See here for a description of IPv6\n scoped addresses.\n\n  If the host is null or host.length() is equal\n to zero, then an InetAddress representing an address of the\n loopback interface is returned.\n See RFC 3330\n section 2 and RFC 2373\n section 2.5.3.\n\n  If there is a security manager, and host is not null\n or host.length()  is not equal to zero, the security manager's\n checkConnect method is called with the hostname and -1\n as its arguments to determine if the operation is allowed."}, {"method_name": "getAllByName", "method_sig": "public static InetAddress[] getAllByName (String host)\n                                  throws UnknownHostException", "description": "Given the name of a host, returns an array of its IP addresses,\n based on the configured name service on the system.\n\n  The host name can either be a machine name, such as\n \"java.sun.com\", or a textual representation of its IP\n address. If a literal IP address is supplied, only the\n validity of the address format is checked.\n\n  For host specified in literal IPv6 address,\n either the form defined in RFC 2732 or the literal IPv6 address\n format defined in RFC 2373 is accepted. A literal IPv6 address may\n also be qualified by appending a scoped zone identifier or scope_id.\n The syntax and usage of scope_ids is described\n here.\n\n  If the host is null or host.length() is equal\n to zero, then an InetAddress representing an address of the\n loopback interface is returned.\n See RFC 3330\n section 2 and RFC 2373\n section 2.5.3. \n If there is a security manager, and host is not null\n or host.length()  is not equal to zero, the security manager's\n checkConnect method is called with the hostname and -1\n as its arguments to determine if the operation is allowed."}, {"method_name": "getLoopbackAddress", "method_sig": "public static InetAddress getLoopbackAddress()", "description": "Returns the loopback address.\n \n The InetAddress returned will represent the IPv4\n loopback address, 127.0.0.1, or the IPv6 loopback\n address, ::1. The IPv4 loopback address returned\n is only one of many in the form 127.*.*.*"}, {"method_name": "getByAddress", "method_sig": "public static InetAddress getByAddress (byte[] addr)\n                                throws UnknownHostException", "description": "Returns an InetAddress object given the raw IP address .\n The argument is in network byte order: the highest order\n byte of the address is in getAddress()[0].\n\n  This method doesn't block, i.e. no reverse name service lookup\n is performed.\n\n  IPv4 address byte array must be 4 bytes long and IPv6 byte array\n must be 16 bytes long"}, {"method_name": "getLocalHost", "method_sig": "public static InetAddress getLocalHost()\n                                throws UnknownHostException", "description": "Returns the address of the local host. This is achieved by retrieving\n the name of the host from the system, then resolving that name into\n an InetAddress.\n\n Note: The resolved address may be cached for a short period of time.\n \nIf there is a security manager, its\n checkConnect method is called\n with the local host name and -1\n as its arguments to see if the operation is allowed.\n If the operation is not allowed, an InetAddress representing\n the loopback address is returned."}]}