{"name": "Class InetSocketAddress", "module": "java.base", "package": "java.net", "text": "This class implements an IP Socket Address (IP address + port number)\n It can also be a pair (hostname + port number), in which case an attempt\n will be made to resolve the hostname. If resolution fails then the address\n is said to be unresolved but can still be used on some circumstances\n like connecting through a proxy.\n \n It provides an immutable object used by sockets for binding, connecting, or\n as returned values.\n \n The wildcard is a special local IP address. It usually means \"any\"\n and can only be used for bind operations.", "codes": ["public class InetSocketAddress\nextends SocketAddress"], "fields": [], "methods": [{"method_name": "createUnresolved", "method_sig": "public static InetSocketAddress createUnresolved (String host,\n                                                 int port)", "description": "Creates an unresolved socket address from a hostname and a port number.\n \n No attempt will be made to resolve the hostname into an InetAddress.\n The address will be flagged as unresolved.\n \n A valid port value is between 0 and 65535.\n A port number of zero will let the system pick up an\n ephemeral port in a bind operation."}, {"method_name": "getPort", "method_sig": "public final int getPort()", "description": "Gets the port number."}, {"method_name": "getAddress", "method_sig": "public final InetAddress getAddress()", "description": "Gets the InetAddress."}, {"method_name": "getHostName", "method_sig": "public final String getHostName()", "description": "Gets the hostname.\n Note: This method may trigger a name service reverse lookup if the\n address was created with a literal IP address."}, {"method_name": "getHostString", "method_sig": "public final String getHostString()", "description": "Returns the hostname, or the String form of the address if it\n doesn't have a hostname (it was created using a literal).\n This has the benefit of not attempting a reverse lookup."}, {"method_name": "isUnresolved", "method_sig": "public final boolean isUnresolved()", "description": "Checks whether the address has been resolved or not."}, {"method_name": "toString", "method_sig": "public String toString()", "description": "Constructs a string representation of this InetSocketAddress.\n This String is constructed by calling toString() on the InetAddress\n and concatenating the port number (with a colon). If the address\n is unresolved then the part before the colon will only contain the hostname."}, {"method_name": "equals", "method_sig": "public final boolean equals (Object obj)", "description": "Compares this object against the specified object.\n The result is true if and only if the argument is\n not null and it represents the same address as\n this object.\n \n Two instances of InetSocketAddress represent the same\n address if both the InetAddresses (or hostnames if it is unresolved) and port\n numbers are equal.\n If both addresses are unresolved, then the hostname and the port number\n are compared.\n\n Note: Hostnames are case insensitive. e.g. \"FooBar\" and \"foobar\" are\n considered equal."}, {"method_name": "hashCode", "method_sig": "public final int hashCode()", "description": "Returns a hashcode for this socket address."}]}