{"name": "Class InitialLdapContext", "module": "java.naming", "package": "javax.naming.ldap", "text": "This class is the starting context for performing\n LDAPv3-style extended operations and controls.\n\n See javax.naming.InitialContext and\n javax.naming.InitialDirContext for details on synchronization,\n and the policy for how an initial context is created.\n\n Request Controls\n When you create an initial context (InitialLdapContext),\n you can specify a list of request controls.\n These controls will be used as the request controls for any\n implicit LDAP \"bind\" operation performed by the context or contexts\n derived from the context. These are called connection request controls.\n Use getConnectControls() to get a context's connection request\n controls.\n\n The request controls supplied to the initial context constructor\n are not used as the context request controls\n for subsequent context operations such as searches and lookups.\n Context request controls are set and updated by using\n setRequestControls().\n\n As shown, there can be two different sets of request controls\n associated with a context: connection request controls and context\n request controls.\n This is required for those applications needing to send critical\n controls that might not be applicable to both the context operation and\n any implicit LDAP \"bind\" operation.\n A typical user program would do the following:\n\n InitialLdapContext lctx = new InitialLdapContext(env, critConnCtls);\n lctx.setRequestControls(critModCtls);\n lctx.modifyAttributes(name, mods);\n Controls[] respCtls =  lctx.getResponseControls();\n\n It specifies first the critical controls for creating the initial context\n (critConnCtls), and then sets the context's request controls\n (critModCtls) for the context operation. If for some reason\n lctx needs to reconnect to the server, it will use\n critConnCtls. See the LdapContext interface for\n more discussion about request controls.\n\n Service provider implementors should read the \"Service Provider\" section\n in the LdapContext class description for implementation details.", "codes": ["public class InitialLdapContext\nextends InitialDirContext\nimplements LdapContext"], "fields": [], "methods": []}