{"name": "Class InputContext", "module": "java.desktop", "package": "java.awt.im", "text": "Provides methods to control text input facilities such as input\n methods and keyboard layouts.\n Two methods handle both input methods and keyboard layouts: selectInputMethod\n lets a client component select an input method or keyboard layout by locale,\n getLocale lets a client component obtain the locale of the current input method\n or keyboard layout.\n The other methods more specifically support interaction with input methods:\n They let client components control the behavior of input methods, and\n dispatch events from the client component to the input method.\n\n \n By default, one InputContext instance is created per Window instance,\n and this input context is shared by all components within the window's\n container hierarchy. However, this means that only one text input\n operation is possible at any one time within a window, and that the\n text needs to be committed when moving the focus from one text component\n to another. If this is not desired, text components can create their\n own input context instances.\n\n \n The Java Platform supports input methods that have been developed in the Java\n programming language, using the interfaces in the java.awt.im.spi package,\n which can be made available by adding them to the application's class path.\n Implementations may also support using the native input methods of the platforms they run on;\n however, not all platforms and locales provide input methods. Keyboard layouts\n are provided by the host platform.\n\n \n Input methods are unavailable if (a) no input method written\n in the Java programming language has been installed and (b) the Java Platform implementation\n or the underlying platform does not support native input methods. In this case,\n input contexts can still be created and used; their behavior is specified with\n the individual methods below.", "codes": ["public class InputContext\nextends Object"], "fields": [], "methods": [{"method_name": "getInstance", "method_sig": "public static InputContext getInstance()", "description": "Returns a new InputContext instance."}, {"method_name": "selectInputMethod", "method_sig": "public boolean selectInputMethod (Locale locale)", "description": "Attempts to select an input method or keyboard layout that\n supports the given locale, and returns a value indicating whether such\n an input method or keyboard layout has been successfully selected. The\n following steps are taken until an input method has been selected:\n\n \n\n If the currently selected input method or keyboard layout supports the\n requested locale, it remains selected.\n\n If there is no input method or keyboard layout available that supports\n the requested locale, the current input method or keyboard layout remains\n selected.\n\n If the user has previously selected an input method or keyboard layout\n for the requested locale from the user interface, then the most recently\n selected such input method or keyboard layout is reselected.\n\n Otherwise, an input method or keyboard layout that supports the requested\n locale is selected in an implementation dependent way.\n\n Before switching away from an input method, any currently uncommitted text\n is committed. If no input method or keyboard layout supporting the requested\n locale is available, then false is returned.\n\n \n Not all host operating systems provide API to determine the locale of\n the currently selected native input method or keyboard layout, and to\n select a native input method or keyboard layout by locale.\n For host operating systems that don't provide such API,\n selectInputMethod assumes that native input methods or\n keyboard layouts provided by the host operating system support only the\n system's default locale.\n\n \n A text editing component may call this method, for example, when\n the user changes the insertion point, so that the user can\n immediately continue typing in the language of the surrounding text."}, {"method_name": "getLocale", "method_sig": "public Locale getLocale()", "description": "Returns the current locale of the current input method or keyboard\n layout.\n Returns null if the input context does not have a current input method\n or keyboard layout or if the current input method's\n InputMethod.getLocale() method returns null.\n\n \n Not all host operating systems provide API to determine the locale of\n the currently selected native input method or keyboard layout.\n For host operating systems that don't provide such API,\n getLocale assumes that the current locale of all native\n input methods or keyboard layouts provided by the host operating system\n is the system's default locale."}, {"method_name": "setCharacterSubsets", "method_sig": "public void setCharacterSubsets (Character.Subset[] subsets)", "description": "Sets the subsets of the Unicode character set that input methods of this input\n context should be allowed to input. Null may be passed in to\n indicate that all characters are allowed. The initial value\n is null. The setting applies to the current input method as well\n as input methods selected after this call is made. However,\n applications cannot rely on this call having the desired effect,\n since this setting cannot be passed on to all host input methods -\n applications still need to apply their own character validation.\n If no input methods are available, then this method has no effect."}, {"method_name": "setCompositionEnabled", "method_sig": "public void setCompositionEnabled (boolean enable)", "description": "Enables or disables the current input method for composition,\n depending on the value of the parameter enable.\n \n An input method that is enabled for composition interprets incoming\n events for both composition and control purposes, while a\n disabled input method does not interpret events for composition.\n Note however that events are passed on to the input method regardless\n whether it is enabled or not, and that an input method that is disabled\n for composition may still interpret events for control purposes,\n including to enable or disable itself for composition.\n \n For input methods provided by host operating systems, it is not always possible to\n determine whether this operation is supported. For example, an input method may enable\n composition only for some locales, and do nothing for other locales. For such input\n methods, it is possible that this method does not throw\n UnsupportedOperationException,\n but also does not affect whether composition is enabled."}, {"method_name": "isCompositionEnabled", "method_sig": "public boolean isCompositionEnabled()", "description": "Determines whether the current input method is enabled for composition.\n An input method that is enabled for composition interprets incoming\n events for both composition and control purposes, while a\n disabled input method does not interpret events for composition."}, {"method_name": "reconvert", "method_sig": "public void reconvert()", "description": "Asks the current input method to reconvert text from the\n current client component. The input method obtains the text to\n be reconverted from the client component using the\n InputMethodRequests.getSelectedText\n method. The other InputMethodRequests methods\n must be prepared to deal with further information requests by\n the input method. The composed and/or committed text will be\n sent to the client component as a sequence of\n InputMethodEvents. If the input method cannot\n reconvert the given text, the text is returned as committed\n text in an InputMethodEvent."}, {"method_name": "dispatchEvent", "method_sig": "public void dispatchEvent (AWTEvent event)", "description": "Dispatches an event to the active input method. Called by AWT.\n If no input method is available, then the event will never be consumed."}, {"method_name": "removeNotify", "method_sig": "public void removeNotify (Component client)", "description": "Notifies the input context that a client component has been\n removed from its containment hierarchy, or that input method\n support has been disabled for the component. This method is\n usually called from the client component's\n Component.removeNotify\n method. Potentially pending input from input methods\n for this component is discarded.\n If no input methods are available, then this method has no effect."}, {"method_name": "endComposition", "method_sig": "public void endComposition()", "description": "Ends any input composition that may currently be going on in this\n context. Depending on the platform and possibly user preferences,\n this may commit or delete uncommitted text. Any changes to the text\n are communicated to the active component using an input method event.\n If no input methods are available, then this method has no effect.\n\n \n A text editing component may call this in a variety of situations,\n for example, when the user moves the insertion point within the text\n (but outside the composed text), or when the component's text is\n saved to a file or copied to the clipboard."}, {"method_name": "dispose", "method_sig": "public void dispose()", "description": "Releases the resources used by this input context.\n Called by AWT for the default input context of each Window.\n If no input methods are available, then this method\n has no effect."}, {"method_name": "getInputMethodControlObject", "method_sig": "public Object getInputMethodControlObject()", "description": "Returns a control object from the current input method, or null. A\n control object provides methods that control the behavior of the\n input method or obtain information from the input method. The type\n of the object is an input method specific class. Clients have to\n compare the result against known input method control object\n classes and cast to the appropriate class to invoke the methods\n provided.\n \n If no input methods are available or the current input method does\n not provide an input method control object, then null is returned."}]}