{"name": "Class InputSource", "module": "java.xml", "package": "org.xml.sax", "text": "A single input source for an XML entity.\n\n \nThis module, both source code and documentation, is in the\n Public Domain, and comes with NO WARRANTY.\n See http://www.saxproject.org\n for further information.\n \nThis class allows a SAX application to encapsulate information\n about an input source in a single object, which may include\n a public identifier, a system identifier, a byte stream (possibly\n with a specified encoding), and/or a character stream.\nThere are two places that the application can deliver an\n input source to the parser: as the argument to the Parser.parse\n method, or as the return value of the EntityResolver.resolveEntity\n method.\nThe SAX parser will use the InputSource object to determine how\n to read XML input.  If there is a character stream available, the\n parser will read that stream directly, disregarding any text\n encoding declaration found in that stream.\n If there is no character stream, but there is\n a byte stream, the parser will use that byte stream, using the\n encoding specified in the InputSource or else (if no encoding is\n specified) autodetecting the character encoding using an algorithm\n such as the one in the XML specification.  If neither a character\n stream nor a\n byte stream is available, the parser will attempt to open a URI\n connection to the resource identified by the system\n identifier.\nAn InputSource object belongs to the application: the SAX parser\n shall never modify it in any way (it may modify a copy if\n necessary).  However, standard processing of both byte and\n character streams is to close them on as part of end-of-parse cleanup,\n so applications should not attempt to re-use such streams after they\n have been handed to a parser.  ", "codes": ["public class InputSource\nextends Object"], "fields": [], "methods": [{"method_name": "setPublicId", "method_sig": "public void setPublicId (String publicId)", "description": "Set the public identifier for this input source.\n\n The public identifier is always optional: if the application\n writer includes one, it will be provided as part of the\n location information."}, {"method_name": "getPublicId", "method_sig": "public String getPublicId()", "description": "Get the public identifier for this input source."}, {"method_name": "setSystemId", "method_sig": "public void setSystemId (String systemId)", "description": "Set the system identifier for this input source.\n\n The system identifier is optional if there is a byte stream\n or a character stream, but it is still useful to provide one,\n since the application can use it to resolve relative URIs\n and can include it in error messages and warnings (the parser\n will attempt to open a connection to the URI only if\n there is no byte stream or character stream specified).\nIf the application knows the character encoding of the\n object pointed to by the system identifier, it can register\n the encoding using the setEncoding method.\nIf the system identifier is a URL, it must be fully\n resolved (it may not be a relative URL)."}, {"method_name": "getSystemId", "method_sig": "public String getSystemId()", "description": "Get the system identifier for this input source.\n\n The getEncoding method will return the character encoding\n of the object pointed to, or null if unknown.\nIf the system ID is a URL, it will be fully resolved."}, {"method_name": "setByteStream", "method_sig": "public void setByteStream (InputStream byteStream)", "description": "Set the byte stream for this input source.\n\n The SAX parser will ignore this if there is also a character\n stream specified, but it will use a byte stream in preference\n to opening a URI connection itself.\nIf the application knows the character encoding of the\n byte stream, it should set it with the setEncoding method."}, {"method_name": "getByteStream", "method_sig": "public InputStream getByteStream()", "description": "Get the byte stream for this input source.\n\n The getEncoding method will return the character\n encoding for this byte stream, or null if unknown."}, {"method_name": "setEncoding", "method_sig": "public void setEncoding (String encoding)", "description": "Set the character encoding, if known.\n\n The encoding must be a string acceptable for an\n XML encoding declaration (see section 4.3.3 of the XML 1.0\n recommendation).\nThis method has no effect when the application provides a\n character stream."}, {"method_name": "getEncoding", "method_sig": "public String getEncoding()", "description": "Get the character encoding for a byte stream or URI.\n This value will be ignored when the application provides a\n character stream."}, {"method_name": "setCharacterStream", "method_sig": "public void setCharacterStream (Reader characterStream)", "description": "Set the character stream for this input source.\n\n If there is a character stream specified, the SAX parser\n will ignore any byte stream and will not attempt to open\n a URI connection to the system identifier."}, {"method_name": "getCharacterStream", "method_sig": "public Reader getCharacterStream()", "description": "Get the character stream for this input source."}, {"method_name": "isEmpty", "method_sig": "public boolean isEmpty()", "description": "Indicates whether the InputSource object is empty. Empty is\n defined as follows:\n \nAll of the input sources, including the public identifier, system\n identifier, byte stream, and character stream, are null.\n \nThe public identifier and system identifier are  null, and\n byte and character stream are either  null or contain no byte\n or character.\n \n Note that this method will reset the byte stream if it is provided, or\n the character stream if the byte stream is not provided.\n \n\n\n In case of error while checking the byte or character stream, the method\n will return false to allow the XML processor to handle the error."}]}