{"name": "Class JEditorPane", "module": "java.desktop", "package": "javax.swing", "text": "A text component to edit various kinds of content.\n You can find how-to information and examples of using editor panes in\n Using Text Components,\n a section in The Java Tutorial.\n\n This component uses implementations of the\n EditorKit to accomplish its behavior. It effectively\n morphs into the proper kind of text editor for the kind\n of content it is given.  The content type that editor is bound\n to at any given time is determined by the EditorKit currently\n installed.  If the content is set to a new URL, its type is used\n to determine the EditorKit that should be used to\n load the content.\n \n By default, the following types of content are known:\n \ntext/plain\nPlain text, which is the default the type given isn't\n recognized.  The kit used in this case is an extension of\n DefaultEditorKit that produces a wrapped plain text view.\n text/html\nHTML text.  The kit used in this case is the class\n javax.swing.text.html.HTMLEditorKit\n which provides HTML 3.2 support.\n text/rtf\nRTF text.  The kit used in this case is the class\n javax.swing.text.rtf.RTFEditorKit\n which provides a limited support of the Rich Text Format.\n \n\n There are several ways to load content into this component.\n \n\n The setText method can be used to initialize\n the component from a string.  In this case the current\n EditorKit will be used, and the content type will be\n expected to be of this type.\n \n The read method can be used to initialize the\n component from a Reader.  Note that if the content type is HTML,\n relative references (e.g. for things like images) can't be resolved\n unless the <base> tag is used or the Base property\n on HTMLDocument is set.\n In this case the current EditorKit will be used,\n and the content type will be expected to be of this type.\n \n The setPage method can be used to initialize\n the component from a URL.  In this case, the content type will be\n determined from the URL, and the registered EditorKit\n for that content type will be set.\n \n\n Some kinds of content may provide hyperlink support by generating\n hyperlink events.  The HTML EditorKit will generate\n hyperlink events if the JEditorPane is not editable\n (JEditorPane.setEditable(false); has been called).\n If HTML frames are embedded in the document, the typical response would be\n to change a portion of the current document.  The following code\n fragment is a possible hyperlink listener implementation, that treats\n HTML frame events specially, and simply displays any other activated\n hyperlinks.\n \n\n     class Hyperactive implements HyperlinkListener {\n \n         public void hyperlinkUpdate(HyperlinkEvent e) {\n             if (e.getEventType() == HyperlinkEvent.EventType.ACTIVATED) {\n                 JEditorPane pane = (JEditorPane) e.getSource();\n                 if (e instanceof HTMLFrameHyperlinkEvent) {\n                     HTMLFrameHyperlinkEvent  evt = (HTMLFrameHyperlinkEvent)e;\n                     HTMLDocument doc = (HTMLDocument)pane.getDocument();\n                     doc.processHTMLFrameHyperlinkEvent(evt);\n                 } else {\n                     try {\n                         pane.setPage(e.getURL());\n                     } catch (Throwable t) {\n                         t.printStackTrace();\n                     }\n                 }\n             }\n         }\n     }\n\n \n\n For information on customizing how text/html is rendered please see\n W3C_LENGTH_UNITS and HONOR_DISPLAY_PROPERTIES\n\n Culturally dependent information in some documents is handled through\n a mechanism called character encoding.  Character encoding is an\n unambiguous mapping of the members of a character set (letters, ideographs,\n digits, symbols, or control functions) to specific numeric code values. It\n represents the way the file is stored. Example character encodings are\n ISO-8859-1, ISO-8859-5, Shift-jis, Euc-jp, and UTF-8. When the file is\n passed to an user agent (JEditorPane) it is converted to\n the document character set (ISO-10646 aka Unicode).\n \n There are multiple ways to get a character set mapping to happen\n with JEditorPane.\n \n\n One way is to specify the character set as a parameter of the MIME\n type.  This will be established by a call to the\n setContentType method.  If the content\n is loaded by the setPage method the content\n type will have been set according to the specification of the URL.\n It the file is loaded directly, the content type would be expected to\n have been set prior to loading.\n \n Another way the character set can be specified is in the document itself.\n This requires reading the document prior to determining the character set\n that is desired.  To handle this, it is expected that the\n EditorKit.read operation throw a\n ChangedCharSetException which will\n be caught.  The read is then restarted with a new Reader that uses\n the character set specified in the ChangedCharSetException\n (which is an IOException).\n \n\nNewlines\n\n For a discussion on how newlines are handled, see\n DefaultEditorKit.\n \n\nWarning: Swing is not thread safe. For more\n information see Swing's Threading\n Policy.\n \nWarning:\n Serialized objects of this class will not be compatible with\n future Swing releases. The current serialization support is\n appropriate for short term storage or RMI between applications running\n the same version of Swing.  As of 1.4, support for long term storage\n of all JavaBeans™\n has been added to the java.beans package.\n Please see XMLEncoder.", "codes": ["@JavaBean(defaultProperty=\"UIClassID\",\n          description=\"A text component to edit various types of content.\")\npublic class JEditorPane\nextends JTextComponent"], "fields": [{"field_name": "W3C_LENGTH_UNITS", "field_sig": "public static final String W3C_LENGTH_UNITS", "description": "Key for a client property used to indicate whether\n \n w3c compliant length units are used for html rendering.\n \n By default this is not enabled; to enable\n it set the client property with this name\n to Boolean.TRUE."}, {"field_name": "HONOR_DISPLAY_PROPERTIES", "field_sig": "public static final String HONOR_DISPLAY_PROPERTIES", "description": "Key for a client property used to indicate whether\n the default font and foreground color from the component are\n used if a font or foreground color is not specified in the styled\n text.\n \n The default varies based on the look and feel;\n to enable it set the client property with\n this name to Boolean.TRUE."}], "methods": [{"method_name": "addHyperlinkListener", "method_sig": "public void addHyperlinkListener (HyperlinkListener listener)", "description": "Adds a hyperlink listener for notification of any changes, for example\n when a link is selected and entered."}, {"method_name": "removeHyperlinkListener", "method_sig": "public void removeHyperlinkListener (HyperlinkListener listener)", "description": "Removes a hyperlink listener."}, {"method_name": "getHyperlinkListeners", "method_sig": "@BeanProperty(bound=false)\npublic HyperlinkListener[] getHyperlinkListeners()", "description": "Returns an array of all the HyperLinkListeners added\n to this JEditorPane with addHyperlinkListener()."}, {"method_name": "fireHyperlinkUpdate", "method_sig": "public void fireHyperlinkUpdate (HyperlinkEvent e)", "description": "Notifies all listeners that have registered interest for\n notification on this event type.  This is normally called\n by the currently installed EditorKit if a content type\n that supports hyperlinks is currently active and there\n was activity with a link.  The listener list is processed\n last to first."}, {"method_name": "setPage", "method_sig": "@BeanProperty(expert=true,\n              description=\"the URL used to set content\")\npublic void setPage (URL page)\n             throws IOException", "description": "Sets the current URL being displayed.  The content type of the\n pane is set, and if the editor kit for the pane is\n non-null, then\n a new default document is created and the URL is read into it.\n If the URL contains and reference location, the location will\n be scrolled to by calling the scrollToReference\n method. If the desired URL is the one currently being displayed,\n the document will not be reloaded. To force a document\n reload it is necessary to clear the stream description property\n of the document. The following code shows how this can be done:\n\n \n   Document doc = jEditorPane.getDocument();\n   doc.putProperty(Document.StreamDescriptionProperty, null);\n \n\n If the desired URL is not the one currently being\n displayed, the getStream method is called to\n give subclasses control over the stream provided.\n \n This may load either synchronously or asynchronously\n depending upon the document returned by the EditorKit.\n If the Document is of type\n AbstractDocument and has a value returned by\n AbstractDocument.getAsynchronousLoadPriority\n that is greater than or equal to zero, the page will be\n loaded on a separate thread using that priority.\n \n If the document is loaded synchronously, it will be\n filled in with the stream prior to being installed into\n the editor with a call to setDocument, which\n is bound and will fire a property change event.  If an\n IOException is thrown the partially loaded\n document will\n be discarded and neither the document or page property\n change events will be fired.  If the document is\n successfully loaded and installed, a view will be\n built for it by the UI which will then be scrolled if\n necessary, and then the page property change event\n will be fired.\n \n If the document is loaded asynchronously, the document\n will be installed into the editor immediately using a\n call to setDocument which will fire a\n document property change event, then a thread will be\n created which will begin doing the actual loading.\n In this case, the page property change event will not be\n fired by the call to this method directly, but rather will be\n fired when the thread doing the loading has finished.\n It will also be fired on the event-dispatch thread.\n Since the calling thread can not throw an IOException\n in the event of failure on the other thread, the page\n property change event will be fired when the other\n thread is done whether the load was successful or not."}, {"method_name": "read", "method_sig": "public void read (InputStream in,\n                 Object desc)\n          throws IOException", "description": "This method initializes from a stream.  If the kit is\n set to be of type HTMLEditorKit, and the\n desc parameter is an HTMLDocument,\n then it invokes the HTMLEditorKit to initiate\n the read. Otherwise it calls the superclass\n method which loads the model as plain text."}, {"method_name": "getStream", "method_sig": "protected InputStream getStream (URL page)\n                         throws IOException", "description": "Fetches a stream for the given URL, which is about to\n be loaded by the setPage method.  By\n default, this simply opens the URL and returns the\n stream.  This can be reimplemented to do useful things\n like fetch the stream from a cache, monitor the progress\n of the stream, etc.\n \n This method is expected to have the side effect of\n establishing the content type, and therefore setting the\n appropriate EditorKit to use for loading the stream.\n \n If this the stream was an http connection, redirects\n will be followed and the resulting URL will be set as\n the Document.StreamDescriptionProperty so that relative\n URL's can be properly resolved."}, {"method_name": "scrollToReference", "method_sig": "public void scrollToReference (String reference)", "description": "Scrolls the view to the given reference location\n (that is, the value returned by the URL.getRef\n method for the URL being displayed).  By default, this\n method only knows how to locate a reference in an\n HTMLDocument.  The implementation calls the\n scrollRectToVisible method to\n accomplish the actual scrolling.  If scrolling to a\n reference location is needed for document types other\n than HTML, this method should be reimplemented.\n This method will have no effect if the component\n is not visible."}, {"method_name": "getPage", "method_sig": "public URL getPage()", "description": "Gets the current URL being displayed.  If a URL was\n not specified in the creation of the document, this\n will return null, and relative URL's will not be\n resolved."}, {"method_name": "setPage", "method_sig": "public void setPage (String url)\n             throws IOException", "description": "Sets the current URL being displayed."}, {"method_name": "getUIClassID", "method_sig": "@BeanProperty(bound=false)\npublic String getUIClassID()", "description": "Gets the class ID for the UI."}, {"method_name": "createDefaultEditorKit", "method_sig": "protected EditorKit createDefaultEditorKit()", "description": "Creates the default editor kit (PlainEditorKit) for when\n the component is first created."}, {"method_name": "getEditorKit", "method_sig": "public EditorKit getEditorKit()", "description": "Fetches the currently installed kit for handling content.\n createDefaultEditorKit is called to set up a default\n if necessary."}, {"method_name": "getContentType", "method_sig": "public final String getContentType()", "description": "Gets the type of content that this editor\n is currently set to deal with.  This is\n defined to be the type associated with the\n currently installed EditorKit."}, {"method_name": "setContentType", "method_sig": "@BeanProperty(bound=false,\n              description=\"the type of content\")\npublic final void setContentType (String type)", "description": "Sets the type of content that this editor\n handles.  This calls getEditorKitForContentType,\n and then setEditorKit if an editor kit can\n be successfully located.  This is mostly convenience method\n that can be used as an alternative to calling\n setEditorKit directly.\n \n If there is a charset definition specified as a parameter\n of the content type specification, it will be used when\n loading input streams using the associated EditorKit.\n For example if the type is specified as\n text/html; charset=EUC-JP the content\n will be loaded using the EditorKit registered for\n text/html and the Reader provided to\n the EditorKit to load unicode into the document will\n use the EUC-JP charset for translating\n to unicode.  If the type is not recognized, the content\n will be loaded using the EditorKit registered\n for plain text, text/plain."}, {"method_name": "setEditorKit", "method_sig": "@BeanProperty(expert=true,\n              description=\"the currently installed kit for handling content\")\npublic void setEditorKit (EditorKit kit)", "description": "Sets the currently installed kit for handling\n content.  This is the bound property that\n establishes the content type of the editor.\n Any old kit is first deinstalled, then if kit is\n non-null,\n the new kit is installed, and a default document created for it.\n A PropertyChange event (\"editorKit\") is always fired when\n setEditorKit is called.\n \nNOTE: This has the side effect of changing the model,\n because the EditorKit is the source of how a\n particular type\n of content is modeled.  This method will cause setDocument\n to be called on behalf of the caller to ensure integrity\n of the internal state."}, {"method_name": "getEditorKitForContentType", "method_sig": "public EditorKit getEditorKitForContentType (String type)", "description": "Fetches the editor kit to use for the given type\n of content.  This is called when a type is requested\n that doesn't match the currently installed type.\n If the component doesn't have an EditorKit registered\n for the given type, it will try to create an\n EditorKit from the default EditorKit registry.\n If that fails, a PlainEditorKit is used on the\n assumption that all text documents can be represented\n as plain text.\n \n This method can be reimplemented to use some\n other kind of type registry.  This can\n be reimplemented to use the Java Activation\n Framework, for example."}, {"method_name": "setEditorKitForContentType", "method_sig": "public void setEditorKitForContentType (String type,\n                                       EditorKit k)", "description": "Directly sets the editor kit to use for the given type.  A\n look-and-feel implementation might use this in conjunction\n with createEditorKitForContentType to install handlers for\n content types with a look-and-feel bias."}, {"method_name": "replaceSelection", "method_sig": "public void replaceSelection (String content)", "description": "Replaces the currently selected content with new content\n represented by the given string.  If there is no selection\n this amounts to an insert of the given text.  If there\n is no replacement text (i.e. the content string is empty\n or null) this amounts to a removal of the\n current selection.  The replacement text will have the\n attributes currently defined for input.  If the component is not\n editable, beep and return."}, {"method_name": "createEditorKitForContentType", "method_sig": "public static EditorKit createEditorKitForContentType (String type)", "description": "Creates a handler for the given type from the default registry\n of editor kits.  The registry is created if necessary.  If the\n registered class has not yet been loaded, an attempt\n is made to dynamically load the prototype of the kit for the\n given type.  If the type was registered with a ClassLoader,\n that ClassLoader will be used to load the prototype.\n If there was no registered ClassLoader,\n Class.forName will be used to load the prototype.\n \n Once a prototype EditorKit instance is successfully\n located, it is cloned and the clone is returned."}, {"method_name": "registerEditorKitForContentType", "method_sig": "public static void registerEditorKitForContentType (String type,\n                                                   String classname)", "description": "Establishes the default bindings of type to\n classname.\n The class will be dynamically loaded later when actually\n needed, and can be safely changed before attempted uses\n to avoid loading unwanted classes.  The prototype\n EditorKit will be loaded with Class.forName\n when registered with this method."}, {"method_name": "registerEditorKitForContentType", "method_sig": "public static void registerEditorKitForContentType (String type,\n                                                   String classname,\n                                                   ClassLoader loader)", "description": "Establishes the default bindings of type to\n classname.\n The class will be dynamically loaded later when actually\n needed using the given ClassLoader,\n and can be safely changed\n before attempted uses to avoid loading unwanted classes."}, {"method_name": "getEditorKitClassNameForContentType", "method_sig": "public static String getEditorKitClassNameForContentType (String type)", "description": "Returns the currently registered EditorKit class name for the\n type type."}, {"method_name": "getPreferredSize", "method_sig": "public Dimension getPreferredSize()", "description": "Returns the preferred size for the JEditorPane.\n The preferred size for JEditorPane is slightly altered\n from the preferred size of the superclass.  If the size\n of the viewport has become smaller than the minimum size\n of the component, the scrollable definition for tracking\n width or height will turn to false.  The default viewport\n layout will give the preferred size, and that is not desired\n in the case where the scrollable is tracking.  In that case\n the normal preferred size is adjusted to the\n minimum size.  This allows things like HTML tables to\n shrink down to their minimum size and then be laid out at\n their minimum size, refusing to shrink any further."}, {"method_name": "setText", "method_sig": "@BeanProperty(bound=false,\n              description=\"the text of this component\")\npublic void setText (String t)", "description": "Sets the text of this TextComponent to the specified\n content,\n which is expected to be in the format of the content type of\n this editor.  For example, if the type is set to text/html\n the string should be specified in terms of HTML.\n \n This is implemented to remove the contents of the current document,\n and replace them by parsing the given string using the current\n EditorKit.  This gives the semantics of the\n superclass by not changing\n out the model, while supporting the content type currently set on\n this component.  The assumption is that the previous content is\n relatively\n small, and that the previous content doesn't have side effects.\n Both of those assumptions can be violated and cause undesirable results.\n To avoid this, create a new document,\n getEditorKit().createDefaultDocument(), and replace the\n existing Document with the new one. You are then assured the\n previous Document won't have any lingering state.\n \n\n Leaving the existing model in place means that the old view will be\n torn down, and a new view created, where replacing the document would\n avoid the tear down of the old view.\n \n Some formats (such as HTML) can install things into the document that\n can influence future contents.  HTML can have style information embedded\n that would influence the next content installed unexpectedly.\n \n\n An alternative way to load this component with a string would be to\n create a StringReader and call the read method.  In this case the model\n would be replaced after it was initialized with the contents of the\n string."}, {"method_name": "getText", "method_sig": "public String getText()", "description": "Returns the text contained in this TextComponent\n in terms of the\n content type of this editor.  If an exception is thrown while\n attempting to retrieve the text, null will be returned.\n This is implemented to call JTextComponent.write with\n a StringWriter."}, {"method_name": "getScrollableTracksViewportWidth", "method_sig": "@BeanProperty(bound=false)\npublic boolean getScrollableTracksViewportWidth()", "description": "Returns true if a viewport should always force the width of this\n Scrollable to match the width of the viewport."}, {"method_name": "getScrollableTracksViewportHeight", "method_sig": "@BeanProperty(bound=false)\npublic boolean getScrollableTracksViewportHeight()", "description": "Returns true if a viewport should always force the height of this\n Scrollable to match the height of the viewport."}, {"method_name": "paramString", "method_sig": "protected String paramString()", "description": "Returns a string representation of this JEditorPane.\n This method\n is intended to be used only for debugging purposes, and the\n content and format of the returned string may vary between\n implementations. The returned string may be empty but may not\n be null."}, {"method_name": "getAccessibleContext", "method_sig": "@BeanProperty(bound=false)\npublic AccessibleContext getAccessibleContext()", "description": "Gets the AccessibleContext associated with this JEditorPane.\n For editor panes, the AccessibleContext takes the form of an\n AccessibleJEditorPane.\n A new AccessibleJEditorPane instance is created if necessary."}]}