{"name": "Interface JMXConnectorServerMBean", "module": "java.management", "package": "javax.management.remote", "text": "MBean interface for connector servers.  A JMX API connector server\n is attached to an MBean server, and establishes connections to that\n MBean server for remote clients.\nA newly-created connector server is inactive, and does\n not yet listen for connections.  Only when its start\n method has been called does it start listening for connections.", "codes": ["public interface JMXConnectorServerMBean"], "fields": [], "methods": [{"method_name": "start", "method_sig": "void start()\n    throws IOException", "description": "Activates the connector server, that is, starts listening for\n client connections.  Calling this method when the connector\n server is already active has no effect.  Calling this method\n when the connector server has been stopped will generate an\n IOException."}, {"method_name": "stop", "method_sig": "void stop()\n   throws IOException", "description": "Deactivates the connector server, that is, stops listening for\n client connections.  Calling this method will also close all\n client connections that were made by this server.  After this\n method returns, whether normally or with an exception, the\n connector server will not create any new client\n connections.\nOnce a connector server has been stopped, it cannot be started\n again.\nCalling this method when the connector server has already\n been stopped has no effect.  Calling this method when the\n connector server has not yet been started will disable the\n connector server object permanently.\nIf closing a client connection produces an exception, that\n exception is not thrown from this method.  A JMXConnectionNotification with type JMXConnectionNotification.FAILED is emitted from this MBean\n with the connection ID of the connection that could not be\n closed.\nClosing a connector server is a potentially slow operation.\n For example, if a client machine with an open connection has\n crashed, the close operation might have to wait for a network\n protocol timeout.  Callers that do not want to block in a close\n operation should do it in a separate thread."}, {"method_name": "isActive", "method_sig": "boolean isActive()", "description": "Determines whether the connector server is active.  A connector\n server starts being active when its start method\n returns successfully and remains active until either its\n stop method is called or the connector server\n fails."}, {"method_name": "setMBeanServerForwarder", "method_sig": "void setMBeanServerForwarder (MBeanServerForwarder mbsf)", "description": "Inserts an object that intercepts requests for the MBean server\n that arrive through this connector server.  This object will be\n supplied as the MBeanServer for any new connection\n created by this connector server.  Existing connections are\n unaffected.\nThis method can be called more than once with different\n MBeanServerForwarder objects.  The result is a chain\n of forwarders.  The last forwarder added is the first in the chain.\n In more detail:\n\nIf this connector server is already associated with an\n MBeanServer object, then that object is given to\n mbsf.setMBeanServer.  If doing so produces an exception, this\n method throws the same exception without any other effect.\nIf this connector is not already associated with an\n MBeanServer object, or if the\n mbsf.setMBeanServer call just mentioned succeeds,\n then mbsf becomes this connector server's\n MBeanServer.\n"}, {"method_name": "getConnectionIds", "method_sig": "String[] getConnectionIds()", "description": "The list of IDs for currently-open connections to this\n connector server."}, {"method_name": "getAddress", "method_sig": "JMXServiceURL getAddress()", "description": "The address of this connector server.\n\n The address returned may not be the exact original JMXServiceURL\n that was supplied when creating the connector server, since the original\n address may not always be complete. For example the port number may be\n dynamically allocated when starting the connector server. Instead the\n address returned is the actual JMXServiceURL of the\n JMXConnectorServer. This is the address that clients supply\n to JMXConnectorFactory.connect(JMXServiceURL).\n \nNote that the address returned may be null if\n    the JMXConnectorServer is not yet active.\n "}, {"method_name": "getAttributes", "method_sig": "Map<String, ?> getAttributes()", "description": "The attributes for this connector server."}, {"method_name": "toJMXConnector", "method_sig": "JMXConnector toJMXConnector (Map<String, ?> env)\n                     throws IOException", "description": "Returns a client stub for this connector server.  A client\n stub is a serializable object whose connect method can be used to make\n one new connection to this connector server.\nA given connector need not support the generation of client\n stubs.  However, the connectors specified by the JMX Remote API do\n (JMXMP Connector and RMI Connector)."}]}