{"name": "Class JobImpressionsCompleted", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class JobImpressionsCompleted is an integer valued printing attribute\n class that specifies the number of impressions completed for the job so far.\n For printing devices, the impressions completed includes interpreting,\n marking, and stacking the output.\n \n The JobImpressionsCompleted attribute describes the progress of the\n job. This attribute is intended to be a counter. That is, the\n JobImpressionsCompleted value for a job that has not started\n processing must be 0. When the job's JobState is\n PROCESSING or PROCESSING_STOPPED, the\n JobImpressionsCompleted value is intended to increase as the job is\n processed; it indicates the amount of the job that has been processed at the\n time the Print Job's attribute set is queried or at the time a print job\n event is reported. When the job enters the COMPLETED,\n CANCELED, or ABORTED states, the\n JobImpressionsCompleted value is the final value for the job.\n \nIPP Compatibility: The integer value gives the IPP integer value. The\n category name returned by getName() gives the IPP attribute name.", "codes": ["public final class JobImpressionsCompleted\nextends IntegerSyntax\nimplements PrintJobAttribute"], "fields": [], "methods": [{"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this job impressions completed attribute is equivalent tp\n the passed in object. To be equivalent, all of the following conditions\n must be true:\n \nobject is not null.\n   object is an instance of class\n   JobImpressionsCompleted.\n   This job impressions completed attribute's value and\n   object's value are equal.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class JobImpressionsCompleted, the category is class\n JobImpressionsCompleted itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class JobImpressionsCompleted, the category name is\n \"job-impressions-completed\"."}]}