{"name": "Class JobImpressions", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class JobImpressions is an integer valued printing attribute class\n that specifies the total size in number of impressions of the document(s)\n being submitted. An \"impression\" is the image (possibly many print-stream\n pages in different configurations) imposed onto a single media page.\n \n The JobImpressions attribute describes the size of the job. This\n attribute is not intended to be a counter; it is intended to be useful\n routing and scheduling information if known. The printer may try to compute\n the JobImpressions attribute's value if it is not supplied in the\n Print Request. Even if the client does supply a value for the\n JobImpressions attribute in the Print Request, the printer may choose\n to change the value if the printer is able to compute a value which is more\n accurate than the client supplied value. The printer may be able to determine\n the correct value for the JobImpressions attribute either right at\n job submission time or at any later point in time.\n \n As with JobKOctets, the JobImpressions value must\n not include the multiplicative factors contributed by the number of copies\n specified by the Copies attribute, independent of whether the\n device can process multiple copies without making multiple passes over the\n job or document data and independent of whether the output is collated or\n not. Thus the value is independent of the implementation and reflects the\n size of the document(s) measured in impressions independent of the number of\n copies.\n \n As with JobKOctets, the JobImpressions value must\n also not include the multiplicative factor due to a copies instruction\n embedded in the document data. If the document data actually includes\n replications of the document data, this value will include such replication.\n In other words, this value is always the number of impressions in the source\n document data, rather than a measure of the number of impressions to be\n produced by the job.\n \nIPP Compatibility: The integer value gives the IPP integer value. The\n category name returned by getName() gives the IPP attribute name.", "codes": ["public final class JobImpressions\nextends IntegerSyntax\nimplements PrintRequestAttribute, PrintJobAttribute"], "fields": [], "methods": [{"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this job impressions attribute is equivalent to the\n passed in object. To be equivalent, all of the following conditions must\n be true:\n \nobject is not null.\n   object is an instance of class JobImpressions.\n   This job impressions attribute's value and object's value\n   are equal.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class JobImpressions, the category is class\n JobImpressions itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class JobImpressions, the category name is\n \"job-impressions\"."}]}