{"name": "Class JobKOctets", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class JobKOctets is an integer valued printing attribute class that\n specifies the total size of the document(s) in K octets, i.e., in units of\n 1024 octets requested to be processed in the job. The value must be rounded\n up, so that a job between 1 and 1024 octets must be indicated as being 1K\n octets, 1025 to 2048 must be 2K octets, etc. For a multidoc print job (a job\n with multiple documents), the JobKOctets value is computed by adding\n up the individual documents' sizes in octets, then rounding up to the next K\n octets value.\n \n The JobKOctets attribute describes the size of the job. This\n attribute is not intended to be a counter; it is intended to be useful\n routing and scheduling information if known. The printer may try to compute\n the JobKOctets attribute's value if it is not supplied in the Print\n Request. Even if the client does supply a value for the JobKOctets\n attribute in the Print Request, the printer may choose to change the value if\n the printer is able to compute a value which is more accurate than the client\n supplied value. The printer may be able to determine the correct value for\n the JobKOctets attribute either right at job submission time or at\n any later point in time.\n \n The JobKOctets value must not include the multiplicative factors\n contributed by the number of copies specified by the Copies\n attribute, independent of whether the device can process multiple copies\n without making multiple passes over the job or document data and independent\n of whether the output is collated or not. Thus the value is independent of\n the implementation and indicates the size of the document(s) measured in K\n octets independent of the number of copies.\n \n The JobKOctets value must also not include the multiplicative factor\n due to a copies instruction embedded in the document data. If the document\n data actually includes replications of the document data, this value will\n include such replication. In other words, this value is always the size of\n the source document data, rather than a measure of the hardcopy output to be\n produced.\n \n The size of a doc is computed based on the print data representation class as\n specified by the doc's DocFlavor, as shown in\n the table below.\n\n \nTable showing computation of doc sizes\n\n\nRepresentation Class\n     Document Size\n \n\n\nbyte[]\nLength of the byte array\n   \njava.io.InputStream\nNumber of bytes read from the stream\n   \nchar[]\nLength of the character array x 2\n   \njava.lang.String\nLength of the string x 2\n   \njava.io.Reader\nNumber of characters read from the stream x 2\n   \njava.net.URL\nNumber of bytes read from the file at the given URL address\n   \njava.awt.image.renderable.RenderableImage\nImplementation dependent*\n   \njava.awt.print.Printable\nImplementation dependent*\n   \njava.awt.print.Pageable\nImplementation dependent*\n \n\n\n * In these cases the Print Service itself generates the print data sent\n to the printer. If the Print Service supports the JobKOctets\n attribute, for these cases the Print Service itself must calculate the size\n of the print data, replacing any JobKOctets value the client\n specified.\n \nIPP Compatibility: The integer value gives the IPP integer value. The\n category name returned by getName() gives the IPP attribute name.", "codes": ["public final class JobKOctets\nextends IntegerSyntax\nimplements PrintRequestAttribute, PrintJobAttribute"], "fields": [], "methods": [{"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this job K octets attribute is equivalent to the passed\n in object. To be equivalent, all of the following conditions must be\n true:\n \nobject is not null.\n   object is an instance of class JobKOctets.\n   This job K octets attribute's value and object's value are\n   equal.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class JobKOctets, the category is class\n JobKOctets itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class JobKOctets, the category name is\n \"job-k-octets\"."}]}