{"name": "Class JobKOctetsProcessed", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class JobKOctetsProcessed is an integer valued printing attribute\n class that specifies the total number of print data octets processed so far\n in K octets, i.e., in units of 1024 octets. The value must be rounded up, so\n that a job between 1 and 1024 octets inclusive must be indicated as being 1K\n octets, 1025 to 2048 inclusive must be 2K, etc. For a multidoc print job (a\n job with multiple documents), the JobKOctetsProcessed value is computed by\n adding up the individual documents' number of octets processed so far, then\n rounding up to the next K octets value.\n \n The JobKOctetsProcessed attribute describes the progress of the job.\n This attribute is intended to be a counter. That is, the JobKOctetsProcessed\n value for a job that has not started processing must be 0. When the job's\n JobState is PROCESSING or\n PROCESSING_STOPPED, the JobKOctetsProcessed value is intended\n to increase as the job is processed; it indicates the amount of the job that\n has been processed at the time the Print Job's attribute set is queried or at\n the time a print job event is reported. When the job enters the\n COMPLETED, CANCELED, or ABORTED states, the\n JobKOctetsProcessed value is the final value for the job.\n \n For implementations where multiple copies are produced by the interpreter\n with only a single pass over the data, the final value of the\n JobKOctetsProcessed attribute must be equal to the value of the\n JobKOctets attribute. For implementations where multiple\n copies are produced by the interpreter by processing the data for each copy,\n the final value must be a multiple of the value of the\n JobKOctets attribute.\n \nIPP Compatibility: The integer value gives the IPP integer value. The\n category name returned by getName() gives the IPP attribute name.", "codes": ["public final class JobKOctetsProcessed\nextends IntegerSyntax\nimplements PrintJobAttribute"], "fields": [], "methods": [{"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this job K octets processed attribute is equivalent to\n the passed in object. To be equivalent, all of the following conditions\n must be true:\n \nobject is not null.\n   object is an instance of class JobKOctetsProcessed.\n   This job K octets processed attribute's value and object's\n   value are equal.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class JobKOctetsProcessed, the category is class\n JobKOctetsProcessed itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class JobKOctetsProcessed, the category name is\n \"job-k-octets-processed\"."}]}