{"name": "Class JobMessageFromOperator", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class JobMessageFromOperator is a printing attribute class, a text\n attribute, that provides a message from an operator, system administrator, or\n \"intelligent\" process to indicate to the end user the reasons for\n modification or other management action taken on a job.\n \n A Print Job's attribute set includes zero instances or one instance of a\n JobMessageFromOperator attribute, not more than one instance. A new\n JobMessageFromOperator attribute replaces an existing\n JobMessageFromOperator attribute, if any. In other words,\n JobMessageFromOperator is not intended to be a history log. If it\n wishes, the client can detect changes to a Print Job's\n JobMessageFromOperator attribute and maintain the client's own\n history log of the JobMessageFromOperator attribute values.\n \nIPP Compatibility: The string value gives the IPP name value. The\n locale gives the IPP natural language. The category name returned by\n getName() gives the IPP attribute name.", "codes": ["public final class JobMessageFromOperator\nextends TextSyntax\nimplements PrintJobAttribute"], "fields": [], "methods": [{"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this job message from operator attribute is equivalent to\n the passed in object. To be equivalent, all of the following conditions\n must be true:\n \nobject is not null.\n   object is an instance of class\n   JobMessageFromOperator.\n   This job message from operator attribute's underlying string and\n   object's underlying string are equal.\n   This job message from operator attribute's locale and\n   object's locale are equal.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class JobMessageFromOperator, the category is class\n JobMessageFromOperator itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class JobMessageFromOperator, the category name is\n \"job-message-from-operator\"."}]}