{"name": "Class JobMediaSheets", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class JobMediaSheets is an integer valued printing attribute class\n that specifies the total number of media sheets to be produced for this job.\n \n The JobMediaSheets attribute describes the size of the job. This\n attribute is not intended to be a counter; it is intended to be useful\n routing and scheduling information if known. The printer may try to compute\n the JobMediaSheets attribute's value if it is not supplied in the\n Print Request. Even if the client does supply a value for the\n JobMediaSheets attribute in the Print Request, the printer may choose\n to change the value if the printer is able to compute a value which is more\n accurate than the client supplied value. The printer may be able to determine\n the correct value for the JobMediaSheets attribute either right at\n job submission time or at any later point in time.\n \n Unlike the JobKOctets and\n JobImpressions attributes, the JobMediaSheets\n value must include the multiplicative factors contributed by the number of\n copies specified by the Copies attribute and a \"number of\n copies\" instruction embedded in the document data, if any. This difference\n allows the system administrator to control the lower and upper bounds of both\n (1) the size of the document(s) with\n JobKOctetsSupported and\n JobImpressionsSupported and (2) the size of\n the job with JobMediaSheetsSupported.\n \nIPP Compatibility: The integer value gives the IPP integer value. The\n category name returned by getName() gives the IPP attribute name.", "codes": ["public class JobMediaSheets\nextends IntegerSyntax\nimplements PrintRequestAttribute, PrintJobAttribute"], "fields": [], "methods": [{"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this job media sheets attribute is equivalent to the\n passed in object. To be equivalent, all of the following conditions must\n be true:\n \nobject is not null.\n   object is an instance of class JobMediaSheets.\n   This job media sheets attribute's value and object's value\n   are equal.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class JobMediaSheets and any vendor-defined subclasses, the\n category is class JobMediaSheets itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class JobMediaSheets and any vendor-defined subclasses, the\n category name is \"job-media-sheets\"."}]}