{"name": "Class JobName", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class JobName is a printing attribute class, a text attribute, that\n specifies the name of a print job. A job's name is an arbitrary string\n defined by the client. It does not need to be unique between different jobs.\n A Print Job's JobName attribute is set to the value supplied by the\n client in the Print Request's attribute set. If, however, the client does not\n supply a JobName attribute in the Print Request, the printer, when it\n creates the Print Job, must generate a JobName. The printer should\n generate the value of the Print Job's JobName attribute from the\n first of the following sources that produces a value: (1) the\n DocumentName attribute of the first (or only) doc in the\n job, (2) the URL of the first (or only) doc in the job, if the doc's\n print data representation object is a URL, or (3) any other piece of\n Print Job specific and/or document content information.\n \nIPP Compatibility: The string value gives the IPP name value. The\n locale gives the IPP natural language. The category name returned by\n getName() gives the IPP attribute name.", "codes": ["public final class JobName\nextends TextSyntax\nimplements PrintRequestAttribute, PrintJobAttribute"], "fields": [], "methods": [{"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this job name attribute is equivalent to the passed in\n object. To be equivalent, all of the following conditions must be true:\n \nobject is not null.\n   object is an instance of class JobName.\n   This job name attribute's underlying string and object's\n   underlying string are equal.\n   This job name attribute's locale and object's locale are\n   equal.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class JobName, the category is class JobName itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class JobName, the category name is \"job-name\"."}]}