{"name": "Class JobOriginatingUserName", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class JobOriginatingUserName is a printing attribute class, a text\n attribute, that contains the name of the end user that submitted the print\n job. If possible, the printer sets this attribute to the most authenticated\n printable user name that it can obtain from the authentication service that\n authenticated the submitted Print Request. If such is not available, the\n printer uses the value of the RequestingUserName\n attribute supplied by the client in the Print Request's attribute set. If no\n authentication service is available, and the client did not supply a\n RequestingUserName attribute, the printer sets the\n JobOriginatingUserName attribute to an empty (zero-length) string.\n \nIPP Compatibility: The string value gives the IPP name value. The\n locale gives the IPP natural language. The category name returned by\n getName() gives the IPP attribute name.", "codes": ["public final class JobOriginatingUserName\nextends TextSyntax\nimplements PrintJobAttribute"], "fields": [], "methods": [{"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this job originating user name attribute is equivalent to\n the passed in object. To be equivalent, all of the following conditions\n must be true:\n \nobject is not null.\n   object is an instance of class\n   JobOriginatingUserName.\n   This job originating user name attribute's underlying string and\n   object's underlying string are equal.\n   This job originating user name attribute's locale and\n   object's locale are equal.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class JobOriginatingUserName, the category is class\n JobOriginatingUserName itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class JobOriginatingUserName, the category name is\n \"job-originating-user-name\"."}]}