{"name": "Class JobPriority", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class JobPriority is an integer valued printing attribute class that\n specifies a print job's priority.\n \n If a JobPriority attribute is specified for a Print Job, it specifies\n a priority for scheduling the job. A higher value specifies a higher\n priority. The value 1 indicates the lowest possible priority. The value 100\n indicates the highest possible priority. Among those jobs that are ready to\n print, a printer must print all jobs with a priority value of n before\n printing those with a priority value of n-1 for all n.\n\n If the client does not specify a JobPriority attribute for a Print\n Job and the printer does support the JobPriority attribute, the printer must\n use an implementation-defined default JobPriority value.\n \n The client can always specify any job priority value from 1 to 100 for a job.\n However, a Print Service instance may support fewer than 100 different job\n priority levels. If this is the case, the Print Service instance\n automatically maps the client-specified job priority value to one of the\n supported job priority levels, dividing the 100 job priority values equally\n among the available job priority levels.\n \nIPP Compatibility: The integer value gives the IPP integer value. The\n category name returned by getName() gives the IPP attribute name.", "codes": ["public final class JobPriority\nextends IntegerSyntax\nimplements PrintRequestAttribute, PrintJobAttribute"], "fields": [], "methods": [{"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this job priority attribute is equivalent to the passed\n in object. To be equivalent, all of the following conditions must be\n true:\n \nobject is not null.\n   object is an instance of class JobPriority.\n   This job priority attribute's value and object's value are\n   equal.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class JobPriority, the category is class\n JobPriority itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class JobPriority, the category name is\n \"job-priority\"."}]}