{"name": "Class JobPrioritySupported", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class JobPrioritySupported is an integer valued printing attribute\n class that specifies whether a Print Service instance supports the\n JobPriority attribute and the number of different job\n priority levels supported.\n \n The client can always specify any JobPriority value from\n 1 to 100 for a job. However, the Print Service instance may support fewer\n than 100 different job priority levels. If this is the case, the Print\n Service instance automatically maps the client-specified job priority value\n to one of the supported job priority levels, dividing the 100 job priority\n values equally among the available job priority levels.\n \nIPP Compatibility: The integer value gives the IPP integer value. The\n category name returned by getName() gives the IPP attribute name.", "codes": ["public final class JobPrioritySupported\nextends IntegerSyntax\nimplements SupportedValuesAttribute"], "fields": [], "methods": [{"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this job priority supported attribute is equivalent to\n the passed in object. To be equivalent, all of the following conditions\n must be true:\n \nobject is not null.\n   object is an instance of class\n   JobPrioritySupported.\n   This job priority supported attribute's value and object's\n   value are equal.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class JobPrioritySupported, the category is class\n JobPrioritySupported itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class JobPrioritySupported, the category name is\n \"job-priority-supported\"."}]}