{"name": "Class JobState", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "JobState is a printing attribute class, an enumeration, that\n identifies the current state of a print job. Class JobState defines\n standard job state values. A Print Service implementation only needs to\n report those job states which are appropriate for the particular\n implementation; it does not have to report every defined job state. The\n JobStateReasons attribute augments the\n JobState attribute to give more detailed information about the job in\n the given job state.\n \nIPP Compatibility: The category name returned by getName() is\n the IPP attribute name. The enumeration's integer value is the IPP enum\n value. The toString() method returns the IPP string representation of\n the attribute value.", "codes": ["public class JobState\nextends EnumSyntax\nimplements PrintJobAttribute"], "fields": [{"field_name": "UNKNOWN", "field_sig": "public static final JobState UNKNOWN", "description": "The job state is unknown."}, {"field_name": "PENDING", "field_sig": "public static final JobState PENDING", "description": "The job is a candidate to start processing, but is not yet processing."}, {"field_name": "PENDING_HELD", "field_sig": "public static final JobState PENDING_HELD", "description": "The job is not a candidate for processing for any number of reasons but\n will return to the PENDING state as soon as the reasons are no\n longer present. The job's JobStateReasons\n attribute must indicate why the job is no longer a candidate for\n processing."}, {"field_name": "PROCESSING", "field_sig": "public static final JobState PROCESSING", "description": "The job is processing. One or more of the following activities is\n occurring:\n \nThe job is using, or is attempting to use, one or more purely\n   software processes that are analyzing, creating, or interpreting a PDL,\n   etc.\n   The job is using, or is attempting to use, one or more hardware\n   devices that are interpreting a PDL, making marks on a medium, and/or\n   performing finishing, such as stapling, etc.\n   The printer has made the job ready for printing, but the output\n   device is not yet printing it, either because the job hasn't reached\n   the output device or because the job is queued in the output device or\n   some other spooler, awaiting the output device to print it.\n \n When the job is in the PROCESSING state, the entire job state\n includes the detailed status represented in the printer's\n PrinterState and\n PrinterStateReasons attributes.\n \n Implementations may, though they need not, include additional values in\n the job's JobStateReasons attribute to indicate\n the progress of the job, such as adding the JOB_PRINTING value to\n indicate when the output device is actually making marks on paper and/or\n the PROCESSING_TO_STOP_POINT value to indicate that the printer\n is in the process of canceling or aborting the job."}, {"field_name": "PROCESSING_STOPPED", "field_sig": "public static final JobState PROCESSING_STOPPED", "description": "The job has stopped while processing for any number of reasons and will\n return to the PROCESSING state as soon as the reasons are no\n longer present.\n \n The job's JobStateReasons attribute may indicate\n why the job has stopped processing. For example, if the output device is\n stopped, the PRINTER_STOPPED value may be included in the job's\n JobStateReasons attribute.\n \nNote: When an output device is stopped, the device usually\n indicates its condition in human readable form locally at the device. A\n client can obtain more complete device status remotely by querying the\n printer's PrinterState and\n PrinterStateReasons attributes."}, {"field_name": "CANCELED", "field_sig": "public static final JobState CANCELED", "description": "The job has been canceled by some human agency, the printer has completed\n canceling the job, and all job status attributes have reached their final\n values for the job. While the printer is canceling the job, the job\n remains in its current state, but the job's JobStateReasons attribute should contain the\n PROCESSING_TO_STOP_POINT value and one of the\n CANCELED_BY_USER, CANCELED_BY_OPERATOR, or\n CANCELED_AT_DEVICE values. When the job moves to the\n CANCELED state, the PROCESSING_TO_STOP_POINT value, if\n present, must be removed, but the CANCELED_BY_xxx value, if\n present, must remain."}, {"field_name": "ABORTED", "field_sig": "public static final JobState ABORTED", "description": "The job has been aborted by the system (usually while the job was in the\n PROCESSING or PROCESSING_STOPPED state), the printer has\n completed aborting the job, and all job status attributes have reached\n their final values for the job. While the printer is aborting the job,\n the job remains in its current state, but the job's\n JobStateReasons attribute should contain the\n PROCESSING_TO_STOP_POINT and ABORTED_BY_SYSTEM values.\n When the job moves to the ABORTED state, the\n PROCESSING_TO_STOP_POINT value, if present, must be removed, but\n the ABORTED_BY_SYSTEM value, if present, must remain."}, {"field_name": "COMPLETED", "field_sig": "public static final JobState COMPLETED", "description": "The job has completed successfully or with warnings or errors after\n processing, all of the job media sheets have been successfully stacked in\n the appropriate output bin(s), and all job status attributes have reached\n their final values for the job. The job's\n JobStateReasons attribute should contain one of\n these values: COMPLETED_SUCCESSFULLY,\n COMPLETED_WITH_WARNINGS, or COMPLETED_WITH_ERRORS."}], "methods": [{"method_name": "getStringTable", "method_sig": "protected String[] getStringTable()", "description": "Returns the string table for class JobState."}, {"method_name": "getEnumValueTable", "method_sig": "protected EnumSyntax[] getEnumValueTable()", "description": "Returns the enumeration value table for class JobState."}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class JobState and any vendor-defined subclasses, the\n category is class JobState itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class JobState and any vendor-defined subclasses, the\n category name is \"job-state\"."}]}