{"name": "Class JobStateReason", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class JobStateReason is a printing attribute class, an enumeration,\n that provides additional information about the job's current state, i.e.,\n information that augments the value of the job's JobState\n attribute. Class JobStateReason defines standard job state reason\n values. A Print Service implementation only needs to report those job state\n reasons which are appropriate for the particular implementation; it does not\n have to report every defined job state reason.\n \n Instances of JobStateReason do not appear in a Print Job's attribute\n set directly. Rather, a JobStateReasons attribute\n appears in the Print Job's attribute set. The\n JobStateReasons attribute contains zero, one, or more\n than one JobStateReason objects which pertain to the Print Job's\n status. The printer adds a JobStateReason object to the Print Job's\n JobStateReasons attribute when the corresponding\n condition becomes true of the Print Job, and the printer removes the\n JobStateReason object again when the corresponding condition becomes\n false, regardless of whether the Print Job's overall\n JobState also changed.\n \nIPP Compatibility: The category name returned by getName() is\n the IPP attribute name. The enumeration's integer value is the IPP enum\n value. The toString() method returns the IPP string representation of\n the attribute value.", "codes": ["public class JobStateReason\nextends EnumSyntax\nimplements Attribute"], "fields": [{"field_name": "JOB_INCOMING", "field_sig": "public static final JobStateReason JOB_INCOMING", "description": "The printer has created the Print Job, but the printer has not finished\n accessing or accepting all the print data yet."}, {"field_name": "JOB_DATA_INSUFFICIENT", "field_sig": "public static final JobStateReason JOB_DATA_INSUFFICIENT", "description": "The printer has created the Print Job, but the printer is expecting\n additional print data before it can move the job into the\n PROCESSING state. If a printer starts processing before it has\n received all data, the printer removes the JOB_DATA_INSUFFICIENT\n reason, but the JOB_INCOMING reason remains. If a printer starts\n processing after it has received all data, the printer removes the\n JOB_DATA_INSUFFICIENT and JOB_INCOMING reasons at the\n same time."}, {"field_name": "DOCUMENT_ACCESS_ERROR", "field_sig": "public static final JobStateReason DOCUMENT_ACCESS_ERROR", "description": "The printer could not access one or more documents passed by reference\n (i.e., the print data representation object is a URL). This\n reason is intended to cover any file access problem,including file does\n not exist and access denied because of an access control problem. Whether\n the printer aborts the job and moves the job to the ABORTED job\n state or prints all documents that are accessible and moves the job to\n the COMPLETED job state and adds the\n COMPLETED_WITH_ERRORS reason to the job's\n JobStateReasons attribute depends on\n implementation and/or site policy. This value should be supported if the\n printer supports doc flavors with URL print data representation\n objects."}, {"field_name": "SUBMISSION_INTERRUPTED", "field_sig": "public static final JobStateReason SUBMISSION_INTERRUPTED", "description": "The job was not completely submitted for some unforeseen reason.\n Possibilities include (1) the printer has crashed before the job was\n fully submitted by the client, (2) the printer or the document transfer\n method has crashed in some non-recoverable way before the document data\n was entirely transferred to the printer, (3) the client crashed before\n the job was fully submitted."}, {"field_name": "JOB_OUTGOING", "field_sig": "public static final JobStateReason JOB_OUTGOING", "description": "The printer is transmitting the job to the output device."}, {"field_name": "JOB_HOLD_UNTIL_SPECIFIED", "field_sig": "public static final JobStateReason JOB_HOLD_UNTIL_SPECIFIED", "description": "The value of the job's JobHoldUntil attribute was\n specified with a date-time that is still in the future. The job must not\n be a candidate for processing until this reason is removed and there are\n no other reasons to hold the job. This value should be supported if the\n JobHoldUntil job template attribute is supported."}, {"field_name": "RESOURCES_ARE_NOT_READY", "field_sig": "public static final JobStateReason RESOURCES_ARE_NOT_READY", "description": "At least one of the resources needed by the job, such as media, fonts,\n resource objects, etc., is not ready on any of the physical printers for\n which the job is a candidate. This condition may be detected when the job\n is accepted, or subsequently while the job is pending or processing,\n depending on implementation. The job may remain in its current state or\n be moved to the PENDING_HELD state, depending on implementation\n and/or job scheduling policy."}, {"field_name": "PRINTER_STOPPED_PARTLY", "field_sig": "public static final JobStateReason PRINTER_STOPPED_PARTLY", "description": "The value of the printer's PrinterStateReasons attribute contains a\n PrinterStateReason value of\n STOPPED_PARTLY."}, {"field_name": "PRINTER_STOPPED", "field_sig": "public static final JobStateReason PRINTER_STOPPED", "description": "The value of the printer's PrinterState attribute ia\n STOPPED."}, {"field_name": "JOB_INTERPRETING", "field_sig": "public static final JobStateReason JOB_INTERPRETING", "description": "The job is in the PROCESSING state, but more specifically, the\n printer ia interpreting the document data."}, {"field_name": "JOB_QUEUED", "field_sig": "public static final JobStateReason JOB_QUEUED", "description": "The job is in the PROCESSING state, but more specifically, the\n printer has queued the document data."}, {"field_name": "JOB_TRANSFORMING", "field_sig": "public static final JobStateReason JOB_TRANSFORMING", "description": "The job is in the PROCESSING state, but more specifically, the\n printer is interpreting document data and producing another electronic\n representation."}, {"field_name": "JOB_QUEUED_FOR_MARKER", "field_sig": "public static final JobStateReason JOB_QUEUED_FOR_MARKER", "description": "The job is in the PENDING_HELD, PENDING, or\n PROCESSING state, but more specifically, the printer has\n completed enough processing of the document to be able to start marking\n and the job is waiting for the marker. Systems that require human\n intervention to release jobs put the job into the PENDING_HELD\n job state. Systems that automatically select a job to use the marker put\n the job into the PENDING job state or keep the job in the\n PROCESSING job state while waiting for the marker, depending on\n implementation. All implementations put the job into (or back into) the\n PROCESSING state when marking does begin."}, {"field_name": "JOB_PRINTING", "field_sig": "public static final JobStateReason JOB_PRINTING", "description": "The output device is marking media. This value is useful for printers\n which spend a great deal of time processing (1) when no marking is\n happening and then want to show that marking is now happening or (2) when\n the job is in the process of being canceled or aborted while the job\n remains in the PROCESSING state, but the marking has not yet\n stopped so that impression or sheet counts are still increasing for the\n job."}, {"field_name": "JOB_CANCELED_BY_USER", "field_sig": "public static final JobStateReason JOB_CANCELED_BY_USER", "description": "The job was canceled by the owner of the job, i.e., by a user whose\n authenticated identity is the same as the value of the originating user\n that created the Print Job, or by some other authorized end-user, such as\n a member of the job owner's security group. This value should be\n supported."}, {"field_name": "JOB_CANCELED_BY_OPERATOR", "field_sig": "public static final JobStateReason JOB_CANCELED_BY_OPERATOR", "description": "The job was canceled by the operator, i.e., by a user who has been\n authenticated as having operator privileges (whether local or remote). If\n the security policy is to allow anyone to cancel anyone's job, then this\n value may be used when the job is canceled by someone other than the\n owner of the job. For such a security policy, in effect, everyone is an\n operator as far as canceling jobs is concerned. This value should be\n supported if the implementation permits canceling by someone other than\n the owner of the job."}, {"field_name": "JOB_CANCELED_AT_DEVICE", "field_sig": "public static final JobStateReason JOB_CANCELED_AT_DEVICE", "description": "The job was canceled by an unidentified local user, i.e., a user at a\n console at the device. This value should be supported if the\n implementation supports canceling jobs at the console."}, {"field_name": "ABORTED_BY_SYSTEM", "field_sig": "public static final JobStateReason ABORTED_BY_SYSTEM", "description": "The job was aborted by the system. Either the job (1) is in the process\n of being aborted, (2) has been aborted by the system and placed in the\n ABORTED state, or (3) has been aborted by the system and placed\n in the PENDING_HELD state, so that a user or operator can\n manually try the job again. This value should be supported."}, {"field_name": "UNSUPPORTED_COMPRESSION", "field_sig": "public static final JobStateReason UNSUPPORTED_COMPRESSION", "description": "The job was aborted by the system because the printer determined while\n attempting to decompress the document's data that the compression is\n actually not among those supported by the printer. This value must be\n supported, since Compression is a required doc\n description attribute."}, {"field_name": "COMPRESSION_ERROR", "field_sig": "public static final JobStateReason COMPRESSION_ERROR", "description": "The job was aborted by the system because the printer encountered an\n error in the document data while decompressing it. If the printer posts\n this reason, the document data has already passed any tests that would\n have led to the UNSUPPORTED_COMPRESSION job state reason."}, {"field_name": "UNSUPPORTED_DOCUMENT_FORMAT", "field_sig": "public static final JobStateReason UNSUPPORTED_DOCUMENT_FORMAT", "description": "The job was aborted by the system because the document data's document\n format (doc flavor) is not among those supported by the printer. If the\n client specifies a doc flavor with a MIME type of\n \"application/octet-stream\", the printer may abort the job if the\n printer cannot determine the document data's actual format through\n auto-sensing (even if the printer supports the document format if\n specified explicitly). This value must be supported, since a doc flavor\n is required to be specified for each doc."}, {"field_name": "DOCUMENT_FORMAT_ERROR", "field_sig": "public static final JobStateReason DOCUMENT_FORMAT_ERROR", "description": "The job was aborted by the system because the printer encountered an\n error in the document data while processing it. If the printer posts this\n reason, the document data has already passed any tests that would have\n led to the UNSUPPORTED_DOCUMENT_FORMAT job state reason."}, {"field_name": "PROCESSING_TO_STOP_POINT", "field_sig": "public static final JobStateReason PROCESSING_TO_STOP_POINT", "description": "The requester has canceled the job or the printer has aborted the job,\n but the printer is still performing some actions on the job until a\n specified stop point occurs or job termination/cleanup is completed.\n \n If the implementation requires some measurable time to cancel the job in\n the PROCESSING or PROCESSING_STOPPED job states, the\n printer must use this reason to indicate that the printer is still\n performing some actions on the job while the job remains in the\n PROCESSING or PROCESSING_STOPPED state. After all the\n job's job description attributes have stopped incrementing, the printer\n moves the job from the PROCESSING state to the CANCELED or\n ABORTED job states."}, {"field_name": "SERVICE_OFF_LINE", "field_sig": "public static final JobStateReason SERVICE_OFF_LINE", "description": "The printer is off-line and accepting no jobs. All PENDING jobs\n are put into the PENDING_HELD state. This situation could be true\n if the service's or document transform's input is impaired or broken."}, {"field_name": "JOB_COMPLETED_SUCCESSFULLY", "field_sig": "public static final JobStateReason JOB_COMPLETED_SUCCESSFULLY", "description": "The job completed successfully. This value should be supported."}, {"field_name": "JOB_COMPLETED_WITH_WARNINGS", "field_sig": "public static final JobStateReason JOB_COMPLETED_WITH_WARNINGS", "description": "The job completed with warnings. This value should be supported if the\n implementation detects warnings."}, {"field_name": "JOB_COMPLETED_WITH_ERRORS", "field_sig": "public static final JobStateReason JOB_COMPLETED_WITH_ERRORS", "description": "The job completed with errors (and possibly warnings too). This value\n should be supported if the implementation detects errors."}, {"field_name": "JOB_RESTARTABLE", "field_sig": "public static final JobStateReason JOB_RESTARTABLE", "description": "This job is retained and is currently able to be restarted. If\n JOB_RESTARTABLE is contained in the job's\n JobStateReasons attribute, then the printer must\n accept a request to restart that job. This value should be supported if\n restarting jobs is supported. [The capability for restarting jobs is\n not in the Java Print Service API at present.]"}, {"field_name": "QUEUED_IN_DEVICE", "field_sig": "public static final JobStateReason QUEUED_IN_DEVICE", "description": "The job has been forwarded to a device or print system that is unable to\n send back status. The printer sets the job's JobState\n attribute to COMPLETED and adds the QUEUED_IN_DEVICE\n reason to the job's JobStateReasons attribute to\n indicate that the printer has no additional information about the job and\n never will have any better information."}], "methods": [{"method_name": "getStringTable", "method_sig": "protected String[] getStringTable()", "description": "Returns the string table for class JobStateReason."}, {"method_name": "getEnumValueTable", "method_sig": "protected EnumSyntax[] getEnumValueTable()", "description": "Returns the enumeration value table for class JobStateReason."}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class JobStateReason and any vendor-defined subclasses, the\n category is class JobStateReason itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class JobStateReason and any vendor-defined subclasses, the\n category name is \"job-state-reason\"."}]}