{"name": "Class JPEGImageWriteParam", "module": "java.desktop", "package": "javax.imageio.plugins.jpeg", "text": "This class adds the ability to set JPEG quantization and Huffman\n tables when using the built-in JPEG writer plug-in, and to request that\n optimized Huffman tables be computed for an image.  An instance of\n this class will be returned from the\n getDefaultImageWriteParam methods of the built-in JPEG\n ImageWriter.\n\n  The principal purpose of these additions is to allow the\n specification of tables to use in encoding abbreviated streams.\n The built-in JPEG writer will also accept an ordinary\n ImageWriteParam, in which case the writer will\n construct the necessary tables internally.\n\n  In either case, the quality setting in an ImageWriteParam\n has the same meaning as for the underlying library: 1.00 means a\n quantization table of all 1's, 0.75 means the \"standard\", visually\n lossless quantization table, and 0.00 means aquantization table of\n all 255's.\n\n  While tables for abbreviated streams are often specified by\n first writing an abbreviated stream containing only the tables, in\n some applications the tables are fixed ahead of time.  This class\n allows the tables to be specified directly from client code.\n\n  Normally, the tables are specified in the\n IIOMetadata objects passed in to the writer, and any\n tables included in these objects are written to the stream.\n If no tables are specified in the metadata, then an abbreviated\n stream is written.  If no tables are included in the metadata and\n no tables are specified in a JPEGImageWriteParam, then\n an abbreviated stream is encoded using the \"standard\" visually\n lossless tables.  This class is necessary for specifying tables\n when an abbreviated stream must be written without writing any tables\n to a stream first.  In order to use this class, the metadata object\n passed into the writer must contain no tables, and no stream metadata\n must be provided.  See JPEGQTable and\n JPEGHuffmanTable for more\n information on the default tables.\n\n  The default JPEGImageWriteParam returned by the\n getDefaultWriteParam method of the writer contains no\n tables.  Default tables are included in the default\n IIOMetadata objects returned by the writer.\n\n  If the metadata does contain tables, the tables given in a\n JPEGImageWriteParam are ignored.  Furthermore, once a\n set of tables has been written, only tables in the metadata can\n override them for subsequent writes, whether to the same stream or\n a different one.  In order to specify new tables using this class,\n the reset\n method of the writer must be called.\n\n \n For more information about the operation of the built-in JPEG plug-ins,\n see the JPEG\n metadata format specification and usage notes.", "codes": ["public class JPEGImageWriteParam\nextends ImageWriteParam"], "fields": [], "methods": [{"method_name": "unsetCompression", "method_sig": "public void unsetCompression()", "description": "Removes any previous compression quality setting.\n\n  The default implementation resets the compression quality\n to 0.75F."}, {"method_name": "isCompressionLossless", "method_sig": "public boolean isCompressionLossless()", "description": "Returns false since the JPEG plug-in only supports\n lossy compression."}, {"method_name": "areTablesSet", "method_sig": "public boolean areTablesSet()", "description": "Returns true if tables are currently set."}, {"method_name": "setEncodeTables", "method_sig": "public void setEncodeTables (JPEGQTable[] qTables,\n                            JPEGHuffmanTable[] DCHuffmanTables,\n                            JPEGHuffmanTable[] ACHuffmanTables)", "description": "Sets the quantization and Huffman tables to use in encoding\n abbreviated streams.  There may be a maximum of 4 tables of\n each type.  These tables are ignored if tables are specified in\n the metadata.  All arguments must be non-null.\n The two arrays of Huffman tables must have the same number of\n elements.  The table specifiers in the frame and scan headers\n in the metadata are assumed to be equivalent to indices into\n these arrays.  The argument arrays are copied by this method."}, {"method_name": "unsetEncodeTables", "method_sig": "public void unsetEncodeTables()", "description": "Removes any quantization and Huffman tables that are currently\n set."}, {"method_name": "getQTables", "method_sig": "public JPEGQTable[] getQTables()", "description": "Returns a copy of the array of quantization tables set on the\n most recent call to setEncodeTables, or\n null if tables are not currently set."}, {"method_name": "getDCHuffmanTables", "method_sig": "public JPEGHuffmanTable[] getDCHuffmanTables()", "description": "Returns a copy of the array of DC Huffman tables set on the\n most recent call to setEncodeTables, or\n null if tables are not currently set."}, {"method_name": "getACHuffmanTables", "method_sig": "public JPEGHuffmanTable[] getACHuffmanTables()", "description": "Returns a copy of the array of AC Huffman tables set on the\n most recent call to setEncodeTables, or\n null if tables are not currently set."}, {"method_name": "setOptimizeHuffmanTables", "method_sig": "public void setOptimizeHuffmanTables (boolean optimize)", "description": "Tells the writer to generate optimized Huffman tables\n for the image as part of the writing process.  The\n default is false.  If this flag is set\n to true, it overrides any tables specified\n in the metadata.  Note that this means that any image\n written with this flag set to true will\n always contain Huffman tables."}, {"method_name": "getOptimizeHuffmanTables", "method_sig": "public boolean getOptimizeHuffmanTables()", "description": "Returns the value passed into the most recent call\n to setOptimizeHuffmanTables, or\n false if setOptimizeHuffmanTables\n has never been called."}]}