{"name": "Class JTextPane", "module": "java.desktop", "package": "javax.swing", "text": "A text component that can be marked up with attributes that are\n represented graphically.\n You can find how-to information and examples of using text panes in\n Using Text Components,\n a section in The Java Tutorial.\n\n This component models paragraphs\n that are composed of runs of character level attributes.  Each\n paragraph may have a logical style attached to it which contains\n the default attributes to use if not overridden by attributes set\n on the paragraph or character run.  Components and images may\n be embedded in the flow of text.\n\n \nNewlines\n\n For a discussion on how newlines are handled, see\n DefaultEditorKit.\n \n\nWarning: Swing is not thread safe. For more\n information see Swing's Threading\n Policy.\n \nWarning:\n Serialized objects of this class will not be compatible with\n future Swing releases. The current serialization support is\n appropriate for short term storage or RMI between applications running\n the same version of Swing.  As of 1.4, support for long term storage\n of all JavaBeans™\n has been added to the java.beans package.\n Please see XMLEncoder.", "codes": ["@JavaBean(description=\"A text component that can be marked up with attributes that are graphically represented.\")\npublic class JTextPane\nextends JEditorPane"], "fields": [], "methods": [{"method_name": "getUIClassID", "method_sig": "@BeanProperty(bound=false)\npublic String getUIClassID()", "description": "Returns the class ID for the UI."}, {"method_name": "setDocument", "method_sig": "public void setDocument (Document doc)", "description": "Associates the editor with a text document.  This\n must be a StyledDocument."}, {"method_name": "setStyledDocument", "method_sig": "public void setStyledDocument (StyledDocument doc)", "description": "Associates the editor with a text document.\n The currently registered factory is used to build a view for\n the document, which gets displayed by the editor."}, {"method_name": "getStyledDocument", "method_sig": "public StyledDocument getStyledDocument()", "description": "Fetches the model associated with the editor."}, {"method_name": "replaceSelection", "method_sig": "public void replaceSelection (String content)", "description": "Replaces the currently selected content with new content\n represented by the given string.  If there is no selection\n this amounts to an insert of the given text.  If there\n is no replacement text this amounts to a removal of the\n current selection.  The replacement text will have the\n attributes currently defined for input at the point of\n insertion.  If the document is not editable, beep and return."}, {"method_name": "insertComponent", "method_sig": "public void insertComponent (Component c)", "description": "Inserts a component into the document as a replacement\n for the currently selected content.  If there is no\n selection the component is effectively inserted at the\n current position of the caret.  This is represented in\n the associated document as an attribute of one character\n of content.\n \n The component given is the actual component used by the\n JTextPane.  Since components cannot be a child of more than\n one container, this method should not be used in situations\n where the model is shared by text components.\n \n The component is placed relative to the text baseline\n according to the value returned by\n Component.getAlignmentY.  For Swing components\n this value can be conveniently set using the method\n JComponent.setAlignmentY.  For example, setting\n a value of 0.75 will cause 75 percent of the\n component to be above the baseline, and 25 percent of the\n component to be below the baseline."}, {"method_name": "insertIcon", "method_sig": "public void insertIcon (Icon g)", "description": "Inserts an icon into the document as a replacement\n for the currently selected content.  If there is no\n selection the icon is effectively inserted at the\n current position of the caret.  This is represented in\n the associated document as an attribute of one character\n of content."}, {"method_name": "addStyle", "method_sig": "public Style addStyle (String nm,\n                      Style parent)", "description": "Adds a new style into the logical style hierarchy.  Style attributes\n resolve from bottom up so an attribute specified in a child\n will override an attribute specified in the parent."}, {"method_name": "removeStyle", "method_sig": "public void removeStyle (String nm)", "description": "Removes a named non-null style previously added to\n the document."}, {"method_name": "getStyle", "method_sig": "public Style getStyle (String nm)", "description": "Fetches a named non-null style previously added."}, {"method_name": "setLogicalStyle", "method_sig": "public void setLogicalStyle (Style s)", "description": "Sets the logical style to use for the paragraph at the\n current caret position.  If attributes aren't explicitly set\n for character and paragraph attributes they will resolve\n through the logical style assigned to the paragraph, which\n in term may resolve through some hierarchy completely\n independent of the element hierarchy in the document."}, {"method_name": "getLogicalStyle", "method_sig": "public Style getLogicalStyle()", "description": "Fetches the logical style assigned to the paragraph represented\n by the current position of the caret, or null."}, {"method_name": "getCharacterAttributes", "method_sig": "@BeanProperty(bound=false)\npublic AttributeSet getCharacterAttributes()", "description": "Fetches the character attributes in effect at the\n current location of the caret, or null."}, {"method_name": "setCharacterAttributes", "method_sig": "public void setCharacterAttributes (AttributeSet attr,\n                                   boolean replace)", "description": "Applies the given attributes to character\n content.  If there is a selection, the attributes\n are applied to the selection range.  If there\n is no selection, the attributes are applied to\n the input attribute set which defines the attributes\n for any new text that gets inserted."}, {"method_name": "getParagraphAttributes", "method_sig": "@BeanProperty(bound=false)\npublic AttributeSet getParagraphAttributes()", "description": "Fetches the current paragraph attributes in effect\n at the location of the caret, or null if none."}, {"method_name": "setParagraphAttributes", "method_sig": "public void setParagraphAttributes (AttributeSet attr,\n                                   boolean replace)", "description": "Applies the given attributes to paragraphs.  If\n there is a selection, the attributes are applied\n to the paragraphs that intersect the selection.\n If there is no selection, the attributes are applied\n to the paragraph at the current caret position."}, {"method_name": "getInputAttributes", "method_sig": "@BeanProperty(bound=false)\npublic MutableAttributeSet getInputAttributes()", "description": "Gets the input attributes for the pane."}, {"method_name": "getStyledEditorKit", "method_sig": "protected final StyledEditorKit getStyledEditorKit()", "description": "Gets the editor kit."}, {"method_name": "createDefaultEditorKit", "method_sig": "protected EditorKit createDefaultEditorKit()", "description": "Creates the EditorKit to use by default.  This\n is implemented to return javax.swing.text.StyledEditorKit."}, {"method_name": "setEditorKit", "method_sig": "public final void setEditorKit (EditorKit kit)", "description": "Sets the currently installed kit for handling\n content.  This is the bound property that\n establishes the content type of the editor."}, {"method_name": "paramString", "method_sig": "protected String paramString()", "description": "Returns a string representation of this JTextPane.\n This method\n is intended to be used only for debugging purposes, and the\n content and format of the returned string may vary between\n implementations. The returned string may be empty but may not\n be null."}]}