{"name": "Class JTree.DropLocation", "module": "java.desktop", "package": "javax.swing", "text": "A subclass of TransferHandler.DropLocation representing\n a drop location for a JTree.", "codes": ["public static final class JTree.DropLocation\nextends TransferHandler.DropLocation"], "fields": [], "methods": [{"method_name": "getChildIndex", "method_sig": "public int getChildIndex()", "description": "Returns the index where the dropped data should be inserted\n with respect to the path returned by getPath().\n \n For drop modes DropMode.USE_SELECTION and\n DropMode.ON, this index is unimportant (and it will\n always be -1) as the only interesting data is the\n path over which the drop operation occurred.\n \n For drop mode DropMode.INSERT, this index\n indicates the index at which the data should be inserted into\n the parent path represented by getPath().\n -1 indicates that the drop occurred over the\n parent itself, and in most cases should be treated as inserting\n into either the beginning or the end of the parent's list of\n children.\n \n For DropMode.ON_OR_INSERT, this value will be\n an insert index, as described above, or -1 if\n the drop occurred over the path itself."}, {"method_name": "getPath", "method_sig": "public TreePath getPath()", "description": "Returns the path where dropped data should be placed in the\n tree.\n \n Interpretation of this value depends on the drop mode set on the\n component. If the drop mode is DropMode.USE_SELECTION\n or DropMode.ON, the return value is the path in the\n tree over which the data has been (or will be) dropped.\n null indicates that the drop is over empty space,\n not associated with a particular path.\n \n If the drop mode is DropMode.INSERT, the return value\n refers to the path that should become the parent of the new data,\n in which case getChildIndex() indicates where the\n new item should be inserted into this parent path. A\n null path indicates that no parent path has been\n determined, which can happen for multiple reasons:\n \nThe tree has no model\n    There is no root in the tree\n    The root is collapsed\n    The root is a leaf node\n \n It is up to the developer to decide if and how they wish to handle\n the null case.\n \n If the drop mode is DropMode.ON_OR_INSERT,\n getChildIndex can be used to determine whether the\n drop is on top of the path itself (-1) or the index\n at which it should be inserted into the path (values other than\n -1)."}, {"method_name": "toString", "method_sig": "public String toString()", "description": "Returns a string representation of this drop location.\n This method is intended to be used for debugging purposes,\n and the content and format of the returned string may vary\n between implementations."}]}