{"name": "Interface KeyEventPostProcessor", "module": "java.desktop", "package": "java.awt", "text": "A KeyEventPostProcessor cooperates with the current KeyboardFocusManager\n in the final resolution of all unconsumed KeyEvents. KeyEventPostProcessors\n registered with the current KeyboardFocusManager will receive KeyEvents\n after the KeyEvents have been dispatched to and handled by their targets.\n KeyEvents that would have been otherwise discarded because no Component in\n the application currently owns the focus will also be forwarded to\n registered KeyEventPostProcessors. This will allow applications to implement\n features that require global KeyEvent post-handling, such as menu shortcuts.\n \n Note that the KeyboardFocusManager itself implements KeyEventPostProcessor.\n By default, the current KeyboardFocusManager will be the final\n KeyEventPostProcessor in the chain. The current KeyboardFocusManager cannot\n be completely deregistered as a KeyEventPostProcessor. However, if a\n KeyEventPostProcessor reports that no further post-processing of the\n KeyEvent should take place, the AWT will consider the event fully handled\n and will take no additional action with regard to the event. (While it is\n possible for client code to register the current KeyboardFocusManager as\n a KeyEventPostProcessor one or more times, this is usually unnecessary and\n not recommended.)", "codes": ["@FunctionalInterface\npublic interface KeyEventPostProcessor"], "fields": [], "methods": [{"method_name": "postProcessKeyEvent", "method_sig": "boolean postProcessKeyEvent (KeyEvent e)", "description": "This method is called by the current KeyboardFocusManager, requesting\n that this KeyEventPostProcessor perform any necessary post-processing\n which should be part of the KeyEvent's final resolution. At the time\n this method is invoked, typically the KeyEvent has already been\n dispatched to and handled by its target. However, if no Component in\n the application currently owns the focus, then the KeyEvent has not\n been dispatched to any Component. Typically, KeyEvent post-processing\n will be used to implement features which require global KeyEvent\n post-handling, such as menu shortcuts. Note that if a\n KeyEventPostProcessor wishes to dispatch the KeyEvent, it must use\n redispatchEvent to prevent the AWT from recursively\n requesting that this KeyEventPostProcessor perform post-processing\n of the event again.\n \n If an implementation of this method returns false, then the\n KeyEvent is passed to the next KeyEventPostProcessor in the chain,\n ending with the current KeyboardFocusManager. If an implementation\n returns true, the KeyEvent is assumed to have been fully\n handled (although this need not be the case), and the AWT will take no\n further action with regard to the KeyEvent. If an implementation\n consumes the KeyEvent but returns false, the consumed\n event will still be passed to the next KeyEventPostProcessor in the\n chain. It is important for developers to check whether the KeyEvent has\n been consumed before performing any post-processing of the KeyEvent. By\n default, the current KeyboardFocusManager will perform no post-\n processing in response to a consumed KeyEvent."}]}