{"name": "Class KeyFactorySpi", "module": "java.base", "package": "java.security", "text": "This class defines the Service Provider Interface (SPI)\n for the KeyFactory class.\n All the abstract methods in this class must be implemented by each\n cryptographic service provider who wishes to supply the implementation\n of a key factory for a particular algorithm.\n\n  Key factories are used to convert keys (opaque\n cryptographic keys of type Key) into key specifications\n (transparent representations of the underlying key material), and vice\n versa.\n\n  Key factories are bi-directional. That is, they allow you to build an\n opaque key object from a given key specification (key material), or to\n retrieve the underlying key material of a key object in a suitable format.\n\n  Multiple compatible key specifications may exist for the same key.\n For example, a DSA public key may be specified using\n DSAPublicKeySpec or\n X509EncodedKeySpec. A key factory can be used to translate\n between compatible key specifications.\n\n  A provider should document all the key specifications supported by its\n key factory.", "codes": ["public abstract class KeyFactorySpi\nextends Object"], "fields": [], "methods": [{"method_name": "engineGeneratePublic", "method_sig": "protected abstract PublicKey engineGeneratePublic (KeySpec keySpec)\n                                           throws InvalidKeySpecException", "description": "Generates a public key object from the provided key\n specification (key material)."}, {"method_name": "engineGeneratePrivate", "method_sig": "protected abstract PrivateKey engineGeneratePrivate (KeySpec keySpec)\n                                             throws InvalidKeySpecException", "description": "Generates a private key object from the provided key\n specification (key material)."}, {"method_name": "engineGetKeySpec", "method_sig": "protected abstract <T extends KeySpec> T engineGetKeySpec (Key key,\n                                                          Class<T> keySpec)\n                                                   throws InvalidKeySpecException", "description": "Returns a specification (key material) of the given key\n object.\n keySpec identifies the specification class in which\n the key material should be returned. It could, for example, be\n DSAPublicKeySpec.class, to indicate that the\n key material should be returned in an instance of the\n DSAPublicKeySpec class."}, {"method_name": "engineTranslateKey", "method_sig": "protected abstract Key engineTranslateKey (Key key)\n                                   throws InvalidKeyException", "description": "Translates a key object, whose provider may be unknown or\n potentially untrusted, into a corresponding key object of this key\n factory."}]}