{"name": "Class KeyPairGeneratorSpi", "module": "java.base", "package": "java.security", "text": " This class defines the Service Provider Interface (SPI)\n for the KeyPairGenerator class, which is used to generate\n pairs of public and private keys.\n\n  All the abstract methods in this class must be implemented by each\n cryptographic service provider who wishes to supply the implementation\n of a key pair generator for a particular algorithm.\n\n  In case the client does not explicitly initialize the KeyPairGenerator\n (via a call to an initialize method), each provider must\n supply (and document) a default initialization.\n See the Keysize Restriction sections of the\n JDK Providers\n document for information on the KeyPairGenerator defaults used by\n JDK providers.\n However, note that defaults may vary across different providers.\n Additionally, the default value for a provider may change in a future\n version. Therefore, it is recommended to explicitly initialize the\n KeyPairGenerator instead of relying on provider-specific defaults.", "codes": ["public abstract class KeyPairGeneratorSpi\nextends Object"], "fields": [], "methods": [{"method_name": "initialize", "method_sig": "public abstract void initialize (int keysize,\n                                SecureRandom random)", "description": "Initializes the key pair generator for a certain keysize, using\n the default parameter set."}, {"method_name": "initialize", "method_sig": "public void initialize (AlgorithmParameterSpec params,\n                       SecureRandom random)\n                throws InvalidAlgorithmParameterException", "description": "Initializes the key pair generator using the specified parameter\n set and user-provided source of randomness.\n\n This concrete method has been added to this previously-defined\n abstract class. (For backwards compatibility, it cannot be abstract.)\n It may be overridden by a provider to initialize the key pair\n generator. Such an override\n is expected to throw an InvalidAlgorithmParameterException if\n a parameter is inappropriate for this key pair generator.\n If this method is not overridden, it always throws an\n UnsupportedOperationException."}, {"method_name": "generateKeyPair", "method_sig": "public abstract KeyPair generateKeyPair()", "description": "Generates a key pair. Unless an initialization method is called\n using a KeyPairGenerator interface, algorithm-specific defaults\n will be used. This will generate a new key pair every time it\n is called."}]}