{"name": "Class LineEvent", "module": "java.desktop", "package": "javax.sound.sampled", "text": "The LineEvent class encapsulates information that a line sends its\n listeners whenever the line opens, closes, starts, or stops. Each of these\n four state changes is represented by a corresponding type of event. A\n listener receives the event as a parameter to its\n update method. By querying the event, the\n listener can learn the type of event, the line responsible for the event, and\n how much data the line had processed when the event occurred.\n \n Although this class implements Serializable, attempts to serialize a\n LineEvent object will fail.", "codes": ["public class LineEvent\nextends EventObject"], "fields": [], "methods": [{"method_name": "getLine", "method_sig": "public final Line getLine()", "description": "Obtains the audio line that is the source of this event."}, {"method_name": "getType", "method_sig": "public final LineEvent.Type getType()", "description": "Obtains the event's type."}, {"method_name": "getFramePosition", "method_sig": "public final long getFramePosition()", "description": "Obtains the position in the line's audio data when the event occurred,\n expressed in sample frames. For example, if a source line had already\n played back 14 sample frames at the time it was paused, the pause event\n would report the line's position as 14. The next frame to be processed\n would be frame number 14 using zero-based numbering, or 15 using\n one-based numbering.\n \n Note that this field is relevant only to certain events generated by data\n lines, such as START and STOP. For events generated by\n lines that do not count sample frames, and for any other events for which\n this value is not known, the position value should be\n AudioSystem.NOT_SPECIFIED."}, {"method_name": "toString", "method_sig": "public String toString()", "description": "Obtains a string representation of the event. The contents of the string\n may vary between implementations of Java Sound."}]}