{"name": "Class LineNumberInputStream", "module": "java.base", "package": "java.io", "text": "This class is an input stream filter that provides the added\n functionality of keeping track of the current line number.\n \n A line is a sequence of bytes ending with a carriage return\n character ('\\r'), a newline character\n ('\\n'), or a carriage return character followed\n immediately by a linefeed character. In all three cases, the line\n terminating character(s) are returned as a single newline character.\n \n The line number begins at 0, and is incremented by\n 1 when a read returns a newline character.", "codes": ["@Deprecated\npublic class LineNumberInputStream\nextends FilterInputStream"], "fields": [], "methods": [{"method_name": "read", "method_sig": "public int read()\n         throws IOException", "description": "Reads the next byte of data from this input stream. The value\n byte is returned as an int in the range\n 0 to 255. If no byte is available\n because the end of the stream has been reached, the value\n -1 is returned. This method blocks until input data\n is available, the end of the stream is detected, or an exception\n is thrown.\n \n The read method of\n LineNumberInputStream calls the read\n method of the underlying input stream. It checks for carriage\n returns and newline characters in the input, and modifies the\n current line number as appropriate. A carriage-return character or\n a carriage return followed by a newline character are both\n converted into a single newline character."}, {"method_name": "read", "method_sig": "public int read (byte[] b,\n                int off,\n                int len)\n         throws IOException", "description": "Reads up to len bytes of data from this input stream\n into an array of bytes. This method blocks until some input is available.\n \n The read method of\n LineNumberInputStream repeatedly calls the\n read method of zero arguments to fill in the byte array."}, {"method_name": "skip", "method_sig": "public long skip (long n)\n          throws IOException", "description": "Skips over and discards n bytes of data from this\n input stream. The skip method may, for a variety of\n reasons, end up skipping over some smaller number of bytes,\n possibly 0. The actual number of bytes skipped is\n returned.  If n is negative, no bytes are skipped.\n \n The skip method of LineNumberInputStream creates\n a byte array and then repeatedly reads into it until\n n bytes have been read or the end of the stream has\n been reached."}, {"method_name": "setLineNumber", "method_sig": "public void setLineNumber (int lineNumber)", "description": "Sets the line number to the specified argument."}, {"method_name": "getLineNumber", "method_sig": "public int getLineNumber()", "description": "Returns the current line number."}, {"method_name": "available", "method_sig": "public int available()\n              throws IOException", "description": "Returns the number of bytes that can be read from this input\n stream without blocking.\n \n Note that if the underlying input stream is able to supply\n k input characters without blocking, the\n LineNumberInputStream can guarantee only to provide\n k/2 characters without blocking, because the\n k characters from the underlying input stream might\n consist of k/2 pairs of '\\r' and\n '\\n', which are converted to just\n k/2 '\\n' characters."}, {"method_name": "mark", "method_sig": "public void mark (int readlimit)", "description": "Marks the current position in this input stream. A subsequent\n call to the reset method repositions this stream at\n the last marked position so that subsequent reads re-read the same bytes.\n \n The mark method of\n LineNumberInputStream remembers the current line\n number in a private variable, and then calls the mark\n method of the underlying input stream."}, {"method_name": "reset", "method_sig": "public void reset()\n           throws IOException", "description": "Repositions this stream to the position at the time the\n mark method was last called on this input stream.\n \n The reset method of\n LineNumberInputStream resets the line number to be\n the line number at the time the mark method was\n called, and then calls the reset method of the\n underlying input stream.\n \n Stream marks are intended to be used in\n situations where you need to read ahead a little to see what's in\n the stream. Often this is most easily done by invoking some\n general parser. If the stream is of the type handled by the\n parser, it just chugs along happily. If the stream is not of\n that type, the parser should toss an exception when it fails,\n which, if it happens within readlimit bytes, allows the outer\n code to reset the stream and try another parser."}]}