{"name": "Class LinkedList<E>", "module": "java.base", "package": "java.util", "text": "Doubly-linked list implementation of the List and Deque\n interfaces.  Implements all optional list operations, and permits all\n elements (including null).\n\n All of the operations perform as could be expected for a doubly-linked\n list.  Operations that index into the list will traverse the list from\n the beginning or the end, whichever is closer to the specified index.\n\n Note that this implementation is not synchronized.\n If multiple threads access a linked list concurrently, and at least\n one of the threads modifies the list structurally, it must be\n synchronized externally.  (A structural modification is any operation\n that adds or deletes one or more elements; merely setting the value of\n an element is not a structural modification.)  This is typically\n accomplished by synchronizing on some object that naturally\n encapsulates the list.\n\n If no such object exists, the list should be \"wrapped\" using the\n Collections.synchronizedList\n method.  This is best done at creation time, to prevent accidental\n unsynchronized access to the list:\n   List list = Collections.synchronizedList(new LinkedList(...));\nThe iterators returned by this class's iterator and\n listIterator methods are fail-fast: if the list is\n structurally modified at any time after the iterator is created, in\n any way except through the Iterator's own remove or\n add methods, the iterator will throw a ConcurrentModificationException.  Thus, in the face of concurrent\n modification, the iterator fails quickly and cleanly, rather than\n risking arbitrary, non-deterministic behavior at an undetermined\n time in the future.\n\n Note that the fail-fast behavior of an iterator cannot be guaranteed\n as it is, generally speaking, impossible to make any hard guarantees in the\n presence of unsynchronized concurrent modification.  Fail-fast iterators\n throw ConcurrentModificationException on a best-effort basis.\n Therefore, it would be wrong to write a program that depended on this\n exception for its correctness:   the fail-fast behavior of iterators\n should be used only to detect bugs.\nThis class is a member of the\n \n Java Collections Framework.", "codes": ["public class LinkedList<E>\nextends AbstractSequentialList<E>\nimplements List<E>, Deque<E>, Cloneable, Serializable"], "fields": [], "methods": [{"method_name": "getFirst", "method_sig": "public E getFirst()", "description": "Returns the first element in this list."}, {"method_name": "getLast", "method_sig": "public E getLast()", "description": "Returns the last element in this list."}, {"method_name": "removeFirst", "method_sig": "public E removeFirst()", "description": "Removes and returns the first element from this list."}, {"method_name": "removeLast", "method_sig": "public E removeLast()", "description": "Removes and returns the last element from this list."}, {"method_name": "addFirst", "method_sig": "public void addFirst (E e)", "description": "Inserts the specified element at the beginning of this list."}, {"method_name": "addLast", "method_sig": "public void addLast (E e)", "description": "Appends the specified element to the end of this list.\n\n This method is equivalent to add(E)."}, {"method_name": "contains", "method_sig": "public boolean contains (Object o)", "description": "Returns true if this list contains the specified element.\n More formally, returns true if and only if this list contains\n at least one element e such that\n Objects.equals(o, e)."}, {"method_name": "size", "method_sig": "public int size()", "description": "Returns the number of elements in this list."}, {"method_name": "add", "method_sig": "public boolean add (E e)", "description": "Appends the specified element to the end of this list.\n\n This method is equivalent to addLast(E)."}, {"method_name": "remove", "method_sig": "public boolean remove (Object o)", "description": "Removes the first occurrence of the specified element from this list,\n if it is present.  If this list does not contain the element, it is\n unchanged.  More formally, removes the element with the lowest index\n i such that\n Objects.equals(o, get(i))\n (if such an element exists).  Returns true if this list\n contained the specified element (or equivalently, if this list\n changed as a result of the call)."}, {"method_name": "addAll", "method_sig": "public boolean addAll (Collection<? extends E> c)", "description": "Appends all of the elements in the specified collection to the end of\n this list, in the order that they are returned by the specified\n collection's iterator.  The behavior of this operation is undefined if\n the specified collection is modified while the operation is in\n progress.  (Note that this will occur if the specified collection is\n this list, and it's nonempty.)"}, {"method_name": "addAll", "method_sig": "public boolean addAll (int index,\n                      Collection<? extends E> c)", "description": "Inserts all of the elements in the specified collection into this\n list, starting at the specified position.  Shifts the element\n currently at that position (if any) and any subsequent elements to\n the right (increases their indices).  The new elements will appear\n in the list in the order that they are returned by the\n specified collection's iterator."}, {"method_name": "clear", "method_sig": "public void clear()", "description": "Removes all of the elements from this list.\n The list will be empty after this call returns."}, {"method_name": "get", "method_sig": "public E get (int index)", "description": "Returns the element at the specified position in this list."}, {"method_name": "set", "method_sig": "public E set (int index,\n             E element)", "description": "Replaces the element at the specified position in this list with the\n specified element."}, {"method_name": "add", "method_sig": "public void add (int index,\n                E element)", "description": "Inserts the specified element at the specified position in this list.\n Shifts the element currently at that position (if any) and any\n subsequent elements to the right (adds one to their indices)."}, {"method_name": "remove", "method_sig": "public E remove (int index)", "description": "Removes the element at the specified position in this list.  Shifts any\n subsequent elements to the left (subtracts one from their indices).\n Returns the element that was removed from the list."}, {"method_name": "indexOf", "method_sig": "public int indexOf (Object o)", "description": "Returns the index of the first occurrence of the specified element\n in this list, or -1 if this list does not contain the element.\n More formally, returns the lowest index i such that\n Objects.equals(o, get(i)),\n or -1 if there is no such index."}, {"method_name": "lastIndexOf", "method_sig": "public int lastIndexOf (Object o)", "description": "Returns the index of the last occurrence of the specified element\n in this list, or -1 if this list does not contain the element.\n More formally, returns the highest index i such that\n Objects.equals(o, get(i)),\n or -1 if there is no such index."}, {"method_name": "peek", "method_sig": "public E peek()", "description": "Retrieves, but does not remove, the head (first element) of this list."}, {"method_name": "element", "method_sig": "public E element()", "description": "Retrieves, but does not remove, the head (first element) of this list."}, {"method_name": "poll", "method_sig": "public E poll()", "description": "Retrieves and removes the head (first element) of this list."}, {"method_name": "remove", "method_sig": "public E remove()", "description": "Retrieves and removes the head (first element) of this list."}, {"method_name": "offer", "method_sig": "public boolean offer (E e)", "description": "Adds the specified element as the tail (last element) of this list."}, {"method_name": "offerFirst", "method_sig": "public boolean offerFirst (E e)", "description": "Inserts the specified element at the front of this list."}, {"method_name": "offerLast", "method_sig": "public boolean offerLast (E e)", "description": "Inserts the specified element at the end of this list."}, {"method_name": "peekFirst", "method_sig": "public E peekFirst()", "description": "Retrieves, but does not remove, the first element of this list,\n or returns null if this list is empty."}, {"method_name": "peekLast", "method_sig": "public E peekLast()", "description": "Retrieves, but does not remove, the last element of this list,\n or returns null if this list is empty."}, {"method_name": "pollFirst", "method_sig": "public E pollFirst()", "description": "Retrieves and removes the first element of this list,\n or returns null if this list is empty."}, {"method_name": "pollLast", "method_sig": "public E pollLast()", "description": "Retrieves and removes the last element of this list,\n or returns null if this list is empty."}, {"method_name": "push", "method_sig": "public void push (E e)", "description": "Pushes an element onto the stack represented by this list.  In other\n words, inserts the element at the front of this list.\n\n This method is equivalent to addFirst(E)."}, {"method_name": "pop", "method_sig": "public E pop()", "description": "Pops an element from the stack represented by this list.  In other\n words, removes and returns the first element of this list.\n\n This method is equivalent to removeFirst()."}, {"method_name": "removeFirstOccurrence", "method_sig": "public boolean removeFirstOccurrence (Object o)", "description": "Removes the first occurrence of the specified element in this\n list (when traversing the list from head to tail).  If the list\n does not contain the element, it is unchanged."}, {"method_name": "removeLastOccurrence", "method_sig": "public boolean removeLastOccurrence (Object o)", "description": "Removes the last occurrence of the specified element in this\n list (when traversing the list from head to tail).  If the list\n does not contain the element, it is unchanged."}, {"method_name": "listIterator", "method_sig": "public ListIterator<E> listIterator (int index)", "description": "Returns a list-iterator of the elements in this list (in proper\n sequence), starting at the specified position in the list.\n Obeys the general contract of List.listIterator(int).\n\n The list-iterator is fail-fast: if the list is structurally\n modified at any time after the Iterator is created, in any way except\n through the list-iterator's own remove or add\n methods, the list-iterator will throw a\n ConcurrentModificationException.  Thus, in the face of\n concurrent modification, the iterator fails quickly and cleanly, rather\n than risking arbitrary, non-deterministic behavior at an undetermined\n time in the future."}, {"method_name": "descendingIterator", "method_sig": "public Iterator<E> descendingIterator()", "description": "Description copied from interface: Deque"}, {"method_name": "clone", "method_sig": "public Object clone()", "description": "Returns a shallow copy of this LinkedList. (The elements\n themselves are not cloned.)"}, {"method_name": "toArray", "method_sig": "public Object[] toArray()", "description": "Returns an array containing all of the elements in this list\n in proper sequence (from first to last element).\n\n The returned array will be \"safe\" in that no references to it are\n maintained by this list.  (In other words, this method must allocate\n a new array).  The caller is thus free to modify the returned array.\n\n This method acts as bridge between array-based and collection-based\n APIs."}, {"method_name": "toArray", "method_sig": "public <T> T[] toArray (T[] a)", "description": "Returns an array containing all of the elements in this list in\n proper sequence (from first to last element); the runtime type of\n the returned array is that of the specified array.  If the list fits\n in the specified array, it is returned therein.  Otherwise, a new\n array is allocated with the runtime type of the specified array and\n the size of this list.\n\n If the list fits in the specified array with room to spare (i.e.,\n the array has more elements than the list), the element in the array\n immediately following the end of the list is set to null.\n (This is useful in determining the length of the list only if\n the caller knows that the list does not contain any null elements.)\n\n Like the toArray() method, this method acts as bridge between\n array-based and collection-based APIs.  Further, this method allows\n precise control over the runtime type of the output array, and may,\n under certain circumstances, be used to save allocation costs.\n\n Suppose x is a list known to contain only strings.\n The following code can be used to dump the list into a newly\n allocated array of String:\n\n \n     String[] y = x.toArray(new String[0]);\n\n Note that toArray(new Object[0]) is identical in function to\n toArray()."}, {"method_name": "spliterator", "method_sig": "public Spliterator<E> spliterator()", "description": "Creates a late-binding\n and fail-fast Spliterator over the elements in this\n list.\n\n The Spliterator reports Spliterator.SIZED and\n Spliterator.ORDERED.  Overriding implementations should document\n the reporting of additional characteristic values."}]}