{"name": "Interface List<E>", "module": "java.base", "package": "java.util", "text": "An ordered collection (also known as a sequence).  The user of this\n interface has precise control over where in the list each element is\n inserted.  The user can access elements by their integer index (position in\n the list), and search for elements in the list.\n\n Unlike sets, lists typically allow duplicate elements.  More formally,\n lists typically allow pairs of elements e1 and e2\n such that e1.equals(e2), and they typically allow multiple\n null elements if they allow null elements at all.  It is not inconceivable\n that someone might wish to implement a list that prohibits duplicates, by\n throwing runtime exceptions when the user attempts to insert them, but we\n expect this usage to be rare.\n\n The List interface places additional stipulations, beyond those\n specified in the Collection interface, on the contracts of the\n iterator, add, remove, equals, and\n hashCode methods.  Declarations for other inherited methods are\n also included here for convenience.\n\n The List interface provides four methods for positional (indexed)\n access to list elements.  Lists (like Java arrays) are zero based.  Note\n that these operations may execute in time proportional to the index value\n for some implementations (the LinkedList class, for\n example). Thus, iterating over the elements in a list is typically\n preferable to indexing through it if the caller does not know the\n implementation.\n\n The List interface provides a special iterator, called a\n ListIterator, that allows element insertion and replacement, and\n bidirectional access in addition to the normal operations that the\n Iterator interface provides.  A method is provided to obtain a\n list iterator that starts at a specified position in the list.\n\n The List interface provides two methods to search for a specified\n object.  From a performance standpoint, these methods should be used with\n caution.  In many implementations they will perform costly linear\n searches.\n\n The List interface provides two methods to efficiently insert and\n remove multiple elements at an arbitrary point in the list.\n\n Note: While it is permissible for lists to contain themselves as elements,\n extreme caution is advised: the equals and hashCode\n methods are no longer well defined on such a list.\n\n Some list implementations have restrictions on the elements that\n they may contain.  For example, some implementations prohibit null elements,\n and some have restrictions on the types of their elements.  Attempting to\n add an ineligible element throws an unchecked exception, typically\n NullPointerException or ClassCastException.  Attempting\n to query the presence of an ineligible element may throw an exception,\n or it may simply return false; some implementations will exhibit the former\n behavior and some will exhibit the latter.  More generally, attempting an\n operation on an ineligible element whose completion would not result in\n the insertion of an ineligible element into the list may throw an\n exception or it may succeed, at the option of the implementation.\n Such exceptions are marked as \"optional\" in the specification for this\n interface.\n\n Unmodifiable Lists\nThe List.of and\n List.copyOf static factory methods\n provide a convenient way to create unmodifiable lists. The List\n instances created by these methods have the following characteristics:\n\n \nThey are unmodifiable. Elements cannot\n be added, removed, or replaced. Calling any mutator method on the List\n will always cause UnsupportedOperationException to be thrown.\n However, if the contained elements are themselves mutable,\n this may cause the List's contents to appear to change.\n They disallow null elements. Attempts to create them with\n null elements result in NullPointerException.\n They are serializable if all elements are serializable.\n The order of elements in the list is the same as the order of the\n provided arguments, or of the elements in the provided array.\n They are value-based.\n Callers should make no assumptions about the identity of the returned instances.\n Factories are free to create new instances or reuse existing ones. Therefore,\n identity-sensitive operations on these instances (reference equality (==),\n identity hash code, and synchronization) are unreliable and should be avoided.\n They are serialized as specified on the\n Serialized Form\n page.\n \nThis interface is a member of the\n \n Java Collections Framework.", "codes": ["public interface List<E>\nextends Collection<E>"], "fields": [], "methods": [{"method_name": "size", "method_sig": "int size()", "description": "Returns the number of elements in this list.  If this list contains\n more than Integer.MAX_VALUE elements, returns\n Integer.MAX_VALUE."}, {"method_name": "isEmpty", "method_sig": "boolean isEmpty()", "description": "Returns true if this list contains no elements."}, {"method_name": "contains", "method_sig": "boolean contains (Object o)", "description": "Returns true if this list contains the specified element.\n More formally, returns true if and only if this list contains\n at least one element e such that\n Objects.equals(o, e)."}, {"method_name": "iterator", "method_sig": "Iterator<E> iterator()", "description": "Returns an iterator over the elements in this list in proper sequence."}, {"method_name": "toArray", "method_sig": "Object[] toArray()", "description": "Returns an array containing all of the elements in this list in proper\n sequence (from first to last element).\n\n The returned array will be \"safe\" in that no references to it are\n maintained by this list.  (In other words, this method must\n allocate a new array even if this list is backed by an array).\n The caller is thus free to modify the returned array.\n\n This method acts as bridge between array-based and collection-based\n APIs."}, {"method_name": "toArray", "method_sig": "<T> T[] toArray (T[] a)", "description": "Returns an array containing all of the elements in this list in\n proper sequence (from first to last element); the runtime type of\n the returned array is that of the specified array.  If the list fits\n in the specified array, it is returned therein.  Otherwise, a new\n array is allocated with the runtime type of the specified array and\n the size of this list.\n\n If the list fits in the specified array with room to spare (i.e.,\n the array has more elements than the list), the element in the array\n immediately following the end of the list is set to null.\n (This is useful in determining the length of the list only if\n the caller knows that the list does not contain any null elements.)\n\n Like the toArray() method, this method acts as bridge between\n array-based and collection-based APIs.  Further, this method allows\n precise control over the runtime type of the output array, and may,\n under certain circumstances, be used to save allocation costs.\n\n Suppose x is a list known to contain only strings.\n The following code can be used to dump the list into a newly\n allocated array of String:\n\n \n     String[] y = x.toArray(new String[0]);\n \n\n Note that toArray(new Object[0]) is identical in function to\n toArray()."}, {"method_name": "add", "method_sig": "boolean add (E e)", "description": "Appends the specified element to the end of this list (optional\n operation).\n\n Lists that support this operation may place limitations on what\n elements may be added to this list.  In particular, some\n lists will refuse to add null elements, and others will impose\n restrictions on the type of elements that may be added.  List\n classes should clearly specify in their documentation any restrictions\n on what elements may be added."}, {"method_name": "remove", "method_sig": "boolean remove (Object o)", "description": "Removes the first occurrence of the specified element from this list,\n if it is present (optional operation).  If this list does not contain\n the element, it is unchanged.  More formally, removes the element with\n the lowest index i such that\n Objects.equals(o, get(i))\n (if such an element exists).  Returns true if this list\n contained the specified element (or equivalently, if this list changed\n as a result of the call)."}, {"method_name": "containsAll", "method_sig": "boolean containsAll (Collection<?> c)", "description": "Returns true if this list contains all of the elements of the\n specified collection."}, {"method_name": "addAll", "method_sig": "boolean addAll (Collection<? extends E> c)", "description": "Appends all of the elements in the specified collection to the end of\n this list, in the order that they are returned by the specified\n collection's iterator (optional operation).  The behavior of this\n operation is undefined if the specified collection is modified while\n the operation is in progress.  (Note that this will occur if the\n specified collection is this list, and it's nonempty.)"}, {"method_name": "addAll", "method_sig": "boolean addAll (int index,\n               Collection<? extends E> c)", "description": "Inserts all of the elements in the specified collection into this\n list at the specified position (optional operation).  Shifts the\n element currently at that position (if any) and any subsequent\n elements to the right (increases their indices).  The new elements\n will appear in this list in the order that they are returned by the\n specified collection's iterator.  The behavior of this operation is\n undefined if the specified collection is modified while the\n operation is in progress.  (Note that this will occur if the specified\n collection is this list, and it's nonempty.)"}, {"method_name": "removeAll", "method_sig": "boolean removeAll (Collection<?> c)", "description": "Removes from this list all of its elements that are contained in the\n specified collection (optional operation)."}, {"method_name": "retainAll", "method_sig": "boolean retainAll (Collection<?> c)", "description": "Retains only the elements in this list that are contained in the\n specified collection (optional operation).  In other words, removes\n from this list all of its elements that are not contained in the\n specified collection."}, {"method_name": "replaceAll", "method_sig": "default void replaceAll (UnaryOperator<E> operator)", "description": "Replaces each element of this list with the result of applying the\n operator to that element.  Errors or runtime exceptions thrown by\n the operator are relayed to the caller."}, {"method_name": "sort", "method_sig": "default void sort (Comparator<? super E> c)", "description": "Sorts this list according to the order induced by the specified\n Comparator.  The sort is stable: this method must not\n reorder equal elements.\n\n All elements in this list must be mutually comparable using the\n specified comparator (that is, c.compare(e1, e2) must not throw\n a ClassCastException for any elements e1 and e2\n in the list).\n\n If the specified comparator is null then all elements in this\n list must implement the Comparable interface and the elements'\n natural ordering should be used.\n\n This list must be modifiable, but need not be resizable."}, {"method_name": "clear", "method_sig": "void clear()", "description": "Removes all of the elements from this list (optional operation).\n The list will be empty after this call returns."}, {"method_name": "equals", "method_sig": "boolean equals (Object o)", "description": "Compares the specified object with this list for equality.  Returns\n true if and only if the specified object is also a list, both\n lists have the same size, and all corresponding pairs of elements in\n the two lists are equal.  (Two elements e1 and\n e2 are equal if Objects.equals(e1, e2).)\n In other words, two lists are defined to be\n equal if they contain the same elements in the same order.  This\n definition ensures that the equals method works properly across\n different implementations of the List interface."}, {"method_name": "hashCode", "method_sig": "int hashCode()", "description": "Returns the hash code value for this list.  The hash code of a list\n is defined to be the result of the following calculation:\n \n     int hashCode = 1;\n     for (E e : list)\n         hashCode = 31*hashCode + (e==null ? 0 : e.hashCode());\n \n This ensures that list1.equals(list2) implies that\n list1.hashCode()==list2.hashCode() for any two lists,\n list1 and list2, as required by the general\n contract of Object.hashCode()."}, {"method_name": "get", "method_sig": "E get (int index)", "description": "Returns the element at the specified position in this list."}, {"method_name": "set", "method_sig": "E set (int index,\n      E element)", "description": "Replaces the element at the specified position in this list with the\n specified element (optional operation)."}, {"method_name": "add", "method_sig": "void add (int index,\n         E element)", "description": "Inserts the specified element at the specified position in this list\n (optional operation).  Shifts the element currently at that position\n (if any) and any subsequent elements to the right (adds one to their\n indices)."}, {"method_name": "remove", "method_sig": "E remove (int index)", "description": "Removes the element at the specified position in this list (optional\n operation).  Shifts any subsequent elements to the left (subtracts one\n from their indices).  Returns the element that was removed from the\n list."}, {"method_name": "indexOf", "method_sig": "int indexOf (Object o)", "description": "Returns the index of the first occurrence of the specified element\n in this list, or -1 if this list does not contain the element.\n More formally, returns the lowest index i such that\n Objects.equals(o, get(i)),\n or -1 if there is no such index."}, {"method_name": "lastIndexOf", "method_sig": "int lastIndexOf (Object o)", "description": "Returns the index of the last occurrence of the specified element\n in this list, or -1 if this list does not contain the element.\n More formally, returns the highest index i such that\n Objects.equals(o, get(i)),\n or -1 if there is no such index."}, {"method_name": "listIterator", "method_sig": "ListIterator<E> listIterator()", "description": "Returns a list iterator over the elements in this list (in proper\n sequence)."}, {"method_name": "listIterator", "method_sig": "ListIterator<E> listIterator (int index)", "description": "Returns a list iterator over the elements in this list (in proper\n sequence), starting at the specified position in the list.\n The specified index indicates the first element that would be\n returned by an initial call to next.\n An initial call to previous would\n return the element with the specified index minus one."}, {"method_name": "subList", "method_sig": "List<E> subList (int fromIndex,\n                int toIndex)", "description": "Returns a view of the portion of this list between the specified\n fromIndex, inclusive, and toIndex, exclusive.  (If\n fromIndex and toIndex are equal, the returned list is\n empty.)  The returned list is backed by this list, so non-structural\n changes in the returned list are reflected in this list, and vice-versa.\n The returned list supports all of the optional list operations supported\n by this list.\n\n This method eliminates the need for explicit range operations (of\n the sort that commonly exist for arrays).  Any operation that expects\n a list can be used as a range operation by passing a subList view\n instead of a whole list.  For example, the following idiom\n removes a range of elements from a list:\n \n      list.subList(from, to).clear();\n \n Similar idioms may be constructed for indexOf and\n lastIndexOf, and all of the algorithms in the\n Collections class can be applied to a subList.\n\n The semantics of the list returned by this method become undefined if\n the backing list (i.e., this list) is structurally modified in\n any way other than via the returned list.  (Structural modifications are\n those that change the size of this list, or otherwise perturb it in such\n a fashion that iterations in progress may yield incorrect results.)"}, {"method_name": "spliterator", "method_sig": "default Spliterator<E> spliterator()", "description": "Creates a Spliterator over the elements in this list.\n\n The Spliterator reports Spliterator.SIZED and\n Spliterator.ORDERED.  Implementations should document the\n reporting of additional characteristic values."}, {"method_name": "of", "method_sig": "static <E> List<E> of()", "description": "Returns an unmodifiable list containing zero elements.\n\n See Unmodifiable Lists for details."}, {"method_name": "of", "method_sig": "static <E> List<E> of (E e1)", "description": "Returns an unmodifiable list containing one element.\n\n See Unmodifiable Lists for details."}, {"method_name": "of", "method_sig": "static <E> List<E> of (E e1,\n                      E e2)", "description": "Returns an unmodifiable list containing two elements.\n\n See Unmodifiable Lists for details."}, {"method_name": "of", "method_sig": "static <E> List<E> of (E e1,\n                      E e2,\n                      E e3)", "description": "Returns an unmodifiable list containing three elements.\n\n See Unmodifiable Lists for details."}, {"method_name": "of", "method_sig": "static <E> List<E> of (E e1,\n                      E e2,\n                      E e3,\n                      E e4)", "description": "Returns an unmodifiable list containing four elements.\n\n See Unmodifiable Lists for details."}, {"method_name": "of", "method_sig": "static <E> List<E> of (E e1,\n                      E e2,\n                      E e3,\n                      E e4,\n                      E e5)", "description": "Returns an unmodifiable list containing five elements.\n\n See Unmodifiable Lists for details."}, {"method_name": "of", "method_sig": "static <E> List<E> of (E e1,\n                      E e2,\n                      E e3,\n                      E e4,\n                      E e5,\n                      E e6)", "description": "Returns an unmodifiable list containing six elements.\n\n See Unmodifiable Lists for details."}, {"method_name": "of", "method_sig": "static <E> List<E> of (E e1,\n                      E e2,\n                      E e3,\n                      E e4,\n                      E e5,\n                      E e6,\n                      E e7)", "description": "Returns an unmodifiable list containing seven elements.\n\n See Unmodifiable Lists for details."}, {"method_name": "of", "method_sig": "static <E> List<E> of (E e1,\n                      E e2,\n                      E e3,\n                      E e4,\n                      E e5,\n                      E e6,\n                      E e7,\n                      E e8)", "description": "Returns an unmodifiable list containing eight elements.\n\n See Unmodifiable Lists for details."}, {"method_name": "of", "method_sig": "static <E> List<E> of (E e1,\n                      E e2,\n                      E e3,\n                      E e4,\n                      E e5,\n                      E e6,\n                      E e7,\n                      E e8,\n                      E e9)", "description": "Returns an unmodifiable list containing nine elements.\n\n See Unmodifiable Lists for details."}, {"method_name": "of", "method_sig": "static <E> List<E> of (E e1,\n                      E e2,\n                      E e3,\n                      E e4,\n                      E e5,\n                      E e6,\n                      E e7,\n                      E e8,\n                      E e9,\n                      E e10)", "description": "Returns an unmodifiable list containing ten elements.\n\n See Unmodifiable Lists for details."}, {"method_name": "of", "method_sig": "@SafeVarargs\nstatic <E> List<E> of (E... elements)", "description": "Returns an unmodifiable list containing an arbitrary number of elements.\n See Unmodifiable Lists for details."}, {"method_name": "copyOf", "method_sig": "static <E> List<E> copyOf (Collection<? extends E> coll)", "description": "Returns an unmodifiable List containing the elements of\n the given Collection, in its iteration order. The given Collection must not be null,\n and it must not contain any null elements. If the given Collection is subsequently\n modified, the returned List will not reflect such modifications."}]}