{"name": "Class Locale.Builder", "module": "java.base", "package": "java.util", "text": "Builder is used to build instances of Locale\n from values configured by the setters.  Unlike the Locale\n constructors, the Builder checks if a value configured by a\n setter satisfies the syntax requirements defined by the Locale\n class.  A Locale object created by a Builder is\n well-formed and can be transformed to a well-formed IETF BCP 47 language tag\n without losing information.\n\n Note: The Locale class does not provide any\n syntactic restrictions on variant, while BCP 47 requires each variant\n subtag to be 5 to 8 alphanumerics or a single numeric followed by 3\n alphanumerics.  The method setVariant throws\n IllformedLocaleException for a variant that does not satisfy\n this restriction. If it is necessary to support such a variant, use a\n Locale constructor.  However, keep in mind that a Locale\n object created this way might lose the variant information when\n transformed to a BCP 47 language tag.\n\n The following example shows how to create a Locale object\n with the Builder.\n \n\n     Locale aLocale = new Builder().setLanguage(\"sr\").setScript(\"Latn\").setRegion(\"RS\").build();\n \n\nBuilders can be reused; clear() resets all\n fields to their default values.", "codes": ["public static final class Locale.Builder\nextends Object"], "fields": [], "methods": [{"method_name": "setLocale", "method_sig": "public Locale.Builder setLocale (Locale locale)", "description": "Resets the Builder to match the provided\n locale.  Existing state is discarded.\n\n All fields of the locale must be well-formed, see Locale.\n\n Locales with any ill-formed fields cause\n IllformedLocaleException to be thrown, except for the\n following three cases which are accepted for compatibility\n reasons:\nLocale(\"ja\", \"JP\", \"JP\") is treated as \"ja-JP-u-ca-japanese\"\n Locale(\"th\", \"TH\", \"TH\") is treated as \"th-TH-u-nu-thai\"\n Locale(\"no\", \"NO\", \"NY\") is treated as \"nn-NO\""}, {"method_name": "setLanguageTag", "method_sig": "public Locale.Builder setLanguageTag (String languageTag)", "description": "Resets the Builder to match the provided IETF BCP 47\n language tag.  Discards the existing state.  Null and the\n empty string cause the builder to be reset, like clear().  Grandfathered tags (see Locale.forLanguageTag(java.lang.String)) are converted to their canonical\n form before being processed.  Otherwise, the language tag\n must be well-formed (see Locale) or an exception is\n thrown (unlike Locale.forLanguageTag, which\n just discards ill-formed and following portions of the\n tag)."}, {"method_name": "setLanguage", "method_sig": "public Locale.Builder setLanguage (String language)", "description": "Sets the language.  If language is the empty string or\n null, the language in this Builder is removed.  Otherwise,\n the language must be well-formed\n or an exception is thrown.\n\n The typical language value is a two or three-letter language\n code as defined in ISO639."}, {"method_name": "setScript", "method_sig": "public Locale.Builder setScript (String script)", "description": "Sets the script. If script is null or the empty string,\n the script in this Builder is removed.\n Otherwise, the script must be well-formed or an\n exception is thrown.\n\n The typical script value is a four-letter script code as defined by ISO 15924."}, {"method_name": "setRegion", "method_sig": "public Locale.Builder setRegion (String region)", "description": "Sets the region.  If region is null or the empty string, the region\n in this Builder is removed.  Otherwise,\n the region must be well-formed or an\n exception is thrown.\n\n The typical region value is a two-letter ISO 3166 code or a\n three-digit UN M.49 area code.\n\n The country value in the Locale created by the\n Builder is always normalized to upper case."}, {"method_name": "setVariant", "method_sig": "public Locale.Builder setVariant (String variant)", "description": "Sets the variant.  If variant is null or the empty string, the\n variant in this Builder is removed.  Otherwise, it\n must consist of one or more well-formed\n subtags, or an exception is thrown.\n\n Note: This method checks if variant\n satisfies the IETF BCP 47 variant subtag's syntax requirements,\n and normalizes the value to lowercase letters.  However,\n the Locale class does not impose any syntactic\n restriction on variant, and the variant value in\n Locale is case sensitive.  To set such a variant,\n use a Locale constructor."}, {"method_name": "setExtension", "method_sig": "public Locale.Builder setExtension (char key,\n                                   String value)", "description": "Sets the extension for the given key. If the value is null or the\n empty string, the extension is removed.  Otherwise, the extension\n must be well-formed or an exception\n is thrown.\n\n Note: The key UNICODE_LOCALE_EXTENSION ('u') is used for the Unicode locale extension.\n Setting a value for this key replaces any existing Unicode locale key/type\n pairs with those defined in the extension.\n\n Note: The key PRIVATE_USE_EXTENSION ('x') is used for the private use code. To be\n well-formed, the value for this key needs only to have subtags of one to\n eight alphanumeric characters, not two to eight as in the general case."}, {"method_name": "setUnicodeLocaleKeyword", "method_sig": "public Locale.Builder setUnicodeLocaleKeyword (String key,\n                                              String type)", "description": "Sets the Unicode locale keyword type for the given key.  If the type\n is null, the Unicode keyword is removed.  Otherwise, the key must be\n non-null and both key and type must be well-formed or an exception\n is thrown.\n\n Keys and types are converted to lower case.\n\n Note:Setting the 'u' extension via setExtension(char, java.lang.String)\n replaces all Unicode locale keywords with those defined in the\n extension."}, {"method_name": "addUnicodeLocaleAttribute", "method_sig": "public Locale.Builder addUnicodeLocaleAttribute (String attribute)", "description": "Adds a unicode locale attribute, if not already present, otherwise\n has no effect.  The attribute must not be null and must be well-formed or an exception\n is thrown."}, {"method_name": "removeUnicodeLocaleAttribute", "method_sig": "public Locale.Builder removeUnicodeLocaleAttribute (String attribute)", "description": "Removes a unicode locale attribute, if present, otherwise has no\n effect.  The attribute must not be null and must be well-formed or an exception\n is thrown.\n\n Attribute comparison for removal is case-insensitive."}, {"method_name": "clear", "method_sig": "public Locale.Builder clear()", "description": "Resets the builder to its initial, empty state."}, {"method_name": "clearExtensions", "method_sig": "public Locale.Builder clearExtensions()", "description": "Resets the extensions to their initial, empty state.\n Language, script, region and variant are unchanged."}, {"method_name": "build", "method_sig": "public Locale build()", "description": "Returns an instance of Locale created from the fields set\n on this builder.\n\n This applies the conversions listed in Locale.forLanguageTag(java.lang.String)\n when constructing a Locale. (Grandfathered tags are handled in\n setLanguageTag(java.lang.String).)"}]}