{"name": "Interface Locator2", "module": "java.xml", "package": "org.xml.sax.ext", "text": "SAX2 extension to augment the entity information provided\n though a Locator.\n If an implementation supports this extension, the Locator\n provided in ContentHandler.setDocumentLocator()  will implement this\n interface, and the\n http://xml.org/sax/features/use-locator2 feature\n flag will have the value true.\n\n \nThis module, both source code and documentation, is in the\n Public Domain, and comes with NO WARRANTY.\n\n XMLReader implementations are not required to support this\n information, and it is not part of core-only SAX2 distributions.", "codes": ["public interface Locator2\nextends Locator"], "fields": [], "methods": [{"method_name": "getXMLVersion", "method_sig": "String getXMLVersion()", "description": "Returns the version of XML used for the entity.  This will\n normally be the identifier from the current entity's\n <?xml version='...' ...?> declaration,\n or be defaulted by the parser."}, {"method_name": "getEncoding", "method_sig": "String getEncoding()", "description": "Returns the name of the character encoding for the entity.\n If the encoding was declared externally (for example, in a MIME\n Content-Type header), that will be the name returned.  Else if there\n was an <?xml ...encoding='...'?> declaration at\n the start of the document, that encoding name will be returned.\n Otherwise the encoding will been inferred (normally to be UTF-8, or\n some UTF-16 variant), and that inferred name will be returned.\n\n When an InputSource is used\n to provide an entity's character stream, this method returns the\n encoding provided in that input stream.\n\n  Note that some recent W3C specifications require that text\n in some encodings be normalized, using Unicode Normalization\n Form C, before processing.  Such normalization must be performed\n by applications, and would normally be triggered based on the\n value returned by this method.\n\n  Encoding names may be those used by the underlying JVM,\n and comparisons should be case-insensitive."}]}