{"name": "Class Logger", "module": "java.logging", "package": "java.util.logging", "text": "A Logger object is used to log messages for a specific\n system or application component.  Loggers are normally named,\n using a hierarchical dot-separated namespace.  Logger names\n can be arbitrary strings, but they should normally be based on\n the package name or class name of the logged component, such\n as java.net or javax.swing.  In addition it is possible to create\n \"anonymous\" Loggers that are not stored in the Logger namespace.\n \n Logger objects may be obtained by calls on one of the getLogger\n factory methods.  These will either create a new Logger or\n return a suitable existing Logger. It is important to note that\n the Logger returned by one of the getLogger factory methods\n may be garbage collected at any time if a strong reference to the\n Logger is not kept.\n \n Logging messages will be forwarded to registered Handler\n objects, which can forward the messages to a variety of\n destinations, including consoles, files, OS logs, etc.\n \n Each Logger keeps track of a \"parent\" Logger, which is its\n nearest existing ancestor in the Logger namespace.\n \n Each Logger has a \"Level\" associated with it.  This reflects\n a minimum Level that this logger cares about.  If a Logger's\n level is set to null, then its effective level is inherited\n from its parent, which may in turn obtain it recursively from its\n parent, and so on up the tree.\n \n The log level can be configured based on the properties from the\n logging configuration file, as described in the description\n of the LogManager class.  However it may also be dynamically changed\n by calls on the Logger.setLevel method.  If a logger's level is\n changed the change may also affect child loggers, since any child\n logger that has null as its level will inherit its\n effective level from its parent.\n \n On each logging call the Logger initially performs a cheap\n check of the request level (e.g., SEVERE or FINE) against the\n effective log level of the logger.  If the request level is\n lower than the log level, the logging call returns immediately.\n \n After passing this initial (cheap) test, the Logger will allocate\n a LogRecord to describe the logging message.  It will then call a\n Filter (if present) to do a more detailed check on whether the\n record should be published.  If that passes it will then publish\n the LogRecord to its output Handlers.  By default, loggers also\n publish to their parent's Handlers, recursively up the tree.\n \n Each Logger may have a ResourceBundle associated with it.\n The ResourceBundle may be specified by name, using the\n getLogger(java.lang.String, java.lang.String) factory\n method, or by value - using the setResourceBundle method.\n This bundle will be used for localizing logging messages.\n If a Logger does not have its own ResourceBundle or resource bundle\n name, then it will inherit the ResourceBundle or resource bundle name\n from its parent, recursively up the tree.\n \n Most of the logger output methods take a \"msg\" argument.  This\n msg argument may be either a raw value or a localization key.\n During formatting, if the logger has (or inherits) a localization\n ResourceBundle and if the ResourceBundle has a mapping for\n the msg string, then the msg string is replaced by the localized value.\n Otherwise the original msg string is used.  Typically, formatters use\n java.text.MessageFormat style formatting to format parameters, so\n for example a format string \"{0} {1}\" would format two parameters\n as strings.\n \n A set of methods alternatively take a \"msgSupplier\" instead of a \"msg\"\n argument.  These methods take a Supplier<String> function\n which is invoked to construct the desired log message only when the message\n actually is to be logged based on the effective log level thus eliminating\n unnecessary message construction. For example, if the developer wants to\n log system health status for diagnosis, with the String-accepting version,\n the code would look like:\n \n\n  class DiagnosisMessages {\n    static String systemHealthStatus() {\n      // collect system health information\n      ...\n    }\n  }\n  ...\n  logger.log(Level.FINER, DiagnosisMessages.systemHealthStatus());\n \n With the above code, the health status is collected unnecessarily even when\n the log level FINER is disabled. With the Supplier-accepting version as\n below, the status will only be collected when the log level FINER is\n enabled.\n \n\n  logger.log(Level.FINER, DiagnosisMessages::systemHealthStatus);\n \n\n When looking for a ResourceBundle, the logger will first look at\n whether a bundle was specified using setResourceBundle, and then\n only whether a resource bundle name was specified through the getLogger factory method.\n If no ResourceBundle or no resource bundle name is found,\n then it will use the nearest ResourceBundle or resource bundle\n name inherited from its parent tree.\n When a ResourceBundle was inherited or specified through the\n setResourceBundle method, then\n that ResourceBundle will be used. Otherwise if the logger only\n has or inherited a resource bundle name, then that resource bundle name\n will be mapped to a ResourceBundle object, using the default Locale\n at the time of logging.\n When mapping resource bundle names to\n ResourceBundle objects, the logger will first try to use the\n Thread's context class\n loader to map the given resource bundle name to a ResourceBundle.\n If the thread context class loader is null, it will try the\n system class loader\n instead.  If the ResourceBundle is still not found, it will use the\n class loader of the first caller of the getLogger factory method.\n \n Formatting (including localization) is the responsibility of\n the output Handler, which will typically call a Formatter.\n \n Note that formatting need not occur synchronously.  It may be delayed\n until a LogRecord is actually written to an external sink.\n \n The logging methods are grouped in five main categories:\n \n\n     There are a set of \"log\" methods that take a log level, a message\n     string, and optionally some parameters to the message string.\n \n     There are a set of \"logp\" methods (for \"log precise\") that are\n     like the \"log\" methods, but also take an explicit source class name\n     and method name.\n \n     There are a set of \"logrb\" method (for \"log with resource bundle\")\n     that are like the \"logp\" method, but also take an explicit resource\n     bundle object for use in localizing the log message.\n \n     There are convenience methods for tracing method entries (the\n     \"entering\" methods), method returns (the \"exiting\" methods) and\n     throwing exceptions (the \"throwing\" methods).\n \n     Finally, there are a set of convenience methods for use in the\n     very simplest cases, when a developer simply wants to log a\n     simple string at a given log level.  These methods are named\n     after the standard Level names (\"severe\", \"warning\", \"info\", etc.)\n     and take a single argument, a message string.\n \n\n For the methods that do not take an explicit source name and\n method name, the Logging framework will make a \"best effort\"\n to determine which class and method called into the logging method.\n However, it is important to realize that this automatically inferred\n information may only be approximate (or may even be quite wrong!).\n Virtual machines are allowed to do extensive optimizations when\n JITing and may entirely remove stack frames, making it impossible\n to reliably locate the calling class and method.\n \n All methods on Logger are multi-thread safe.\n \nSubclassing Information: Note that a LogManager class may\n provide its own implementation of named Loggers for any point in\n the namespace.  Therefore, any subclasses of Logger (unless they\n are implemented in conjunction with a new LogManager class) should\n take care to obtain a Logger instance from the LogManager class and\n should delegate operations such as \"isLoggable\" and \"log(LogRecord)\"\n to that instance.  Note that in order to intercept all logging\n output, subclasses need only override the log(LogRecord) method.\n All the other logging methods are implemented as calls on this\n log(LogRecord) method.", "codes": ["public class Logger\nextends Object"], "fields": [{"field_name": "GLOBAL_LOGGER_NAME", "field_sig": "public static final String GLOBAL_LOGGER_NAME", "description": "GLOBAL_LOGGER_NAME is a name for the global logger."}, {"field_name": "global", "field_sig": "@Deprecated\npublic static final Logger global", "description": "The \"global\" Logger object is provided as a convenience to developers\n who are making casual use of the Logging package.  Developers\n who are making serious use of the logging package (for example\n in products) should create and use their own Logger objects,\n with appropriate names, so that logging can be controlled on a\n suitable per-Logger granularity. Developers also need to keep a\n strong reference to their Logger objects to prevent them from\n being garbage collected."}], "methods": [{"method_name": "getGlobal", "method_sig": "public static final Logger getGlobal()", "description": "Return global logger object with the name Logger.GLOBAL_LOGGER_NAME."}, {"method_name": "getLogger", "method_sig": "public static Logger getLogger (String name)", "description": "Find or create a logger for a named subsystem.  If a logger has\n already been created with the given name it is returned.  Otherwise\n a new logger is created.\n \n If a new logger is created its log level will be configured\n based on the LogManager configuration and it will be configured\n to also send logging output to its parent's Handlers.  It will\n be registered in the LogManager global namespace.\n \n Note: The LogManager may only retain a weak reference to the newly\n created Logger. It is important to understand that a previously\n created Logger with the given name may be garbage collected at any\n time if there is no strong reference to the Logger. In particular,\n this means that two back-to-back calls like\n getLogger(\"MyLogger\").log(...) may use different Logger\n objects named \"MyLogger\" if there is no strong reference to the\n Logger named \"MyLogger\" elsewhere in the program."}, {"method_name": "getLogger", "method_sig": "public static Logger getLogger (String name,\n                               String resourceBundleName)", "description": "Find or create a logger for a named subsystem.  If a logger has\n already been created with the given name it is returned.  Otherwise\n a new logger is created.\n\n \n If a new logger is created its log level will be configured\n based on the LogManager and it will be configured to also send logging\n output to its parent's Handlers.  It will be registered in\n the LogManager global namespace.\n \n Note: The LogManager may only retain a weak reference to the newly\n created Logger. It is important to understand that a previously\n created Logger with the given name may be garbage collected at any\n time if there is no strong reference to the Logger. In particular,\n this means that two back-to-back calls like\n getLogger(\"MyLogger\", ...).log(...) may use different Logger\n objects named \"MyLogger\" if there is no strong reference to the\n Logger named \"MyLogger\" elsewhere in the program.\n \n If the named Logger already exists and does not yet have a\n localization resource bundle then the given resource bundle\n name is used. If the named Logger already exists and has\n a different resource bundle name then an IllegalArgumentException\n is thrown."}, {"method_name": "getAnonymousLogger", "method_sig": "public static Logger getAnonymousLogger()", "description": "Create an anonymous Logger.  The newly created Logger is not\n registered in the LogManager namespace.  There will be no\n access checks on updates to the logger.\n \n This factory method is primarily intended for use from applets.\n Because the resulting Logger is anonymous it can be kept private\n by the creating class.  This removes the need for normal security\n checks, which in turn allows untrusted applet code to update\n the control state of the Logger.  For example an applet can do\n a setLevel or an addHandler on an anonymous Logger.\n \n Even although the new logger is anonymous, it is configured\n to have the root logger (\"\") as its parent.  This means that\n by default it inherits its effective level and handlers\n from the root logger. Changing its parent via the\n setParent method\n will still require the security permission specified by that method."}, {"method_name": "getAnonymousLogger", "method_sig": "public static Logger getAnonymousLogger (String resourceBundleName)", "description": "Create an anonymous Logger.  The newly created Logger is not\n registered in the LogManager namespace.  There will be no\n access checks on updates to the logger.\n \n This factory method is primarily intended for use from applets.\n Because the resulting Logger is anonymous it can be kept private\n by the creating class.  This removes the need for normal security\n checks, which in turn allows untrusted applet code to update\n the control state of the Logger.  For example an applet can do\n a setLevel or an addHandler on an anonymous Logger.\n \n Even although the new logger is anonymous, it is configured\n to have the root logger (\"\") as its parent.  This means that\n by default it inherits its effective level and handlers\n from the root logger.  Changing its parent via the\n setParent method\n will still require the security permission specified by that method."}, {"method_name": "getResourceBundle", "method_sig": "public ResourceBundle getResourceBundle()", "description": "Retrieve the localization resource bundle for this\n logger.\n This method will return a ResourceBundle that was either\n set by the setResourceBundle method or\n mapped from the\n the resource bundle name set via the getLogger factory\n method for the current default locale.\n Note that if the result is null, then the Logger will use a resource\n bundle or resource bundle name inherited from its parent."}, {"method_name": "getResourceBundleName", "method_sig": "public String getResourceBundleName()", "description": "Retrieve the localization resource bundle name for this\n logger.\n This is either the name specified through the getLogger factory method,\n or the base name of the\n ResourceBundle set through setResourceBundle method.\n Note that if the result is null, then the Logger will use a resource\n bundle or resource bundle name inherited from its parent."}, {"method_name": "setFilter", "method_sig": "public void setFilter (Filter newFilter)\n               throws SecurityException", "description": "Set a filter to control output on this Logger.\n \n After passing the initial \"level\" check, the Logger will\n call this Filter to check if a log record should really\n be published."}, {"method_name": "getFilter", "method_sig": "public Filter getFilter()", "description": "Get the current filter for this Logger."}, {"method_name": "log", "method_sig": "public void log (LogRecord record)", "description": "Log a LogRecord.\n \n All the other logging methods in this class call through\n this method to actually perform any logging.  Subclasses can\n override this single method to capture all log activity."}, {"method_name": "log", "method_sig": "public void log (Level level,\n                String msg)", "description": "Log a message, with no arguments.\n \n If the logger is currently enabled for the given message\n level then the given message is forwarded to all the\n registered output Handler objects."}, {"method_name": "log", "method_sig": "public void log (Level level,\n                Supplier<String> msgSupplier)", "description": "Log a message, which is only to be constructed if the logging level\n is such that the message will actually be logged.\n \n If the logger is currently enabled for the given message\n level then the message is constructed by invoking the provided\n supplier function and forwarded to all the registered output\n Handler objects."}, {"method_name": "log", "method_sig": "public void log (Level level,\n                String msg,\n                Object param1)", "description": "Log a message, with one object parameter.\n \n If the logger is currently enabled for the given message\n level then a corresponding LogRecord is created and forwarded\n to all the registered output Handler objects."}, {"method_name": "log", "method_sig": "public void log (Level level,\n                String msg,\n                Object[] params)", "description": "Log a message, with an array of object arguments.\n \n If the logger is currently enabled for the given message\n level then a corresponding LogRecord is created and forwarded\n to all the registered output Handler objects."}, {"method_name": "log", "method_sig": "public void log (Level level,\n                String msg,\n                Throwable thrown)", "description": "Log a message, with associated Throwable information.\n \n If the logger is currently enabled for the given message\n level then the given arguments are stored in a LogRecord\n which is forwarded to all registered output handlers.\n \n Note that the thrown argument is stored in the LogRecord thrown\n property, rather than the LogRecord parameters property.  Thus it is\n processed specially by output Formatters and is not treated\n as a formatting parameter to the LogRecord message property."}, {"method_name": "log", "method_sig": "public void log (Level level,\n                Throwable thrown,\n                Supplier<String> msgSupplier)", "description": "Log a lazily constructed message, with associated Throwable information.\n \n If the logger is currently enabled for the given message level then the\n message is constructed by invoking the provided supplier function. The\n message and the given Throwable are then stored in a LogRecord which is forwarded to all registered output handlers.\n \n Note that the thrown argument is stored in the LogRecord thrown\n property, rather than the LogRecord parameters property.  Thus it is\n processed specially by output Formatters and is not treated\n as a formatting parameter to the LogRecord message property."}, {"method_name": "logp", "method_sig": "public void logp (Level level,\n                 String sourceClass,\n                 String sourceMethod,\n                 String msg)", "description": "Log a message, specifying source class and method,\n with no arguments.\n \n If the logger is currently enabled for the given message\n level then the given message is forwarded to all the\n registered output Handler objects."}, {"method_name": "logp", "method_sig": "public void logp (Level level,\n                 String sourceClass,\n                 String sourceMethod,\n                 Supplier<String> msgSupplier)", "description": "Log a lazily constructed message, specifying source class and method,\n with no arguments.\n \n If the logger is currently enabled for the given message\n level then the message is constructed by invoking the provided\n supplier function and forwarded to all the registered output\n Handler objects."}, {"method_name": "logp", "method_sig": "public void logp (Level level,\n                 String sourceClass,\n                 String sourceMethod,\n                 String msg,\n                 Object param1)", "description": "Log a message, specifying source class and method,\n with a single object parameter to the log message.\n \n If the logger is currently enabled for the given message\n level then a corresponding LogRecord is created and forwarded\n to all the registered output Handler objects."}, {"method_name": "logp", "method_sig": "public void logp (Level level,\n                 String sourceClass,\n                 String sourceMethod,\n                 String msg,\n                 Object[] params)", "description": "Log a message, specifying source class and method,\n with an array of object arguments.\n \n If the logger is currently enabled for the given message\n level then a corresponding LogRecord is created and forwarded\n to all the registered output Handler objects."}, {"method_name": "logp", "method_sig": "public void logp (Level level,\n                 String sourceClass,\n                 String sourceMethod,\n                 String msg,\n                 Throwable thrown)", "description": "Log a message, specifying source class and method,\n with associated Throwable information.\n \n If the logger is currently enabled for the given message\n level then the given arguments are stored in a LogRecord\n which is forwarded to all registered output handlers.\n \n Note that the thrown argument is stored in the LogRecord thrown\n property, rather than the LogRecord parameters property.  Thus it is\n processed specially by output Formatters and is not treated\n as a formatting parameter to the LogRecord message property."}, {"method_name": "logp", "method_sig": "public void logp (Level level,\n                 String sourceClass,\n                 String sourceMethod,\n                 Throwable thrown,\n                 Supplier<String> msgSupplier)", "description": "Log a lazily constructed message, specifying source class and method,\n with associated Throwable information.\n \n If the logger is currently enabled for the given message level then the\n message is constructed by invoking the provided supplier function. The\n message and the given Throwable are then stored in a LogRecord which is forwarded to all registered output handlers.\n \n Note that the thrown argument is stored in the LogRecord thrown\n property, rather than the LogRecord parameters property.  Thus it is\n processed specially by output Formatters and is not treated\n as a formatting parameter to the LogRecord message property."}, {"method_name": "logrb", "method_sig": "@Deprecated\npublic void logrb (Level level,\n                  String sourceClass,\n                  String sourceMethod,\n                  String bundleName,\n                  String msg)", "description": "Log a message, specifying source class, method, and resource bundle name\n with no arguments.\n \n If the logger is currently enabled for the given message\n level then the given message is forwarded to all the\n registered output Handler objects.\n \n The msg string is localized using the named resource bundle.  If the\n resource bundle name is null, or an empty String or invalid\n then the msg string is not localized."}, {"method_name": "logrb", "method_sig": "@Deprecated\npublic void logrb (Level level,\n                  String sourceClass,\n                  String sourceMethod,\n                  String bundleName,\n                  String msg,\n                  Object param1)", "description": "Log a message, specifying source class, method, and resource bundle name,\n with a single object parameter to the log message.\n \n If the logger is currently enabled for the given message\n level then a corresponding LogRecord is created and forwarded\n to all the registered output Handler objects.\n \n The msg string is localized using the named resource bundle.  If the\n resource bundle name is null, or an empty String or invalid\n then the msg string is not localized."}, {"method_name": "logrb", "method_sig": "@Deprecated\npublic void logrb (Level level,\n                  String sourceClass,\n                  String sourceMethod,\n                  String bundleName,\n                  String msg,\n                  Object[] params)", "description": "Log a message, specifying source class, method, and resource bundle name,\n with an array of object arguments.\n \n If the logger is currently enabled for the given message\n level then a corresponding LogRecord is created and forwarded\n to all the registered output Handler objects.\n \n The msg string is localized using the named resource bundle.  If the\n resource bundle name is null, or an empty String or invalid\n then the msg string is not localized."}, {"method_name": "logrb", "method_sig": "public void logrb (Level level,\n                  String sourceClass,\n                  String sourceMethod,\n                  ResourceBundle bundle,\n                  String msg,\n                  Object... params)", "description": "Log a message, specifying source class, method, and resource bundle,\n with an optional list of message parameters.\n \n If the logger is currently enabled for the given message\n level then a corresponding LogRecord is created and\n forwarded to all the registered output Handler objects.\n \n The msg string is localized using the given resource bundle.\n If the resource bundle is null, then the msg string is not\n localized."}, {"method_name": "logrb", "method_sig": "public void logrb (Level level,\n                  ResourceBundle bundle,\n                  String msg,\n                  Object... params)", "description": "Log a message, specifying source class, method, and resource bundle,\n with an optional list of message parameters.\n \n If the logger is currently enabled for the given message\n level then a corresponding LogRecord is created\n and forwarded to all the registered output Handler objects.\n \n The msg string is localized using the given resource bundle.\n If the resource bundle is null, then the msg string is not\n localized."}, {"method_name": "logrb", "method_sig": "@Deprecated\npublic void logrb (Level level,\n                  String sourceClass,\n                  String sourceMethod,\n                  String bundleName,\n                  String msg,\n                  Throwable thrown)", "description": "Log a message, specifying source class, method, and resource bundle name,\n with associated Throwable information.\n \n If the logger is currently enabled for the given message\n level then the given arguments are stored in a LogRecord\n which is forwarded to all registered output handlers.\n \n The msg string is localized using the named resource bundle.  If the\n resource bundle name is null, or an empty String or invalid\n then the msg string is not localized.\n \n Note that the thrown argument is stored in the LogRecord thrown\n property, rather than the LogRecord parameters property.  Thus it is\n processed specially by output Formatters and is not treated\n as a formatting parameter to the LogRecord message property."}, {"method_name": "logrb", "method_sig": "public void logrb (Level level,\n                  String sourceClass,\n                  String sourceMethod,\n                  ResourceBundle bundle,\n                  String msg,\n                  Throwable thrown)", "description": "Log a message, specifying source class, method, and resource bundle,\n with associated Throwable information.\n \n If the logger is currently enabled for the given message\n level then the given arguments are stored in a LogRecord\n which is forwarded to all registered output handlers.\n \n The msg string is localized using the given resource bundle.\n If the resource bundle is null, then the msg string is not\n localized.\n \n Note that the thrown argument is stored in the LogRecord\nthrown property, rather than the LogRecord\nparameters property.  Thus it is\n processed specially by output Formatter objects and is not treated\n as a formatting parameter to the LogRecord message property."}, {"method_name": "logrb", "method_sig": "public void logrb (Level level,\n                  ResourceBundle bundle,\n                  String msg,\n                  Throwable thrown)", "description": "Log a message, specifying source class, method, and resource bundle,\n with associated Throwable information.\n \n If the logger is currently enabled for the given message\n level then the given arguments are stored in a LogRecord\n which is forwarded to all registered output handlers.\n \n The msg string is localized using the given resource bundle.\n If the resource bundle is null, then the msg string is not\n localized.\n \n Note that the thrown argument is stored in the LogRecord\nthrown property, rather than the LogRecord\nparameters property.  Thus it is\n processed specially by output Formatter objects and is not treated\n as a formatting parameter to the LogRecord message\n property."}, {"method_name": "entering", "method_sig": "public void entering (String sourceClass,\n                     String sourceMethod)", "description": "Log a method entry.\n \n This is a convenience method that can be used to log entry\n to a method.  A LogRecord with message \"ENTRY\", log level\n FINER, and the given sourceMethod and sourceClass is logged."}, {"method_name": "entering", "method_sig": "public void entering (String sourceClass,\n                     String sourceMethod,\n                     Object param1)", "description": "Log a method entry, with one parameter.\n \n This is a convenience method that can be used to log entry\n to a method.  A LogRecord with message \"ENTRY {0}\", log level\n FINER, and the given sourceMethod, sourceClass, and parameter\n is logged."}, {"method_name": "entering", "method_sig": "public void entering (String sourceClass,\n                     String sourceMethod,\n                     Object[] params)", "description": "Log a method entry, with an array of parameters.\n \n This is a convenience method that can be used to log entry\n to a method.  A LogRecord with message \"ENTRY\" (followed by a\n format {N} indicator for each entry in the parameter array),\n log level FINER, and the given sourceMethod, sourceClass, and\n parameters is logged."}, {"method_name": "exiting", "method_sig": "public void exiting (String sourceClass,\n                    String sourceMethod)", "description": "Log a method return.\n \n This is a convenience method that can be used to log returning\n from a method.  A LogRecord with message \"RETURN\", log level\n FINER, and the given sourceMethod and sourceClass is logged."}, {"method_name": "exiting", "method_sig": "public void exiting (String sourceClass,\n                    String sourceMethod,\n                    Object result)", "description": "Log a method return, with result object.\n \n This is a convenience method that can be used to log returning\n from a method.  A LogRecord with message \"RETURN {0}\", log level\n FINER, and the gives sourceMethod, sourceClass, and result\n object is logged."}, {"method_name": "throwing", "method_sig": "public void throwing (String sourceClass,\n                     String sourceMethod,\n                     Throwable thrown)", "description": "Log throwing an exception.\n \n This is a convenience method to log that a method is\n terminating by throwing an exception.  The logging is done\n using the FINER level.\n \n If the logger is currently enabled for the given message\n level then the given arguments are stored in a LogRecord\n which is forwarded to all registered output handlers.  The\n LogRecord's message is set to \"THROW\".\n \n Note that the thrown argument is stored in the LogRecord thrown\n property, rather than the LogRecord parameters property.  Thus it is\n processed specially by output Formatters and is not treated\n as a formatting parameter to the LogRecord message property."}, {"method_name": "severe", "method_sig": "public void severe (String msg)", "description": "Log a SEVERE message.\n \n If the logger is currently enabled for the SEVERE message\n level then the given message is forwarded to all the\n registered output Handler objects."}, {"method_name": "warning", "method_sig": "public void warning (String msg)", "description": "Log a WARNING message.\n \n If the logger is currently enabled for the WARNING message\n level then the given message is forwarded to all the\n registered output Handler objects."}, {"method_name": "info", "method_sig": "public void info (String msg)", "description": "Log an INFO message.\n \n If the logger is currently enabled for the INFO message\n level then the given message is forwarded to all the\n registered output Handler objects."}, {"method_name": "config", "method_sig": "public void config (String msg)", "description": "Log a CONFIG message.\n \n If the logger is currently enabled for the CONFIG message\n level then the given message is forwarded to all the\n registered output Handler objects."}, {"method_name": "fine", "method_sig": "public void fine (String msg)", "description": "Log a FINE message.\n \n If the logger is currently enabled for the FINE message\n level then the given message is forwarded to all the\n registered output Handler objects."}, {"method_name": "finer", "method_sig": "public void finer (String msg)", "description": "Log a FINER message.\n \n If the logger is currently enabled for the FINER message\n level then the given message is forwarded to all the\n registered output Handler objects."}, {"method_name": "finest", "method_sig": "public void finest (String msg)", "description": "Log a FINEST message.\n \n If the logger is currently enabled for the FINEST message\n level then the given message is forwarded to all the\n registered output Handler objects."}, {"method_name": "severe", "method_sig": "public void severe (Supplier<String> msgSupplier)", "description": "Log a SEVERE message, which is only to be constructed if the logging\n level is such that the message will actually be logged.\n \n If the logger is currently enabled for the SEVERE message\n level then the message is constructed by invoking the provided\n supplier function and forwarded to all the registered output\n Handler objects."}, {"method_name": "warning", "method_sig": "public void warning (Supplier<String> msgSupplier)", "description": "Log a WARNING message, which is only to be constructed if the logging\n level is such that the message will actually be logged.\n \n If the logger is currently enabled for the WARNING message\n level then the message is constructed by invoking the provided\n supplier function and forwarded to all the registered output\n Handler objects."}, {"method_name": "info", "method_sig": "public void info (Supplier<String> msgSupplier)", "description": "Log a INFO message, which is only to be constructed if the logging\n level is such that the message will actually be logged.\n \n If the logger is currently enabled for the INFO message\n level then the message is constructed by invoking the provided\n supplier function and forwarded to all the registered output\n Handler objects."}, {"method_name": "config", "method_sig": "public void config (Supplier<String> msgSupplier)", "description": "Log a CONFIG message, which is only to be constructed if the logging\n level is such that the message will actually be logged.\n \n If the logger is currently enabled for the CONFIG message\n level then the message is constructed by invoking the provided\n supplier function and forwarded to all the registered output\n Handler objects."}, {"method_name": "fine", "method_sig": "public void fine (Supplier<String> msgSupplier)", "description": "Log a FINE message, which is only to be constructed if the logging\n level is such that the message will actually be logged.\n \n If the logger is currently enabled for the FINE message\n level then the message is constructed by invoking the provided\n supplier function and forwarded to all the registered output\n Handler objects."}, {"method_name": "finer", "method_sig": "public void finer (Supplier<String> msgSupplier)", "description": "Log a FINER message, which is only to be constructed if the logging\n level is such that the message will actually be logged.\n \n If the logger is currently enabled for the FINER message\n level then the message is constructed by invoking the provided\n supplier function and forwarded to all the registered output\n Handler objects."}, {"method_name": "finest", "method_sig": "public void finest (Supplier<String> msgSupplier)", "description": "Log a FINEST message, which is only to be constructed if the logging\n level is such that the message will actually be logged.\n \n If the logger is currently enabled for the FINEST message\n level then the message is constructed by invoking the provided\n supplier function and forwarded to all the registered output\n Handler objects."}, {"method_name": "setLevel", "method_sig": "public void setLevel (Level newLevel)\n              throws SecurityException", "description": "Set the log level specifying which message levels will be\n logged by this logger.  Message levels lower than this\n value will be discarded.  The level value Level.OFF\n can be used to turn off logging.\n \n If the new level is null, it means that this node should\n inherit its level from its nearest ancestor with a specific\n (non-null) level value."}, {"method_name": "getLevel", "method_sig": "public Level getLevel()", "description": "Get the log Level that has been specified for this Logger.\n The result may be null, which means that this logger's\n effective level will be inherited from its parent."}, {"method_name": "isLoggable", "method_sig": "public boolean isLoggable (Level level)", "description": "Check if a message of the given level would actually be logged\n by this logger.  This check is based on the Loggers effective level,\n which may be inherited from its parent."}, {"method_name": "getName", "method_sig": "public String getName()", "description": "Get the name for this logger."}, {"method_name": "addHandler", "method_sig": "public void addHandler (Handler handler)\n                throws SecurityException", "description": "Add a log Handler to receive logging messages.\n \n By default, Loggers also send their output to their parent logger.\n Typically the root Logger is configured with a set of Handlers\n that essentially act as default handlers for all loggers."}, {"method_name": "removeHandler", "method_sig": "public void removeHandler (Handler handler)\n                   throws SecurityException", "description": "Remove a log Handler.\n \n Returns silently if the given Handler is not found or is null"}, {"method_name": "getHandlers", "method_sig": "public Handler[] getHandlers()", "description": "Get the Handlers associated with this logger."}, {"method_name": "setUseParentHandlers", "method_sig": "public void setUseParentHandlers (boolean useParentHandlers)", "description": "Specify whether or not this logger should send its output\n to its parent Logger.  This means that any LogRecords will\n also be written to the parent's Handlers, and potentially\n to its parent, recursively up the namespace."}, {"method_name": "getUseParentHandlers", "method_sig": "public boolean getUseParentHandlers()", "description": "Discover whether or not this logger is sending its output\n to its parent logger."}, {"method_name": "setResourceBundle", "method_sig": "public void setResourceBundle (ResourceBundle bundle)", "description": "Sets a resource bundle on this logger.\n All messages will be logged using the given resource bundle for its\n specific locale."}, {"method_name": "getParent", "method_sig": "public Logger getParent()", "description": "Return the parent for this Logger.\n \n This method returns the nearest extant parent in the namespace.\n Thus if a Logger is called \"a.b.c.d\", and a Logger called \"a.b\"\n has been created but no logger \"a.b.c\" exists, then a call of\n getParent on the Logger \"a.b.c.d\" will return the Logger \"a.b\".\n \n The result will be null if it is called on the root Logger\n in the namespace."}, {"method_name": "setParent", "method_sig": "public void setParent (Logger parent)", "description": "Set the parent for this Logger.  This method is used by\n the LogManager to update a Logger when the namespace changes.\n \n It should not be called from application code."}]}