{"name": "Interface LSSerializerFilter", "module": "java.xml", "package": "org.w3c.dom.ls", "text": "LSSerializerFilters provide applications the ability to\n examine nodes as they are being serialized and decide what nodes should\n be serialized or not. The LSSerializerFilter interface is\n based on the NodeFilter interface defined in [DOM Level 2 Traversal and      Range]\n .\n  Document, DocumentType,\n DocumentFragment, Notation, Entity\n , and children of Attr nodes are not passed to the filter.\n The child nodes of an EntityReference node are only passed\n to the filter if the EntityReference node is skipped by the\n method LSParserFilter.acceptNode().\n  When serializing an Element, the element is passed to the\n filter before any of its attributes are passed to the filter. Namespace\n declaration attributes, and default attributes (except in the case when \"\n discard-default-content\" is set to false), are never passed\n to the filter.\n  The result of any attempt to modify a node passed to a\n LSSerializerFilter is implementation dependent.\n  DOM applications must not raise exceptions in a filter. The effect of\n throwing exceptions from a filter is DOM implementation dependent.\n  For efficiency, a node passed to the filter may not be the same as the\n one that is actually in the tree. And the actual node (node object\n identity) may be reused during the process of filtering and serializing a\n document.\n See also the Document Object Model (DOM) Level 3 Load\nand Save Specification.", "codes": ["public interface LSSerializerFilter\nextends NodeFilter"], "fields": [], "methods": [{"method_name": "getWhatToShow", "method_sig": "int getWhatToShow()", "description": "Tells the LSSerializer what types of nodes to show to the\n filter. If a node is not shown to the filter using this attribute, it\n is automatically serialized. See NodeFilter for\n definition of the constants. The constants SHOW_DOCUMENT\n , SHOW_DOCUMENT_TYPE, SHOW_DOCUMENT_FRAGMENT\n , SHOW_NOTATION, and SHOW_ENTITY are\n meaningless here, such nodes will never be passed to a\n LSSerializerFilter.\n  Unlike [DOM Level 2 Traversal and      Range]\n , the SHOW_ATTRIBUTE constant indicates that the\n Attr nodes are shown and passed to the filter.\n  The constants used here are defined in [DOM Level 2 Traversal and      Range]\n ."}]}