{"name": "Class MappedByteBuffer", "module": "java.base", "package": "java.nio", "text": "A direct byte buffer whose content is a memory-mapped region of a file.\n\n  Mapped byte buffers are created via the FileChannel.map method.  This class\n extends the ByteBuffer class with operations that are specific to\n memory-mapped file regions.\n\n  A mapped byte buffer and the file mapping that it represents remain\n valid until the buffer itself is garbage-collected.\n\n  The content of a mapped byte buffer can change at any time, for example\n if the content of the corresponding region of the mapped file is changed by\n this program or another.  Whether or not such changes occur, and when they\n occur, is operating-system dependent and therefore unspecified.\n\n  All or part of a mapped byte buffer may become\n inaccessible at any time, for example if the mapped file is truncated.  An\n attempt to access an inaccessible region of a mapped byte buffer will not\n change the buffer's content and will cause an unspecified exception to be\n thrown either at the time of the access or at some later time.  It is\n therefore strongly recommended that appropriate precautions be taken to\n avoid the manipulation of a mapped file by this program, or by a\n concurrently running program, except to read or write the file's content.\n\n  Mapped byte buffers otherwise behave no differently than ordinary direct\n byte buffers. ", "codes": ["public abstract class MappedByteBuffer\nextends ByteBuffer"], "fields": [], "methods": [{"method_name": "isLoaded", "method_sig": "public final boolean isLoaded()", "description": "Tells whether or not this buffer's content is resident in physical\n memory.\n\n  A return value of true implies that it is highly likely\n that all of the data in this buffer is resident in physical memory and\n may therefore be accessed without incurring any virtual-memory page\n faults or I/O operations.  A return value of false does not\n necessarily imply that the buffer's content is not resident in physical\n memory.\n\n  The returned value is a hint, rather than a guarantee, because the\n underlying operating system may have paged out some of the buffer's data\n by the time that an invocation of this method returns.  "}, {"method_name": "load", "method_sig": "public final MappedByteBuffer load()", "description": "Loads this buffer's content into physical memory.\n\n  This method makes a best effort to ensure that, when it returns,\n this buffer's content is resident in physical memory.  Invoking this\n method may cause some number of page faults and I/O operations to\n occur. "}, {"method_name": "force", "method_sig": "public final MappedByteBuffer force()", "description": "Forces any changes made to this buffer's content to be written to the\n storage device containing the mapped file.\n\n  If the file mapped into this buffer resides on a local storage\n device then when this method returns it is guaranteed that all changes\n made to the buffer since it was created, or since this method was last\n invoked, will have been written to that device.\n\n  If the file does not reside on a local device then no such guarantee\n is made.\n\n  If this buffer was not mapped in read/write mode (FileChannel.MapMode.READ_WRITE) then invoking this\n method has no effect. "}]}