{"name": "Class MBeanNotificationInfo", "module": "java.management", "package": "javax.management", "text": "The MBeanNotificationInfo class is used to describe the\n characteristics of the different notification instances\n emitted by an MBean, for a given Java class of notification.\n If an MBean emits notifications that can be instances of different Java classes,\n then the metadata for that MBean should provide an MBeanNotificationInfo\n object for each of these notification Java classes.\nInstances of this class are immutable.  Subclasses may be\n mutable but this is not recommended.\nThis class extends javax.management.MBeanFeatureInfo\n and thus provides name and description fields.\n The name field should be the fully qualified Java class name of\n the notification objects described by this class.\nThe getNotifTypes method returns an array of\n strings containing the notification types that the MBean may\n emit. The notification type is a dot-notation string which\n describes what the emitted notification is about, not the Java\n class of the notification.  A single generic notification class can\n be used to send notifications of several types.  All of these types\n are returned in the string array result of the\n getNotifTypes method.", "codes": ["public class MBeanNotificationInfo\nextends MBeanFeatureInfo\nimplements Cloneable"], "fields": [], "methods": [{"method_name": "clone", "method_sig": "public Object clone()", "description": "Returns a shallow clone of this instance.\n The clone is obtained by simply calling super.clone(),\n thus calling the default native shallow cloning mechanism\n implemented by Object.clone().\n No deeper cloning of any internal field is made."}, {"method_name": "getNotifTypes", "method_sig": "public String[] getNotifTypes()", "description": "Returns the array of strings (in dot notation) containing the\n notification types that the MBean may emit."}, {"method_name": "equals", "method_sig": "public boolean equals (Object o)", "description": "Compare this MBeanNotificationInfo to another."}]}