{"name": "Interface MBeanRegistration", "module": "java.management", "package": "javax.management", "text": "Can be implemented by an MBean in order to\n carry out operations before and after being registered or unregistered from\n the MBean Server.  An MBean can also implement this interface in order\n to get a reference to the MBean Server and/or its name within that\n MBean Server.", "codes": ["public interface MBeanRegistration"], "fields": [], "methods": [{"method_name": "preRegister", "method_sig": "ObjectName preRegister (MBeanServer server,\n                       ObjectName name)\n                throws Exception", "description": "Allows the MBean to perform any operations it needs before\n being registered in the MBean Server.  If the name of the MBean\n is not specified, the MBean can provide a name for its\n registration.  If any exception is raised, the MBean will not be\n registered in the MBean Server."}, {"method_name": "postRegister", "method_sig": "void postRegister (Boolean registrationDone)", "description": "Allows the MBean to perform any operations needed after having been\n registered in the MBean server or after the registration has failed.\n If the implementation of this method throws a RuntimeException\n or an Error, the MBean Server will rethrow those inside\n a RuntimeMBeanException or RuntimeErrorException,\n respectively. However, throwing an exception in postRegister\n will not change the state of the MBean:\n if the MBean was already registered (registrationDone is\n true), the MBean will remain registered. \nThis might be confusing for the code calling createMBean()\n or registerMBean(), as such code might assume that MBean\n registration has failed when such an exception is raised.\n Therefore it is recommended that implementations of\n postRegister do not throw Runtime Exceptions or Errors if it\n can be avoided."}, {"method_name": "preDeregister", "method_sig": "void preDeregister()\n            throws Exception", "description": "Allows the MBean to perform any operations it needs before\n being unregistered by the MBean server."}, {"method_name": "postDeregister", "method_sig": "void postDeregister()", "description": "Allows the MBean to perform any operations needed after having been\n unregistered in the MBean server.\n If the implementation of this method throws a RuntimeException\n or an Error, the MBean Server will rethrow those inside\n a RuntimeMBeanException or RuntimeErrorException,\n respectively. However, throwing an exception in postDeregister\n will not change the state of the MBean:\n the MBean was already successfully deregistered and will remain so. \nThis might be confusing for the code calling\n unregisterMBean(), as it might assume that MBean deregistration\n has failed. Therefore it is recommended that implementations of\n postDeregister do not throw Runtime Exceptions or Errors if it\n can be avoided."}]}