{"name": "Class MediaSize", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class MediaSize is a two-dimensional size valued printing attribute\n class that indicates the dimensions of the medium in a portrait orientation,\n with the X dimension running along the bottom edge and the Y\n dimension running along the left edge. Thus, the Y dimension must be\n greater than or equal to the X dimension. Class MediaSize\n declares many standard media size values, organized into nested classes for\n ISO, JIS, North American, engineering, and other media.\n \nMediaSize is not yet used to specify media. Its current role is as a\n mapping for named media (see MediaSizeName). Clients\n can use the mapping method\n MediaSize.getMediaSizeForName(MediaSizeName) to find the physical\n dimensions of the MediaSizeName instances enumerated in this API.\n This is useful for clients which need this information to format &\n paginate printing.", "codes": ["public class MediaSize\nextends Size2DSyntax\nimplements Attribute"], "fields": [], "methods": [{"method_name": "getMediaSizeName", "method_sig": "public MediaSizeName getMediaSizeName()", "description": "Get the media name, if any, for this size."}, {"method_name": "getMediaSizeForName", "method_sig": "public static MediaSize getMediaSizeForName (MediaSizeName media)", "description": "Get the MediaSize for the specified named media."}, {"method_name": "findMedia", "method_sig": "public static MediaSizeName findMedia (float x,\n                                      float y,\n                                      int units)", "description": "The specified dimensions are used to locate a matching MediaSize\n instance from amongst all the standard MediaSize instances. If\n there is no exact match, the closest match is used.\n \n The MediaSize is in turn used to locate the MediaSizeName\n object. This method may return null if the closest matching\n MediaSize has no corresponding Media instance.\n \n This method is useful for clients which have only dimensions and want to\n find a Media which corresponds to the dimensions."}, {"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this media size attribute is equivalent to the passed in\n object. To be equivalent, all of the following conditions must be true:\n \nobject is not null.\n   object is an instance of class MediaSize.\n   This media size attribute's X dimension is equal to\n   object's X dimension.\n   This media size attribute's Y dimension is equal to\n   object's Y dimension.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class MediaSize and any vendor-defined subclasses, the\n category is class MediaSize itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class MediaSize and any vendor-defined subclasses, the\n category name is \"media-size\"."}]}