{"name": "Class MediaPrintableArea", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class MediaPrintableArea is a printing attribute used to distinguish\n the printable and non-printable areas of media.\n \n The printable area is specified to be a rectangle, within the overall\n dimensions of a media.\n \n Most printers cannot print on the entire surface of the media, due to printer\n hardware limitations. This class can be used to query the acceptable values\n for a supposed print job, and to request an area within the constraints of\n the printable area to be used in a print job.\n \n To query for the printable area, a client must supply a suitable context.\n Without specifying at the very least the size of the media being used no\n meaningful value for printable area can be obtained.\n \n The attribute is not described in terms of the distance from the edge of the\n paper, in part to emphasise that this attribute is not independent of a\n particular media, but must be described within the context of a choice of\n other attributes. Additionally it is usually more convenient for a client to\n use the printable area.\n \n The hardware's minimum margins is not just a property of the printer, but may\n be a function of the media size, orientation, media type, and any specified\n finishings. PrintService provides the method to query the supported\n values of an attribute in a suitable context : See\n PrintService.getSupportedAttributeValues()\n\n The rectangular printable area is defined thus: The (x,y) origin is\n positioned at the top-left of the paper in portrait mode regardless of the\n orientation specified in the requesting context. For example a printable area\n for A4 paper in portrait or landscape orientation will have height\n > width.\n \n A printable area attribute's values are stored internally as integers in\n units of micrometers (µm), where 1 micrometer = 10-6 meter =\n 1/1000 millimeter = 1/25400 inch. This permits dimensions to be represented\n exactly to a precision of 1/1000 mm (= 1 µm) or 1/100 inch (= 254\n µm). If fractional inches are expressed in negative powers of two, this\n permits dimensions to be represented exactly to a precision of 1/8 inch\n (= 3175 µm) but not 1/16 inch (because 1/16 inch does not equal an\n integral number of µm).\n \nIPP Compatibility: MediaPrintableArea is not an IPP attribute.", "codes": ["public final class MediaPrintableArea\nextends Object\nimplements DocAttribute, PrintRequestAttribute, PrintJobAttribute"], "fields": [{"field_name": "INCH", "field_sig": "public static final int INCH", "description": "Value to indicate units of inches (in). It is actually the conversion\n factor by which to multiply inches to yield µm (25400)."}, {"field_name": "MM", "field_sig": "public static final int MM", "description": "Value to indicate units of millimeters (mm). It is actually the\n conversion factor by which to multiply mm to yield µm (1000)."}], "methods": [{"method_name": "getPrintableArea", "method_sig": "public float[] getPrintableArea (int units)", "description": "Get the printable area as an array of 4 values in the order\n x, y, w, h. The values returned are in the given units."}, {"method_name": "getX", "method_sig": "public float getX (int units)", "description": "Get the x location of the origin of the printable area in the\n specified units."}, {"method_name": "getY", "method_sig": "public float getY (int units)", "description": "Get the y location of the origin of the printable area in the\n specified units."}, {"method_name": "getWidth", "method_sig": "public float getWidth (int units)", "description": "Get the width of the printable area in the specified units."}, {"method_name": "getHeight", "method_sig": "public float getHeight (int units)", "description": "Get the height of the printable area in the specified units."}, {"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this media margins attribute is equivalent to the passed\n in object. To be equivalent, all of the following conditions must be\n true:\n \nobject is not null.\n   object is an instance of class MediaPrintableArea.\n   The origin and dimensions are the same.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class MediaPrintableArea, the category is class\n MediaPrintableArea itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class MediaPrintableArea, the category name is\n \"media-printable-area\".\n \n This is not an IPP V1.1 attribute."}, {"method_name": "toString", "method_sig": "public String toString (int units,\n                       String unitsName)", "description": "Returns a string version of this rectangular size attribute in the given\n units."}, {"method_name": "toString", "method_sig": "public String toString()", "description": "Returns a string version of this rectangular size attribute in mm."}, {"method_name": "hashCode", "method_sig": "public int hashCode()", "description": "Returns a hash code value for this attribute."}]}