{"name": "Class MembershipKey", "module": "java.base", "package": "java.nio.channels", "text": "A token representing the membership of an Internet Protocol (IP) multicast\n group.\n\n  A membership key may represent a membership to receive all datagrams sent\n to the group, or it may be source-specific, meaning that it\n represents a membership that receives only datagrams from a specific source\n address. Whether or not a membership key is source-specific may be determined\n by invoking its sourceAddress method.\n\n  A membership key is valid upon creation and remains valid until the\n membership is dropped by invoking the drop method, or\n the channel is closed. The validity of the membership key may be tested\n by invoking its isValid method.\n\n  Where a membership key is not source-specific and the underlying operation\n system supports source filtering, then the block and unblock methods can be used to block or unblock multicast datagrams\n from particular source addresses.", "codes": ["public abstract class MembershipKey\nextends Object"], "fields": [], "methods": [{"method_name": "isValid", "method_sig": "public abstract boolean isValid()", "description": "Tells whether or not this membership is valid.\n\n  A multicast group membership is valid upon creation and remains\n valid until the membership is dropped by invoking the drop\n method, or the channel is closed."}, {"method_name": "drop", "method_sig": "public abstract void drop()", "description": "Drop membership.\n\n  If the membership key represents a membership to receive all datagrams\n then the membership is dropped and the channel will no longer receive any\n datagrams sent to the group. If the membership key is source-specific\n then the channel will no longer receive datagrams sent to the group from\n that source address.\n\n  After membership is dropped it may still be possible to receive\n datagrams sent to the group. This can arise when datagrams are waiting to\n be received in the socket's receive buffer. After membership is dropped\n then the channel may join the group again\n in which case a new membership key is returned.\n\n  Upon return, this membership object will be invalid.\n If the multicast group membership is already invalid then invoking this\n method has no effect. Once a multicast group membership is invalid,\n it remains invalid forever."}, {"method_name": "block", "method_sig": "public abstract MembershipKey block (InetAddress source)\n                             throws IOException", "description": "Block multicast datagrams from the given source address.\n\n  If this membership key is not source-specific, and the underlying\n operating system supports source filtering, then this method blocks\n multicast datagrams from the given source address. If the given source\n address is already blocked then this method has no effect.\n After a source address is blocked it may still be possible to receive\n datagrams from that source. This can arise when datagrams are waiting to\n be received in the socket's receive buffer."}, {"method_name": "unblock", "method_sig": "public abstract MembershipKey unblock (InetAddress source)", "description": "Unblock multicast datagrams from the given source address that was\n previously blocked using the block method."}, {"method_name": "channel", "method_sig": "public abstract MulticastChannel channel()", "description": "Returns the channel for which this membership key was created. This\n method will continue to return the channel even after the membership\n becomes invalid."}, {"method_name": "group", "method_sig": "public abstract InetAddress group()", "description": "Returns the multicast group for which this membership key was created.\n This method will continue to return the group even after the membership\n becomes invalid."}, {"method_name": "networkInterface", "method_sig": "public abstract NetworkInterface networkInterface()", "description": "Returns the network interface for which this membership key was created.\n This method will continue to return the network interface even after the\n membership becomes invalid."}, {"method_name": "sourceAddress", "method_sig": "public abstract InetAddress sourceAddress()", "description": "Returns the source address if this membership key is source-specific,\n or null if this membership is not source-specific."}]}