{"name": "Interface MemoryPoolMXBean", "module": "java.management", "package": "java.lang.management", "text": "The management interface for a memory pool.  A memory pool\n represents the memory resource managed by the Java virtual machine\n and is managed by one or more memory managers.\n\n  A Java virtual machine has one or more instances of the\n implementation class of this interface.  An instance\n implementing this interface is\n an MXBean\n that can be obtained by calling\n the ManagementFactory.getMemoryPoolMXBeans() method or\n from the platform MBeanServer method.\n\n The ObjectName for uniquely identifying the MXBean for\n a memory pool within an MBeanServer is:\n \njava.lang:type=MemoryPool,name=pool's name\n\n\n It can be obtained by calling the\n PlatformManagedObject.getObjectName() method.\n\n Memory Type\nThe Java virtual machine has a heap for object allocation and also\n maintains non-heap memory for the method area and the Java virtual\n machine execution.  The Java virtual machine can have one or more\n memory pools.  Each memory pool represents a memory area\n of one of the following types:\n \nheap\nnon-heap\n\nMemory Usage Monitoring\n\n A memory pool has the following attributes:\n \nMemory usage\nPeak memory usage\nUsage Threshold\nCollection Usage Threshold\n       (only supported by some garbage-collected memory pools)\n\n1. Memory Usage\n\n The getUsage() method provides an estimate\n of the current usage of a memory pool.\n For a garbage-collected memory pool, the amount of used memory\n includes the memory occupied by all objects in the pool\n including both reachable and unreachable objects.\n\n In general, this method is a lightweight operation for getting\n an approximate memory usage.  For some memory pools, for example,\n when objects are not packed contiguously, this method may be\n an expensive operation that requires some computation to determine\n the current memory usage.  An implementation should document when\n this is the case.\n\n 2. Peak Memory Usage\n\n The Java virtual machine maintains the peak memory usage of a memory\n pool since the virtual machine was started or the peak was reset.\n The peak memory usage is returned by the getPeakUsage() method\n and reset by calling the resetPeakUsage() method.\n\n 3. Usage Threshold\n\n Each memory pool has a manageable attribute\n called the usage threshold which has a default value supplied\n by the Java virtual machine.  The default value is platform-dependent.\n The usage threshold can be set via the\n setUsageThreshold method.\n If the threshold is set to a positive value, the usage threshold crossing\n checking is enabled in this memory pool.\n If the usage threshold is set to zero, usage\n threshold crossing checking on this memory pool is disabled.\n The isUsageThresholdSupported() method can\n be used to determine if this functionality is supported.\n \n A Java virtual machine performs usage threshold crossing checking on a\n memory pool basis at its best appropriate time, typically,\n at garbage collection time.\n Each memory pool maintains a usage threshold count that will get incremented\n every time when the Java virtual machine\n detects that the memory pool usage is crossing the threshold.\n \n This manageable usage threshold attribute is designed for monitoring the\n increasing trend of memory usage with low overhead.\n Usage threshold may not be appropriate for some memory pools.\n For example, a generational garbage collector, a common garbage collection\n algorithm used in many Java virtual machine implementations,\n manages two or more generations segregating objects by age.\n Most of the objects are allocated in\n the youngest generation (say a nursery memory pool).\n The nursery memory pool is designed to be filled up and\n collecting the nursery memory pool will free most of its memory space\n since it is expected to contain mostly short-lived objects\n and mostly are unreachable at garbage collection time.\n In this case, it is more appropriate for the nursery memory pool\n not to support a usage threshold.  In addition,\n if the cost of an object allocation\n in one memory pool is very low (for example, just atomic pointer exchange),\n the Java virtual machine would probably not support the usage threshold\n for that memory pool since the overhead in comparing the usage with\n the threshold is higher than the cost of object allocation.\n\n \n The memory usage of the system can be monitored using\n polling or\n threshold notification mechanisms.\n\n \nPolling\n\n       An application can continuously monitor its memory usage\n       by calling either the getUsage() method for all\n       memory pools or the isUsageThresholdExceeded() method\n       for those memory pools that support a usage threshold.\n       Below is example code that has a thread dedicated for\n       task distribution and processing.  At every interval,\n       it will determine if it should receive and process new tasks based\n       on its memory usage.  If the memory usage exceeds its usage threshold,\n       it will redistribute all outstanding tasks to other VMs and\n       stop receiving new tasks until the memory usage returns\n       below its usage threshold.\n\n       \n       // Assume the usage threshold is supported for this pool.\n       // Set the threshold to myThreshold above which no new tasks\n       // should be taken.\n       pool.setUsageThreshold(myThreshold);\n       ....\n\n       boolean lowMemory = false;\n       while (true) {\n          if (pool.isUsageThresholdExceeded()) {\n              // potential low memory, so redistribute tasks to other VMs\n              lowMemory = true;\n              redistributeTasks();\n              // stop receiving new tasks\n              stopReceivingTasks();\n          } else {\n              if (lowMemory) {\n                  // resume receiving tasks\n                  lowMemory = false;\n                  resumeReceivingTasks();\n              }\n              // processing outstanding task\n              ...\n          }\n          // sleep for sometime\n          try {\n              Thread.sleep(sometime);\n          } catch (InterruptedException e) {\n              ...\n          }\n       }\n       \n\n       The above example does not differentiate the case where\n       the memory usage has temporarily dropped below the usage threshold\n       from the case where the memory usage remains above the threshold\n       between two iterations.  The usage threshold count returned by\n       the getUsageThresholdCount() method\n       can be used to determine\n       if the memory usage has returned below the threshold\n       between two polls.\n       \n       Below shows another example that takes some action if a\n       memory pool is under low memory and ignores the memory usage\n       changes during the action processing time.\n\n       \n       // Assume the usage threshold is supported for this pool.\n       // Set the threshold to myThreshold which determines if\n       // the application will take some action under low memory condition.\n       pool.setUsageThreshold(myThreshold);\n\n       int prevCrossingCount = 0;\n       while (true) {\n           // A busy loop to detect when the memory usage\n           // has exceeded the threshold.\n           while (!pool.isUsageThresholdExceeded() ||\n                  pool.getUsageThresholdCount() == prevCrossingCount) {\n               try {\n                   Thread.sleep(sometime)\n               } catch (InterruptException e) {\n                   ....\n               }\n           }\n\n           // Do some processing such as check for memory usage\n           // and issue a warning\n           ....\n\n           // Gets the current threshold count. The busy loop will then\n           // ignore any crossing of threshold happens during the processing.\n           prevCrossingCount = pool.getUsageThresholdCount();\n       }\n       \n\nUsage Threshold Notifications\n\n       Usage threshold notification will be emitted by MemoryMXBean.\n       When the Java virtual machine detects that the memory usage of\n       a memory pool has reached or exceeded the usage threshold\n       the virtual machine will trigger the MemoryMXBean to emit an\n       usage threshold exceeded notification.\n       Another usage threshold exceeded notification will not be\n       generated until the usage has fallen below the threshold and\n       then exceeded it again.\n       \n       Below is an example code implementing the same logic as the\n       first example above but using the usage threshold notification\n       mechanism to detect low memory conditions instead of polling.\n       In this example code, upon receiving notification, the notification\n       listener notifies another thread to perform the actual action\n       such as to redistribute outstanding tasks, stop receiving tasks,\n       or resume receiving tasks.\n       The handleNotification method should be designed to\n       do a very minimal amount of work and return without delay to avoid\n       causing delay in delivering subsequent notifications.  Time-consuming\n       actions should be performed by a separate thread.\n       The notification listener may be invoked by multiple threads\n       concurrently; so the tasks performed by the listener\n       should be properly synchronized.\n\n       \n       class MyListener implements javax.management.NotificationListener {\n            public void handleNotification(Notification notification, Object handback)  {\n                String notifType = notification.getType();\n                if (notifType.equals(MemoryNotificationInfo.MEMORY_THRESHOLD_EXCEEDED)) {\n                    // potential low memory, notify another thread\n                    // to redistribute outstanding tasks to other VMs\n                    // and stop receiving new tasks.\n                    lowMemory = true;\n                    notifyAnotherThread(lowMemory);\n                }\n            }\n       }\n\n       // Register MyListener with MemoryMXBean\n       MemoryMXBean mbean = ManagementFactory.getMemoryMXBean();\n       NotificationEmitter emitter = (NotificationEmitter) mbean;\n       MyListener listener = new MyListener();\n       emitter.addNotificationListener(listener, null, null);\n\n       // Assume this pool supports a usage threshold.\n       // Set the threshold to myThreshold above which no new tasks\n       // should be taken.\n       pool.setUsageThreshold(myThreshold);\n\n       // Usage threshold detection is enabled and notification will be\n       // handled by MyListener.  Continue for other processing.\n       ....\n\n       \n\n\n       There is no guarantee about when the MemoryMXBean will emit\n       a threshold notification and when the notification will be delivered.\n       When a notification listener is invoked, the memory usage of\n       the memory pool may have crossed the usage threshold more\n       than once.\n       The MemoryNotificationInfo.getCount() method returns the number\n       of times that the memory usage has crossed the usage threshold\n       at the point in time when the notification was constructed.\n       It can be compared with the current usage threshold count returned\n       by the getUsageThresholdCount() method to determine if\n       such situation has occurred.\n   \n\n4. Collection Usage Threshold\n\n Collection usage threshold is a manageable attribute only applicable\n to some garbage-collected memory pools.\n After a Java virtual machine has expended effort in reclaiming memory\n space by recycling unused objects in a memory pool at garbage collection\n time, some number of bytes in the memory pools that are garbaged\n collected will still be in use.  The collection usage threshold\n allows a value to be set for this number of bytes such\n that if the threshold is exceeded,\n a collection usage threshold exceeded notification\n will be emitted by the MemoryMXBean.\n In addition, the collection usage threshold count will then be incremented.\n\n \n The isCollectionUsageThresholdSupported() method can\n be used to determine if this functionality is supported.\n\n \n A Java virtual machine performs collection usage threshold checking\n on a memory pool basis.  This checking is enabled if the collection\n usage threshold is set to a positive value.\n If the collection usage threshold is set to zero, this checking\n is disabled on this memory pool.  Default value is zero.\n The Java virtual machine performs the collection usage threshold\n checking at garbage collection time.\n\n \n Some garbage-collected memory pools may\n choose not to support the collection usage threshold.  For example,\n a memory pool is only managed by a continuous concurrent garbage\n collector.  Objects can be allocated in this memory pool by some thread\n while the unused objects are reclaimed by the concurrent garbage\n collector simultaneously.  Unless there is a well-defined\n garbage collection time which is the best appropriate time\n to check the memory usage, the collection usage threshold should not\n be supported.\n\n \n The collection usage threshold is designed for monitoring the memory usage\n after the Java virtual machine has expended effort in reclaiming\n memory space.  The collection usage could also be monitored\n by the polling and threshold notification mechanism\n described above for the usage threshold\n in a similar fashion.", "codes": ["public interface MemoryPoolMXBean\nextends PlatformManagedObject"], "fields": [], "methods": [{"method_name": "getName", "method_sig": "String getName()", "description": "Returns the name representing this memory pool."}, {"method_name": "getType", "method_sig": "MemoryType getType()", "description": "Returns the type of this memory pool.\n\n \nMBeanServer access:\n The mapped type of MemoryType is String\n and the value is the name of the MemoryType."}, {"method_name": "getUsage", "method_sig": "MemoryUsage getUsage()", "description": "Returns an estimate of the memory usage of this memory pool.\n This method returns null\n if this memory pool is not valid (i.e. no longer exists).\n\n \n This method requests the Java virtual machine to make\n a best-effort estimate of the current memory usage of this\n memory pool. For some memory pools, this method may be an\n expensive operation that requires some computation to determine\n the estimate.  An implementation should document when\n this is the case.\n\n This method is designed for use in monitoring system\n memory usage and detecting low memory condition.\n\n \nMBeanServer access:\n The mapped type of MemoryUsage is\n CompositeData with attributes as specified in\n MemoryUsage."}, {"method_name": "getPeakUsage", "method_sig": "MemoryUsage getPeakUsage()", "description": "Returns the peak memory usage of this memory pool since the\n Java virtual machine was started or since the peak was reset.\n This method returns null\n if this memory pool is not valid (i.e. no longer exists).\n\n \nMBeanServer access:\n The mapped type of MemoryUsage is\n CompositeData with attributes as specified in\n MemoryUsage."}, {"method_name": "resetPeakUsage", "method_sig": "void resetPeakUsage()", "description": "Resets the peak memory usage statistic of this memory pool\n to the current memory usage."}, {"method_name": "isValid", "method_sig": "boolean isValid()", "description": "Tests if this memory pool is valid in the Java virtual\n machine.  A memory pool becomes invalid once the Java virtual\n machine removes it from the memory system."}, {"method_name": "getMemoryManagerNames", "method_sig": "String[] getMemoryManagerNames()", "description": "Returns the name of memory managers that manages this memory pool.\n Each memory pool will be managed by at least one memory manager."}, {"method_name": "getUsageThreshold", "method_sig": "long getUsageThreshold()", "description": "Returns the usage threshold value of this memory pool in bytes.\n Each memory pool has a platform-dependent default threshold value.\n The current usage threshold can be changed via the\n setUsageThreshold method."}, {"method_name": "setUsageThreshold", "method_sig": "void setUsageThreshold (long threshold)", "description": "Sets the threshold of this memory pool to the given threshold\n value if this memory pool supports the usage threshold.\n The usage threshold crossing checking is enabled in this memory pool\n if the threshold is set to a positive value.\n The usage threshold crossing checking is disabled\n if it is set to zero."}, {"method_name": "isUsageThresholdExceeded", "method_sig": "boolean isUsageThresholdExceeded()", "description": "Tests if the memory usage of this memory pool\n reaches or exceeds its usage threshold value."}, {"method_name": "getUsageThresholdCount", "method_sig": "long getUsageThresholdCount()", "description": "Returns the number of times that the memory usage has crossed\n the usage threshold."}, {"method_name": "isUsageThresholdSupported", "method_sig": "boolean isUsageThresholdSupported()", "description": "Tests if this memory pool supports usage threshold."}, {"method_name": "getCollectionUsageThreshold", "method_sig": "long getCollectionUsageThreshold()", "description": "Returns the collection usage threshold value of this memory pool\n in bytes.  The default value is zero. The collection usage\n threshold can be changed via the\n setCollectionUsageThreshold method."}, {"method_name": "setCollectionUsageThreshold", "method_sig": "void setCollectionUsageThreshold (long threshold)", "description": "Sets the collection usage threshold of this memory pool to\n the given threshold value.\n When this threshold is set to positive, the Java virtual machine\n will check the memory usage at its best appropriate time after it has\n expended effort in recycling unused objects in this memory pool.\n \n The collection usage threshold crossing checking is enabled\n in this memory pool if the threshold is set to a positive value.\n The collection usage threshold crossing checking is disabled\n if it is set to zero."}, {"method_name": "isCollectionUsageThresholdExceeded", "method_sig": "boolean isCollectionUsageThresholdExceeded()", "description": "Tests if the memory usage of this memory pool after\n the most recent collection on which the Java virtual\n machine has expended effort has reached or\n exceeded its collection usage threshold.\n This method does not request the Java virtual\n machine to perform any garbage collection other than its normal\n automatic memory management."}, {"method_name": "getCollectionUsageThresholdCount", "method_sig": "long getCollectionUsageThresholdCount()", "description": "Returns the number of times that the Java virtual machine\n has detected that the memory usage has reached or\n exceeded the collection usage threshold."}, {"method_name": "getCollectionUsage", "method_sig": "MemoryUsage getCollectionUsage()", "description": "Returns the memory usage after the Java virtual machine\n most recently expended effort in recycling unused objects\n in this memory pool.\n This method does not request the Java virtual\n machine to perform any garbage collection other than its normal\n automatic memory management.\n This method returns null if the Java virtual\n machine does not support this method.\n\n \nMBeanServer access:\n The mapped type of MemoryUsage is\n CompositeData with attributes as specified in\n MemoryUsage."}, {"method_name": "isCollectionUsageThresholdSupported", "method_sig": "boolean isCollectionUsageThresholdSupported()", "description": "Tests if this memory pool supports a collection usage threshold."}]}