{"name": "Class MethodHandleProxies", "module": "java.base", "package": "java.lang.invoke", "text": "This class consists exclusively of static methods that help adapt\n method handles to other JVM types, such as interfaces.", "codes": ["public class MethodHandleProxies\nextends Object"], "fields": [], "methods": [{"method_name": "asInterfaceInstance", "method_sig": "public static <T> T asInterfaceInstance (Class<T> intfc,\n                                        MethodHandle target)", "description": "Produces an instance of the given single-method interface which redirects\n its calls to the given method handle.\n \n A single-method interface is an interface which declares a uniquely named method.\n When determining the uniquely named method of a single-method interface,\n the public Object methods (toString, equals, hashCode)\n are disregarded.  For example, Comparator is a single-method interface,\n even though it re-declares the Object.equals method.\n \n The interface must be public.  No additional access checks are performed.\n \n The resulting instance of the required type will respond to\n invocation of the type's uniquely named method by calling\n the given target on the incoming arguments,\n and returning or throwing whatever the target\n returns or throws.  The invocation will be as if by\n target.invoke.\n The target's type will be checked before the\n instance is created, as if by a call to asType,\n which may result in a WrongMethodTypeException.\n \n The uniquely named method is allowed to be multiply declared,\n with distinct type descriptors.  (E.g., it can be overloaded,\n or can possess bridge methods.)  All such declarations are\n connected directly to the target method handle.\n Argument and return types are adjusted by asType\n for each individual declaration.\n \n The wrapper instance will implement the requested interface\n and its super-types, but no other single-method interfaces.\n This means that the instance will not unexpectedly\n pass an instanceof test for any unrequested type.\n \nImplementation Note:\n Therefore, each instance must implement a unique single-method interface.\n Implementations may not bundle together\n multiple single-method interfaces onto single implementation classes\n in the style of AWTEventMulticaster.\n \n The method handle may throw an undeclared exception,\n which means any checked exception (or other checked throwable)\n not declared by the requested type's single abstract method.\n If this happens, the throwable will be wrapped in an instance of\n UndeclaredThrowableException\n and thrown in that wrapped form.\n \n Like Integer.valueOf,\n asInterfaceInstance is a factory method whose results are defined\n by their behavior.\n It is not guaranteed to return a new instance for every call.\n \n Because of the possibility of bridge methods\n and other corner cases, the interface may also have several abstract methods\n with the same name but having distinct descriptors (types of returns and parameters).\n In this case, all the methods are bound in common to the one given target.\n The type check and effective asType conversion is applied to each\n method type descriptor, and all abstract methods are bound to the target in common.\n Beyond this type check, no further checks are made to determine that the\n abstract methods are related in any way.\n \n Future versions of this API may accept additional types,\n such as abstract classes with single abstract methods.\n Future versions of this API may also equip wrapper instances\n with one or more additional public \"marker\" interfaces.\n \n If a security manager is installed, this method is caller sensitive.\n During any invocation of the target method handle via the returned wrapper,\n the original creator of the wrapper (the caller) will be visible\n to context checks requested by the security manager."}, {"method_name": "isWrapperInstance", "method_sig": "public static boolean isWrapperInstance (Object x)", "description": "Determines if the given object was produced by a call to asInterfaceInstance."}, {"method_name": "wrapperInstanceTarget", "method_sig": "public static MethodHandle wrapperInstanceTarget (Object x)", "description": "Produces or recovers a target method handle which is behaviorally\n equivalent to the unique method of this wrapper instance.\n The object x must have been produced by a call to asInterfaceInstance.\n This requirement may be tested via isWrapperInstance."}, {"method_name": "wrapperInstanceType", "method_sig": "public static Class<?> wrapperInstanceType (Object x)", "description": "Recovers the unique single-method interface type for which this wrapper instance was created.\n The object x must have been produced by a call to asInterfaceInstance.\n This requirement may be tested via isWrapperInstance."}]}