{"name": "Interface MidiDevice", "module": "java.desktop", "package": "javax.sound.midi", "text": "MidiDevice is the base interface for all MIDI devices. Common devices\n include synthesizers, sequencers, MIDI input ports, and MIDI output ports.\n \n A MidiDevice can be a transmitter or a receiver of MIDI events, or\n both. Therefore, it can provide Transmitter or Receiver\n instances (or both). Typically, MIDI IN ports provide transmitters, MIDI OUT\n ports and synthesizers provide receivers. A Sequencer typically provides\n transmitters for playback and receivers for recording.\n \n A MidiDevice can be opened and closed explicitly as well as\n implicitly. Explicit opening is accomplished by calling open(),\n explicit closing is done by calling close() on the MidiDevice\n instance. If an application opens a MidiDevice explicitly, it has to\n close it explicitly to free system resources and enable the application to\n exit cleanly. Implicit opening is done by calling\n MidiSystem.getReceiver() and MidiSystem.getTransmitter(). The\n MidiDevice used by MidiSystem.getReceiver and\n MidiSystem.getTransmitter is implementation-dependent unless the\n properties javax.sound.midi.Receiver and\n javax.sound.midi.Transmitter are used (see the description of\n properties to select default providers in MidiSystem). A\n MidiDevice that was opened implicitly, is closed implicitly by\n closing the Receiver or Transmitter that resulted in opening\n it. If more than one implicitly opening Receiver or\n Transmitter were obtained by the application, the device is closed\n after the last Receiver or Transmitter has been closed. On\n the other hand, calling getReceiver or getTransmitter on the\n device instance directly does not open the device implicitly. Closing these\n Transmitters and Receivers does not close the device\n implicitly. To use a device with Receivers or Transmitters\n obtained this way, the device has to be opened and closed explicitly.\n \n If implicit and explicit opening and closing are mixed on the same\n MidiDevice instance, the following rules apply:\n\n \nAfter an explicit open (either before or after implicit opens), the\n   device will not be closed by implicit closing. The only way to close an\n   explicitly opened device is an explicit close.\n   An explicit close always closes the device, even if it also has been\n   opened implicitly. A subsequent implicit close has no further effect.\n \n\n To detect if a MidiDevice represents a hardware MIDI port, the following\n programming technique can be used:\n\n \n MidiDevice device = ...;\n if (!(device instanceof Sequencer) && !(device instanceof Synthesizer)) {\n   // we're now sure that device represents a MIDI port\n   // ...\n }\n \n\n A MidiDevice includes a MidiDevice.Info object to provide manufacturer\n information and so on.", "codes": ["public interface MidiDevice\nextends AutoCloseable"], "fields": [], "methods": [{"method_name": "getDeviceInfo", "method_sig": "MidiDevice.Info getDeviceInfo()", "description": "Obtains information about the device, including its Java class and\n Strings containing its name, vendor, and description."}, {"method_name": "open", "method_sig": "void open()\n   throws MidiUnavailableException", "description": "Opens the device, indicating that it should now acquire any system\n resources it requires and become operational.\n \n An application opening a device explicitly with this call has to close\n the device by calling close(). This is necessary to release system\n resources and allow applications to exit cleanly.\n \n Note that some devices, once closed, cannot be reopened. Attempts to\n reopen such a device will always result in a\n MidiUnavailableException."}, {"method_name": "close", "method_sig": "void close()", "description": "Closes the device, indicating that the device should now release any\n system resources it is using.\n \n All Receiver and Transmitter instances open from this\n device are closed. This includes instances retrieved via\n MidiSystem."}, {"method_name": "isOpen", "method_sig": "boolean isOpen()", "description": "Reports whether the device is open."}, {"method_name": "getMicrosecondPosition", "method_sig": "long getMicrosecondPosition()", "description": "Obtains the current time-stamp of the device, in microseconds. If a\n device supports time-stamps, it should start counting at 0 when the\n device is opened and continue incrementing its time-stamp in microseconds\n until the device is closed. If it does not support time-stamps, it should\n always return -1."}, {"method_name": "getMaxReceivers", "method_sig": "int getMaxReceivers()", "description": "Obtains the maximum number of MIDI IN connections available on this MIDI\n device for receiving MIDI data."}, {"method_name": "getMaxTransmitters", "method_sig": "int getMaxTransmitters()", "description": "Obtains the maximum number of MIDI OUT connections available on this MIDI\n device for transmitting MIDI data."}, {"method_name": "getReceiver", "method_sig": "Receiver getReceiver()\n              throws MidiUnavailableException", "description": "Obtains a MIDI IN receiver through which the MIDI device may receive MIDI\n data. The returned receiver must be closed when the application has\n finished using it.\n \n Usually the returned receiver implements the MidiDeviceReceiver\n interface.\n \n Obtaining a Receiver with this method does not open the device.\n To be able to use the device, it has to be opened explicitly by calling\n open(). Also, closing the Receiver does not close the\n device. It has to be closed explicitly by calling close()."}, {"method_name": "getReceivers", "method_sig": "List<Receiver> getReceivers()", "description": "Returns all currently active, non-closed receivers connected with this\n MidiDevice. A receiver can be removed from the device by closing\n it.\n \n Usually the returned receivers implement the MidiDeviceReceiver\n interface."}, {"method_name": "getTransmitter", "method_sig": "Transmitter getTransmitter()\n                    throws MidiUnavailableException", "description": "Obtains a MIDI OUT connection from which the MIDI device will transmit\n MIDI data. The returned transmitter must be closed when the application\n has finished using it.\n \n Usually the returned transmitter implements the\n MidiDeviceTransmitter interface.\n \n Obtaining a Transmitter with this method does not open the\n device. To be able to use the device, it has to be opened explicitly by\n calling open(). Also, closing the Transmitter does not\n close the device. It has to be closed explicitly by calling\n close()."}, {"method_name": "getTransmitters", "method_sig": "List<Transmitter> getTransmitters()", "description": "Returns all currently active, non-closed transmitters connected with this\n MidiDevice. A transmitter can be removed from the device by\n closing it.\n \n Usually the returned transmitters implement the\n MidiDeviceTransmitter interface."}]}