{"name": "Interface MultiDoc", "module": "java.desktop", "package": "javax.print", "text": "Interface MultiDoc specifies the interface for an object that\n supplies more than one piece of print data for a Print Job. \"Doc\" is a short,\n easy-to-pronounce term that means \"a piece of print data,\" and a \"multidoc\"\n is a group of several docs. The client passes to the Print Job an object that\n implements interface MultiDoc, and the Print Job calls methods on\n that object to obtain the print data.\n \n Interface MultiDoc provides an abstraction similar to a \"linked list\"\n of docs. A multidoc object is like a node in the linked list, containing the\n current doc in the list and a pointer to the next node (multidoc) in the\n list. The Print Job can call the multidoc's getDoc() method\n to get the current doc. When it's ready to go on to the next doc, the Print\n Job can call the multidoc's next() method to get the next\n multidoc, which contains the next doc. So Print Job code for accessing a\n multidoc might look like this:\n\n \n      void processMultiDoc(MultiDoc theMultiDoc) {\n\n          MultiDoc current = theMultiDoc;\n\n          while (current != null) {\n              processDoc (current.getDoc());\n              current = current.next();\n          }\n      }\n \n Of course, interface MultiDoc can be implemented in any way that\n fulfills the contract; it doesn't have to use a linked list in the\n implementation.\n \n To get all the print data for a multidoc print job, a Print Service proxy\n could use either of two patterns:\n \nThe interleaved pattern: Get the doc from the current multidoc.\n   Get the print data representation object from the current doc. Get all the\n   print data from the print data representation object. Get the next multidoc\n   from the current multidoc, and repeat until there are no more. (The code\n   example above uses the interleaved pattern.)\n   The all-at-once pattern: Get the doc from the current multidoc,\n   and save the doc in a list. Get the next multidoc from the current\n   multidoc, and repeat until there are no more. Then iterate over the list of\n   saved docs. Get the print data representation object from the current doc.\n   Get all the print data from the print data representation object. Go to the\n   next doc in the list, and repeat until there are no more.\n \n Now, consider a printing client that is generating print data on the fly and\n does not have the resources to store more than one piece of print data at a\n time. If the print service proxy used the all-at-once pattern to get the\n print data, it would pose a problem for such a client; the client would have\n to keep all the docs' print data around until the print service proxy comes\n back and asks for them, which the client is not able to do. To work with such\n a client, the print service proxy must use the interleaved pattern.\n \n To address this problem, and to simplify the design of clients providing\n multiple docs to a Print Job, every Print Service proxy that supports\n multidoc print jobs is required to access a MultiDoc object using the\n interleaved pattern. That is, given a MultiDoc object, the print\n service proxy will call getDoc() one or more times until it\n successfully obtains the current Doc object. The print service proxy\n will then obtain the current doc's print data, not proceeding until all the\n print data is obtained or an unrecoverable error occurs. If it is able to\n continue, the print service proxy will then call next() one\n or more times until it successfully obtains either the next MultiDoc\n object or an indication that there are no more. An implementation of\n interface MultiDoc can assume the print service proxy will follow\n this interleaved pattern; for any other pattern of usage, the\n MultiDoc implementation's behavior is unspecified.\n \n There is no restriction on the number of client threads that may be\n simultaneously accessing the same multidoc. Therefore, all implementations of\n interface MultiDoc must be designed to be multiple thread safe. In fact, a\n client thread could be adding docs to the end of the (conceptual) list while\n a Print Job thread is simultaneously obtaining docs from the beginning of the\n list; provided the multidoc object synchronizes the threads properly, the two\n threads will not interfere with each other.", "codes": ["public interface MultiDoc"], "fields": [], "methods": [{"method_name": "getDoc", "method_sig": "Doc getDoc()\n    throws IOException", "description": "Obtain the current doc object."}, {"method_name": "next", "method_sig": "MultiDoc next()\n       throws IOException", "description": "Go to the multidoc object that contains the next doc object in the\n sequence of doc objects."}]}