{"name": "Class MutableCallSite", "module": "java.base", "package": "java.lang.invoke", "text": "A MutableCallSite is a CallSite whose target variable\n behaves like an ordinary field.\n An invokedynamic instruction linked to a MutableCallSite delegates\n all calls to the site's current target.\n The dynamic invoker of a mutable call site\n also delegates each call to the site's current target.\n \n Here is an example of a mutable call site which introduces a\n state variable into a method handle chain.\n \n\nMutableCallSite name = new MutableCallSite(MethodType.methodType(String.class));\nMethodHandle MH_name = name.dynamicInvoker();\nMethodType MT_str1 = MethodType.methodType(String.class);\nMethodHandle MH_upcase = MethodHandles.lookup()\n    .findVirtual(String.class, \"toUpperCase\", MT_str1);\nMethodHandle worker1 = MethodHandles.filterReturnValue(MH_name, MH_upcase);\nname.setTarget(MethodHandles.constant(String.class, \"Rocky\"));\nassertEquals(\"ROCKY\", (String) worker1.invokeExact());\nname.setTarget(MethodHandles.constant(String.class, \"Fred\"));\nassertEquals(\"FRED\", (String) worker1.invokeExact());\n// (mutation can be continued indefinitely)\n \n\n The same call site may be used in several places at once.\n \nMethodType MT_str2 = MethodType.methodType(String.class, String.class);\nMethodHandle MH_cat = lookup().findVirtual(String.class,\n  \"concat\", methodType(String.class, String.class));\nMethodHandle MH_dear = MethodHandles.insertArguments(MH_cat, 1, \", dear?\");\nMethodHandle worker2 = MethodHandles.filterReturnValue(MH_name, MH_dear);\nassertEquals(\"Fred, dear?\", (String) worker2.invokeExact());\nname.setTarget(MethodHandles.constant(String.class, \"Wilma\"));\nassertEquals(\"WILMA\", (String) worker1.invokeExact());\nassertEquals(\"Wilma, dear?\", (String) worker2.invokeExact());\n \n\nNon-synchronization of target values:\n A write to a mutable call site's target does not force other threads\n to become aware of the updated value.  Threads which do not perform\n suitable synchronization actions relative to the updated call site\n may cache the old target value and delay their use of the new target\n value indefinitely.\n (This is a normal consequence of the Java Memory Model as applied\n to object fields.)\n \n The syncAll operation provides a way to force threads\n to accept a new target value, even if there is no other synchronization.\n \n For target values which will be frequently updated, consider using\n a volatile call site instead.", "codes": ["public class MutableCallSite\nextends CallSite"], "fields": [], "methods": [{"method_name": "getTarget", "method_sig": "public final MethodHandle getTarget()", "description": "Returns the target method of the call site, which behaves\n like a normal field of the MutableCallSite.\n \n The interactions of getTarget with memory are the same\n as of a read from an ordinary variable, such as an array element or a\n non-volatile, non-final field.\n \n In particular, the current thread may choose to reuse the result\n of a previous read of the target from memory, and may fail to see\n a recent update to the target by another thread."}, {"method_name": "setTarget", "method_sig": "public void setTarget (MethodHandle newTarget)", "description": "Updates the target method of this call site, as a normal variable.\n The type of the new target must agree with the type of the old target.\n \n The interactions with memory are the same\n as of a write to an ordinary variable, such as an array element or a\n non-volatile, non-final field.\n \n In particular, unrelated threads may fail to see the updated target\n until they perform a read from memory.\n Stronger guarantees can be created by putting appropriate operations\n into the bootstrap method and/or the target methods used\n at any given call site."}, {"method_name": "syncAll", "method_sig": "public static void syncAll (MutableCallSite[] sites)", "description": "Performs a synchronization operation on each call site in the given array,\n forcing all other threads to throw away any cached values previously\n loaded from the target of any of the call sites.\n \n This operation does not reverse any calls that have already started\n on an old target value.\n (Java supports forward time travel only.)\n \n The overall effect is to force all future readers of each call site's target\n to accept the most recently stored value.\n (\"Most recently\" is reckoned relative to the syncAll itself.)\n Conversely, the syncAll call may block until all readers have\n (somehow) decached all previous versions of each call site's target.\n \n To avoid race conditions, calls to setTarget and syncAll\n should generally be performed under some sort of mutual exclusion.\n Note that reader threads may observe an updated target as early\n as the setTarget call that install the value\n (and before the syncAll that confirms the value).\n On the other hand, reader threads may observe previous versions of\n the target until the syncAll call returns\n (and after the setTarget that attempts to convey the updated version).\n \n This operation is likely to be expensive and should be used sparingly.\n If possible, it should be buffered for batch processing on sets of call sites.\n \n If sites contains a null element,\n a NullPointerException will be raised.\n In this case, some non-null elements in the array may be\n processed before the method returns abnormally.\n Which elements these are (if any) is implementation-dependent.\n\n Java Memory Model details\n In terms of the Java Memory Model, this operation performs a synchronization\n action which is comparable in effect to the writing of a volatile variable\n by the current thread, and an eventual volatile read by every other thread\n that may access one of the affected call sites.\n \n The following effects are apparent, for each individual call site S:\n \nA new volatile variable V is created, and written by the current thread.\n     As defined by the JMM, this write is a global synchronization event.\n As is normal with thread-local ordering of write events,\n     every action already performed by the current thread is\n     taken to happen before the volatile write to V.\n     (In some implementations, this means that the current thread\n     performs a global release operation.)\n Specifically, the write to the current target of S is\n     taken to happen before the volatile write to V.\n The volatile write to V is placed\n     (in an implementation specific manner)\n     in the global synchronization order.\n Consider an arbitrary thread T (other than the current thread).\n     If T executes a synchronization action A\n     after the volatile write to V (in the global synchronization order),\n     it is therefore required to see either the current target\n     of S, or a later write to that target,\n     if it executes a read on the target of S.\n     (This constraint is called \"synchronization-order consistency\".)\n The JMM specifically allows optimizing compilers to elide\n     reads or writes of variables that are known to be useless.\n     Such elided reads and writes have no effect on the happens-before\n     relation.  Regardless of this fact, the volatile V\n     will not be elided, even though its written value is\n     indeterminate and its read value is not used.\n \n Because of the last point, the implementation behaves as if a\n volatile read of V were performed by T\n immediately after its action A.  In the local ordering\n of actions in T, this read happens before any future\n read of the target of S.  It is as if the\n implementation arbitrarily picked a read of S's target\n by T, and forced a read of V to precede it,\n thereby ensuring communication of the new target value.\n \n As long as the constraints of the Java Memory Model are obeyed,\n implementations may delay the completion of a syncAll\n operation while other threads (T above) continue to\n use previous values of S's target.\n However, implementations are (as always) encouraged to avoid\n livelock, and to eventually require all threads to take account\n of the updated target.\n\n \nDiscussion:\n For performance reasons, syncAll is not a virtual method\n on a single call site, but rather applies to a set of call sites.\n Some implementations may incur a large fixed overhead cost\n for processing one or more synchronization operations,\n but a small incremental cost for each additional call site.\n In any case, this operation is likely to be costly, since\n other threads may have to be somehow interrupted\n in order to make them notice the updated target value.\n However, it may be observed that a single call to synchronize\n several sites has the same formal effect as many calls,\n each on just one of the sites.\n\n \nImplementation Note:\n Simple implementations of MutableCallSite may use\n a volatile variable for the target of a mutable call site.\n In such an implementation, the syncAll method can be a no-op,\n and yet it will conform to the JMM behavior documented above."}]}