{"name": "Interface Name", "module": "java.naming", "package": "javax.naming", "text": "The Name interface represents a generic name -- an ordered\n sequence of components.  It can be a composite name (names that\n span multiple namespaces), or a compound name (names that are\n used within individual hierarchical naming systems).\n\n  There can be different implementations of Name; for example,\n composite names, URLs, or namespace-specific compound names.\n\n  The components of a name are numbered.  The indexes of a name\n with N components range from 0 up to, but not including, N.  This\n range may be written as [0,N).\n The most significant component is at index 0.\n An empty name has no components.\n\n  None of the methods in this interface accept null as a valid\n value for a parameter that is a name or a name component.\n Likewise, methods that return a name or name component never return null.\n\n  An instance of a Name may not be synchronized against\n concurrent multithreaded access if that access is not read-only.", "codes": ["public interface Name\nextends Cloneable, Serializable, Comparable<Object>"], "fields": [{"field_name": "serialVersionUID", "field_sig": "static final long serialVersionUID", "description": "The class fingerprint that is set to indicate\n serialization compatibility with a previous\n version of the class."}], "methods": [{"method_name": "clone", "method_sig": "Object clone()", "description": "Generates a new copy of this name.\n Subsequent changes to the components of this name will not\n affect the new copy, and vice versa."}, {"method_name": "compareTo", "method_sig": "int compareTo (Object obj)", "description": "Compares this name with another name for order.\n Returns a negative integer, zero, or a positive integer as this\n name is less than, equal to, or greater than the given name.\n\n  As with Object.equals(), the notion of ordering for names\n depends on the class that implements this interface.\n For example, the ordering may be\n based on lexicographical ordering of the name components.\n Specific attributes of the name, such as how it treats case,\n may affect the ordering.  In general, two names of different\n classes may not be compared."}, {"method_name": "size", "method_sig": "int size()", "description": "Returns the number of components in this name."}, {"method_name": "isEmpty", "method_sig": "boolean isEmpty()", "description": "Determines whether this name is empty.\n An empty name is one with zero components."}, {"method_name": "getAll", "method_sig": "Enumeration<String> getAll()", "description": "Retrieves the components of this name as an enumeration\n of strings.  The effect on the enumeration of updates to\n this name is undefined.  If the name has zero components,\n an empty (non-null) enumeration is returned."}, {"method_name": "get", "method_sig": "String get (int posn)", "description": "Retrieves a component of this name."}, {"method_name": "getPrefix", "method_sig": "Name getPrefix (int posn)", "description": "Creates a name whose components consist of a prefix of the\n components of this name.  Subsequent changes to\n this name will not affect the name that is returned and vice versa."}, {"method_name": "getSuffix", "method_sig": "Name getSuffix (int posn)", "description": "Creates a name whose components consist of a suffix of the\n components in this name.  Subsequent changes to\n this name do not affect the name that is returned and vice versa."}, {"method_name": "startsWith", "method_sig": "boolean startsWith (Name n)", "description": "Determines whether this name starts with a specified prefix.\n A name n is a prefix if it is equal to\n getPrefix(n.size())."}, {"method_name": "endsWith", "method_sig": "boolean endsWith (Name n)", "description": "Determines whether this name ends with a specified suffix.\n A name n is a suffix if it is equal to\n getSuffix(size()-n.size())."}, {"method_name": "addAll", "method_sig": "Name addAll (Name suffix)\n     throws InvalidNameException", "description": "Adds the components of a name -- in order -- to the end of this name."}, {"method_name": "addAll", "method_sig": "Name addAll (int posn,\n            Name n)\n     throws InvalidNameException", "description": "Adds the components of a name -- in order -- at a specified position\n within this name.\n Components of this name at or after the index of the first new\n component are shifted up (away from 0) to accommodate the new\n components."}, {"method_name": "add", "method_sig": "Name add (String comp)\n  throws InvalidNameException", "description": "Adds a single component to the end of this name."}, {"method_name": "add", "method_sig": "Name add (int posn,\n         String comp)\n  throws InvalidNameException", "description": "Adds a single component at a specified position within this name.\n Components of this name at or after the index of the new component\n are shifted up by one (away from index 0) to accommodate the new\n component."}, {"method_name": "remove", "method_sig": "Object remove (int posn)\n       throws InvalidNameException", "description": "Removes a component from this name.\n The component of this name at the specified position is removed.\n Components with indexes greater than this position\n are shifted down (toward index 0) by one."}]}