{"name": "Class Naming", "module": "java.rmi", "package": "java.rmi", "text": "The Naming class provides methods for storing and obtaining\n references to remote objects in a remote object registry.  Each method of\n the Naming class takes as one of its arguments a name that\n is a java.lang.String in URL format (without the\n scheme component) of the form:\n\n \n    //host:port/name\n \nwhere host is the host (remote or local) where the registry\n is located, port is the port number on which the registry\n accepts calls, and where name is a simple string uninterpreted\n by the registry. Both host and port are optional.\n If host is omitted, the host defaults to the local host. If\n port is omitted, then the port defaults to 1099, the\n \"well-known\" port that RMI's registry, rmiregistry, uses.\n\n Binding a name for a remote object is associating or\n registering a name for a remote object that can be used at a later time to\n look up that remote object.  A remote object can be associated with a name\n using the Naming class's bind or\n rebind methods.\n\n Once a remote object is registered (bound) with the RMI registry on the\n local host, callers on a remote (or local) host can lookup the remote\n object by name, obtain its reference, and then invoke remote methods on the\n object.  A registry may be shared by all servers running on a host or an\n individual server process may create and use its own registry if desired\n (see java.rmi.registry.LocateRegistry.createRegistry method\n for details).", "codes": ["public final class Naming\nextends Object"], "fields": [], "methods": [{"method_name": "lookup", "method_sig": "public static Remote lookup (String name)\n                     throws NotBoundException,\n                            MalformedURLException,\n                            RemoteException", "description": "Returns a reference, a stub, for the remote object associated\n with the specified name."}, {"method_name": "bind", "method_sig": "public static void bind (String name,\n                        Remote obj)\n                 throws AlreadyBoundException,\n                        MalformedURLException,\n                        RemoteException", "description": "Binds the specified name to a remote object."}, {"method_name": "unbind", "method_sig": "public static void unbind (String name)\n                   throws RemoteException,\n                          NotBoundException,\n                          MalformedURLException", "description": "Destroys the binding for the specified name that is associated\n with a remote object."}, {"method_name": "rebind", "method_sig": "public static void rebind (String name,\n                          Remote obj)\n                   throws RemoteException,\n                          MalformedURLException", "description": "Rebinds the specified name to a new remote object. Any existing\n binding for the name is replaced."}, {"method_name": "list", "method_sig": "public static String[] list (String name)\n                     throws RemoteException,\n                            MalformedURLException", "description": "Returns an array of the names bound in the registry.  The names are\n URL-formatted (without the scheme component) strings. The array contains\n a snapshot of the names present in the registry at the time of the\n call."}]}