{"name": "Interface NavigableSet<E>", "module": "java.base", "package": "java.util", "text": "A SortedSet extended with navigation methods reporting\n closest matches for given search targets. Methods lower(E),\n floor(E), ceiling(E), and higher(E) return elements\n respectively less than, less than or equal, greater than or equal,\n and greater than a given element, returning null if there\n is no such element.\n\n A NavigableSet may be accessed and traversed in either\n ascending or descending order.  The descendingSet() method\n returns a view of the set with the senses of all relational and\n directional methods inverted. The performance of ascending\n operations and views is likely to be faster than that of descending\n ones.  This interface additionally defines methods pollFirst() and pollLast() that return and remove the lowest\n and highest element, if one exists, else returning null.\n Methods\n subSet(E, boolean, E, boolean),\n headSet(E, boolean), and\n tailSet(E, boolean)\n differ from the like-named SortedSet methods in accepting\n additional arguments describing whether lower and upper bounds are\n inclusive versus exclusive.  Subsets of any NavigableSet\n must implement the NavigableSet interface.\n\n The return values of navigation methods may be ambiguous in\n implementations that permit null elements. However, even\n in this case the result can be disambiguated by checking\n contains(null). To avoid such issues, implementations of\n this interface are encouraged to not permit insertion of\n null elements. (Note that sorted sets of Comparable elements intrinsically do not permit null.)\n\n Methods\n subSet(E, E),\n headSet(E), and\n tailSet(E)\n are specified to return SortedSet to allow existing\n implementations of SortedSet to be compatibly retrofitted to\n implement NavigableSet, but extensions and implementations\n of this interface are encouraged to override these methods to return\n NavigableSet.\n\n This interface is a member of the\n \n Java Collections Framework.", "codes": ["public interface NavigableSet<E>\nextends SortedSet<E>"], "fields": [], "methods": [{"method_name": "lower", "method_sig": "E lower (E e)", "description": "Returns the greatest element in this set strictly less than the\n given element, or null if there is no such element."}, {"method_name": "floor", "method_sig": "E floor (E e)", "description": "Returns the greatest element in this set less than or equal to\n the given element, or null if there is no such element."}, {"method_name": "ceiling", "method_sig": "E ceiling (E e)", "description": "Returns the least element in this set greater than or equal to\n the given element, or null if there is no such element."}, {"method_name": "higher", "method_sig": "E higher (E e)", "description": "Returns the least element in this set strictly greater than the\n given element, or null if there is no such element."}, {"method_name": "pollFirst", "method_sig": "E pollFirst()", "description": "Retrieves and removes the first (lowest) element,\n or returns null if this set is empty."}, {"method_name": "pollLast", "method_sig": "E pollLast()", "description": "Retrieves and removes the last (highest) element,\n or returns null if this set is empty."}, {"method_name": "iterator", "method_sig": "Iterator<E> iterator()", "description": "Returns an iterator over the elements in this set, in ascending order."}, {"method_name": "descendingSet", "method_sig": "NavigableSet<E> descendingSet()", "description": "Returns a reverse order view of the elements contained in this set.\n The descending set is backed by this set, so changes to the set are\n reflected in the descending set, and vice-versa.  If either set is\n modified while an iteration over either set is in progress (except\n through the iterator's own remove operation), the results of\n the iteration are undefined.\n\n The returned set has an ordering equivalent to\n Collections.reverseOrder(comparator()).\n The expression s.descendingSet().descendingSet() returns a\n view of s essentially equivalent to s."}, {"method_name": "descendingIterator", "method_sig": "Iterator<E> descendingIterator()", "description": "Returns an iterator over the elements in this set, in descending order.\n Equivalent in effect to descendingSet().iterator()."}, {"method_name": "subSet", "method_sig": "NavigableSet<E> subSet (E fromElement,\n                       boolean fromInclusive,\n                       E toElement,\n                       boolean toInclusive)", "description": "Returns a view of the portion of this set whose elements range from\n fromElement to toElement.  If fromElement and\n toElement are equal, the returned set is empty unless \n fromInclusive and toInclusive are both true.  The returned set\n is backed by this set, so changes in the returned set are reflected in\n this set, and vice-versa.  The returned set supports all optional set\n operations that this set supports.\n\n The returned set will throw an IllegalArgumentException\n on an attempt to insert an element outside its range."}, {"method_name": "headSet", "method_sig": "NavigableSet<E> headSet (E toElement,\n                        boolean inclusive)", "description": "Returns a view of the portion of this set whose elements are less than\n (or equal to, if inclusive is true) toElement.  The\n returned set is backed by this set, so changes in the returned set are\n reflected in this set, and vice-versa.  The returned set supports all\n optional set operations that this set supports.\n\n The returned set will throw an IllegalArgumentException\n on an attempt to insert an element outside its range."}, {"method_name": "tailSet", "method_sig": "NavigableSet<E> tailSet (E fromElement,\n                        boolean inclusive)", "description": "Returns a view of the portion of this set whose elements are greater\n than (or equal to, if inclusive is true) fromElement.\n The returned set is backed by this set, so changes in the returned set\n are reflected in this set, and vice-versa.  The returned set supports\n all optional set operations that this set supports.\n\n The returned set will throw an IllegalArgumentException\n on an attempt to insert an element outside its range."}, {"method_name": "subSet", "method_sig": "SortedSet<E> subSet (E fromElement,\n                    E toElement)", "description": "Returns a view of the portion of this set whose elements range\n from fromElement, inclusive, to toElement,\n exclusive.  (If fromElement and toElement are\n equal, the returned set is empty.)  The returned set is backed\n by this set, so changes in the returned set are reflected in\n this set, and vice-versa.  The returned set supports all\n optional set operations that this set supports.\n\n The returned set will throw an IllegalArgumentException\n on an attempt to insert an element outside its range.\n\n Equivalent to subSet(fromElement, true, toElement, false)."}, {"method_name": "headSet", "method_sig": "SortedSet<E> headSet (E toElement)", "description": "Returns a view of the portion of this set whose elements are\n strictly less than toElement.  The returned set is\n backed by this set, so changes in the returned set are\n reflected in this set, and vice-versa.  The returned set\n supports all optional set operations that this set supports.\n\n The returned set will throw an IllegalArgumentException\n on an attempt to insert an element outside its range.\n\n Equivalent to headSet(toElement, false)."}, {"method_name": "tailSet", "method_sig": "SortedSet<E> tailSet (E fromElement)", "description": "Returns a view of the portion of this set whose elements are\n greater than or equal to fromElement.  The returned\n set is backed by this set, so changes in the returned set are\n reflected in this set, and vice-versa.  The returned set\n supports all optional set operations that this set supports.\n\n The returned set will throw an IllegalArgumentException\n on an attempt to insert an element outside its range.\n\n Equivalent to tailSet(fromElement, true)."}]}