{"name": "Class NumberUp", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class NumberUp is an integer valued printing attribute class that\n specifies the number of print-stream pages to impose upon a single side of an\n instance of a selected medium. That is, if the NumberUp value is n,\n the printer must place n print-stream pages on a single side of an\n instance of the selected medium. To accomplish this, the printer may add some\n sort of translation, scaling, or rotation. This attribute primarily controls\n the translation, scaling and rotation of print-stream pages.\n \n The effect of a NumberUp attribute on a multidoc print job (a job\n with multiple documents) depends on whether all the docs have the same number\n up values specified or whether different docs have different number up values\n specified, and on the (perhaps defaulted) value of the\n MultipleDocumentHandling attribute.\n \nIf all the docs have the same number up value n specified, then\n   any value of MultipleDocumentHandling\n   makes sense, and the printer's processing depends on the\n   MultipleDocumentHandling value:\n   \nSINGLE_DOCUMENT -- All the input docs will be combined\n     together into one output document. Each media impression will consist of\n     nm print-stream pages from the output document.\n     SINGLE_DOCUMENT_NEW_SHEET -- All the input docs will be\n     combined together into one output document. Each media impression will\n     consist of n print-stream pages from the output document. However,\n     the first impression of each input doc will always start on a new media\n     sheet; this means the last impression of an input doc may have fewer than\n     n print-stream pages on it.\n     SEPARATE_DOCUMENTS_UNCOLLATED_COPIES -- The input docs will\n     remain separate. Each media impression will consist of n\n     print-stream pages from the input doc. Since the input docs are separate,\n     the first impression of each input doc will always start on a new media\n     sheet; this means the last impression of an input doc may have fewer than\n     n print-stream pages on it.\n     SEPARATE_DOCUMENTS_COLLATED_COPIES -- The input docs will\n     remain separate. Each media impression will consist of n\n     print-stream pages from the input doc. Since the input docs are separate,\n     the first impression of each input doc will always start on a new media\n     sheet; this means the last impression of an input doc may have fewer than\n     n print-stream pages on it.\n   \n\nSINGLE_DOCUMENT -- All the input docs will be combined\n     together into one output document. Each media impression will consist of\n     ni print-stream pages from the output document, where\n     i is the number of the input doc corresponding to that point in\n     the output document. When the next input doc has a different number up\n     value from the previous input doc, the first print-stream page of the\n     next input doc goes at the start of the next media impression, possibly\n     leaving fewer than the full number of print-stream pages on the previous\n     media impression.\n     SINGLE_DOCUMENT_NEW_SHEET -- All the input docs will be\n     combined together into one output document. Each media impression will\n     consist of n print-stream pages from the output document. However,\n     the first impression of each input doc will always start on a new media\n     sheet; this means the last impression of an input doc may have fewer than\n     n print-stream pages on it.\n     SEPARATE_DOCUMENTS_UNCOLLATED_COPIES -- The input docs will\n     remain separate. For input doc i, each media impression will\n     consist of ni print-stream pages from the input doc.\n     Since the input docs are separate, the first impression of each input doc\n     will always start on a new media sheet; this means the last impression of\n     an input doc may have fewer than ni print-stream pages\n     on it.\n     SEPARATE_DOCUMENTS_COLLATED_COPIES -- The input docs will\n     remain separate. For input doc i, each media impression will\n     consist of ni print-stream pages from the input doc.\n     Since the input docs are separate, the first impression of each input doc\n     will always start on a new media sheet; this means the last impression of\n     an input doc may have fewer than ni print-stream pages\n     on it.\n   \n\nIPP Compatibility: The integer value gives the IPP integer value. The\n category name returned by getName() gives the IPP attribute name.", "codes": ["public final class NumberUp\nextends IntegerSyntax\nimplements DocAttribute, PrintRequestAttribute, PrintJobAttribute"], "fields": [], "methods": [{"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this number up attribute is equivalent to the passed in\n object. To be equivalent, all of the following conditions must be true:\n \nobject is not null.\n   object is an instance of class NumberUp.\n   This number up attribute's value and object's value are\n   equal.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class NumberUp, the category is class NumberUp\n itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class NumberUp, the category name is \"number-up\"."}]}