{"name": "Class Observable", "module": "java.base", "package": "java.util", "text": "This class represents an observable object, or \"data\"\n in the model-view paradigm. It can be subclassed to represent an\n object that the application wants to have observed.\n \n An observable object can have one or more observers. An observer\n may be any object that implements interface Observer. After an\n observable instance changes, an application calling the\n Observable's notifyObservers method\n causes all of its observers to be notified of the change by a call\n to their update method.\n \n The order in which notifications will be delivered is unspecified.\n The default implementation provided in the Observable class will\n notify Observers in the order in which they registered interest, but\n subclasses may change this order, use no guaranteed order, deliver\n notifications on separate threads, or may guarantee that their\n subclass follows this order, as they choose.\n \n Note that this notification mechanism has nothing to do with threads\n and is completely separate from the wait and notify\n mechanism of class Object.\n \n When an observable object is newly created, its set of observers is\n empty. Two observers are considered the same if and only if the\n equals method returns true for them.", "codes": ["@Deprecated(since=\"9\")\npublic class Observable\nextends Object"], "fields": [], "methods": [{"method_name": "addObserver", "method_sig": "public void addObserver (Observer o)", "description": "Adds an observer to the set of observers for this object, provided\n that it is not the same as some observer already in the set.\n The order in which notifications will be delivered to multiple\n observers is not specified. See the class comment."}, {"method_name": "deleteObserver", "method_sig": "public void deleteObserver (Observer o)", "description": "Deletes an observer from the set of observers of this object.\n Passing null to this method will have no effect."}, {"method_name": "notifyObservers", "method_sig": "public void notifyObservers()", "description": "If this object has changed, as indicated by the\n hasChanged method, then notify all of its observers\n and then call the clearChanged method to\n indicate that this object has no longer changed.\n \n Each observer has its update method called with two\n arguments: this observable object and null. In other\n words, this method is equivalent to:\n \n notifyObservers(null)"}, {"method_name": "notifyObservers", "method_sig": "public void notifyObservers (Object arg)", "description": "If this object has changed, as indicated by the\n hasChanged method, then notify all of its observers\n and then call the clearChanged method to indicate\n that this object has no longer changed.\n \n Each observer has its update method called with two\n arguments: this observable object and the arg argument."}, {"method_name": "deleteObservers", "method_sig": "public void deleteObservers()", "description": "Clears the observer list so that this object no longer has any observers."}, {"method_name": "setChanged", "method_sig": "protected void setChanged()", "description": "Marks this Observable object as having been changed; the\n hasChanged method will now return true."}, {"method_name": "clearChanged", "method_sig": "protected void clearChanged()", "description": "Indicates that this object has no longer changed, or that it has\n already notified all of its observers of its most recent change,\n so that the hasChanged method will now return false.\n This method is called automatically by the\n notifyObservers methods."}, {"method_name": "hasChanged", "method_sig": "public boolean hasChanged()", "description": "Tests if this object has changed."}, {"method_name": "countObservers", "method_sig": "public int countObservers()", "description": "Returns the number of observers of this Observable object."}]}