{"name": "Class OrientationRequested", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class OrientationRequested is a printing attribute class, an\n enumeration, that indicates the desired orientation for printed print-stream\n pages; it does not describe the orientation of the client-supplied\n print-stream pages.\n \n For some document formats (such as \"application/postscript\"), the\n desired orientation of the print-stream pages is specified within the\n document data. This information is generated by a device driver prior to the\n submission of the print job. Other document formats (such as\n \"text/plain\") do not include the notion of desired orientation within\n the document data. In the latter case it is possible for the printer to bind\n the desired orientation to the document data after it has been submitted. It\n is expected that a printer would only support the\n OrientationRequested attribute for some document formats (e.g.,\n \"text/plain\" or \"text/html\") but not others (e.g.\n \"application/postscript\"). This is no different from any other job\n template attribute, since a print job can always impose constraints among the\n values of different job template attributes. However, a special mention is\n made here since it is very likely that a printer will support the\n OrientationRequested attribute for only a subset of the supported\n document formats.\n \nIPP Compatibility: The category name returned by getName() is\n the IPP attribute name. The enumeration's integer value is the IPP enum\n value. The toString() method returns the IPP string representation of\n the attribute value.", "codes": ["public final class OrientationRequested\nextends EnumSyntax\nimplements DocAttribute, PrintRequestAttribute, PrintJobAttribute"], "fields": [{"field_name": "PORTRAIT", "field_sig": "public static final OrientationRequested PORTRAIT", "description": "The content will be imaged across the short edge of the medium."}, {"field_name": "LANDSCAPE", "field_sig": "public static final OrientationRequested LANDSCAPE", "description": "The content will be imaged across the long edge of the medium. Landscape\n is defined to be a rotation of the print-stream page to be imaged by +90\n degrees with respect to the medium (i.e. anti-clockwise) from the\n portrait orientation. Note: The +90 direction was chosen because\n simple finishing on the long edge is the same edge whether portrait or\n landscape."}, {"field_name": "REVERSE_LANDSCAPE", "field_sig": "public static final OrientationRequested REVERSE_LANDSCAPE", "description": "The content will be imaged across the long edge of the medium, but in the\n opposite manner from landscape. Reverse-landscape is defined to be a\n rotation of the print-stream page to be imaged by -90 degrees with\n respect to the medium (i.e. clockwise) from the portrait orientation.\n Note: The REVERSE_LANDSCAPE value was added because some\n applications rotate landscape -90 degrees from portrait, rather than +90\n degrees."}, {"field_name": "REVERSE_PORTRAIT", "field_sig": "public static final OrientationRequested REVERSE_PORTRAIT", "description": "The content will be imaged across the short edge of the medium, but in\n the opposite manner from portrait. Reverse-portrait is defined to be a\n rotation of the print-stream page to be imaged by 180 degrees with\n respect to the medium from the portrait orientation. Note: The\n REVERSE_PORTRAIT value was added for use with the\n Finishings attribute in cases where the opposite edge\n is desired for finishing a portrait document on simple finishing devices\n that have only one finishing position. Thus a \"text/plain\"\n portrait document can be stapled \"on the right\" by a simple finishing\n device as is common use with some Middle Eastern languages such as\n Hebrew."}], "methods": [{"method_name": "getStringTable", "method_sig": "protected String[] getStringTable()", "description": "Returns the string table for class OrientationRequested."}, {"method_name": "getEnumValueTable", "method_sig": "protected EnumSyntax[] getEnumValueTable()", "description": "Returns the enumeration value table for class\n OrientationRequested."}, {"method_name": "getOffset", "method_sig": "protected int getOffset()", "description": "Returns the lowest integer value used by class\n OrientationRequested."}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class OrientationRequested, the category is class\n OrientationRequested itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class OrientationRequested, the category name is\n \"orientation-requested\"."}]}