{"name": "Class OutputStreamWriter", "module": "java.base", "package": "java.io", "text": "An OutputStreamWriter is a bridge from character streams to byte streams:\n Characters written to it are encoded into bytes using a specified charset.  The charset that it uses\n may be specified by name or may be given explicitly, or the platform's\n default charset may be accepted.\n\n  Each invocation of a write() method causes the encoding converter to be\n invoked on the given character(s).  The resulting bytes are accumulated in a\n buffer before being written to the underlying output stream.  Note that the\n characters passed to the write() methods are not buffered.\n\n  For top efficiency, consider wrapping an OutputStreamWriter within a\n BufferedWriter so as to avoid frequent converter invocations.  For example:\n\n \n Writer out\n   = new BufferedWriter(new OutputStreamWriter(System.out));\n \n A surrogate pair is a character represented by a sequence of two\n char values: A high surrogate in the range '\\uD800' to\n '\\uDBFF' followed by a low surrogate in the range '\\uDC00' to\n '\\uDFFF'.\n\n  A malformed surrogate element is a high surrogate that is not\n followed by a low surrogate or a low surrogate that is not preceded by a\n high surrogate.\n\n  This class always replaces malformed surrogate elements and unmappable\n character sequences with the charset's default substitution sequence.\n The CharsetEncoder class should be used when more\n control over the encoding process is required.", "codes": ["public class OutputStreamWriter\nextends Writer"], "fields": [], "methods": [{"method_name": "getEncoding", "method_sig": "public String getEncoding()", "description": "Returns the name of the character encoding being used by this stream.\n\n  If the encoding has an historical name then that name is returned;\n otherwise the encoding's canonical name is returned.\n\n  If this instance was created with the OutputStreamWriter(OutputStream, String) constructor then the returned\n name, being unique for the encoding, may differ from the name passed to\n the constructor.  This method may return null if the stream has\n been closed. "}, {"method_name": "write", "method_sig": "public void write (int c)\n           throws IOException", "description": "Writes a single character."}, {"method_name": "write", "method_sig": "public void write (char[] cbuf,\n                  int off,\n                  int len)\n           throws IOException", "description": "Writes a portion of an array of characters."}, {"method_name": "write", "method_sig": "public void write (String str,\n                  int off,\n                  int len)\n           throws IOException", "description": "Writes a portion of a string."}, {"method_name": "flush", "method_sig": "public void flush()\n           throws IOException", "description": "Flushes the stream."}]}