{"name": "Class OutputDeviceAssigned", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class OutputDeviceAssigned is a printing attribute class, a text\n attribute, that identifies the output device to which the service has\n assigned this job. If an output device implements an embedded Print Service\n instance, the printer need not set this attribute. If a print server\n implements a Print Service instance, the value may be empty (zero- length\n string) or not returned until the service assigns an output device to the\n job. This attribute is particularly useful when a single service supports\n multiple devices (so called \"fan-out\").\n \nIPP Compatibility: The string value gives the IPP name value. The\n locale gives the IPP natural language. The category name returned by\n getName() gives the IPP attribute name.", "codes": ["public final class OutputDeviceAssigned\nextends TextSyntax\nimplements PrintJobAttribute"], "fields": [], "methods": [{"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this output device assigned attribute is equivalent to\n the passed in object. To be equivalent, all of the following conditions\n must be true:\n \nobject is not null.\n   object is an instance of class\n   OutputDeviceAssigned.\n   This output device assigned attribute's underlying string and\n   object's underlying string are equal.\n   This output device assigned attribute's locale and object's\n   locale are equal.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class OutputDeviceAssigned, the category is class\n OutputDeviceAssigned itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class OutputDeviceAssigned, the category name is\n \"output-device-assigned\"."}]}