{"name": "Class OutputKeys", "module": "java.xml", "package": "javax.xml.transform", "text": "Provides string constants that can be used to set\n output properties for a Transformer, or to retrieve\n output properties from a Transformer or Templates object.\n All the fields in this class are read-only.", "codes": ["public class OutputKeys\nextends Object"], "fields": [{"field_name": "METHOD", "field_sig": "public static final String METHOD", "description": "method = \"xml\" | \"html\" | \"text\" | expanded name.\n\n The value of the method property identifies the overall method that\n should be used for outputting the result tree.  Other non-namespaced\n values may be used, such as \"xhtml\", but, if accepted, the handling\n of such values is implementation defined.  If any of the method values\n are not accepted and are not namespace qualified,\n then Transformer.setOutputProperty(java.lang.String, java.lang.String)\n or Transformer.setOutputProperties(java.util.Properties) will\n throw a IllegalArgumentException."}, {"field_name": "VERSION", "field_sig": "public static final String VERSION", "description": "version = nmtoken.\n\n version specifies the version of the output\n method.\nWhen the output method is \"xml\", the version value specifies the\n version of XML to be used for outputting the result tree. The default\n value for the xml output method is 1.0. When the output method is\n \"html\", the version value indicates the version of the HTML.\n The default value for the xml output method is 4.0, which specifies\n that the result should be output as HTML conforming to the HTML 4.0\n Recommendation [HTML].  If the output method is \"text\", the version\n property is ignored."}, {"field_name": "ENCODING", "field_sig": "public static final String ENCODING", "description": "encoding = string.\n\n encoding specifies the preferred character\n encoding that the Transformer should use to encode sequences of\n characters as sequences of bytes. The value of the encoding property should be\n treated case-insensitively. The value must only contain characters in\n the range #x21 to #x7E (i.e., printable ASCII characters). The value\n should either be a charset registered with the Internet\n Assigned Numbers Authority [IANA],\n [RFC2278]\n or start with X-."}, {"field_name": "OMIT_XML_DECLARATION", "field_sig": "public static final String OMIT_XML_DECLARATION", "description": "omit-xml-declaration = \"yes\" | \"no\".\n\n omit-xml-declaration specifies whether the XSLT\n processor should output an XML declaration; the value must be\n yes or no."}, {"field_name": "STANDALONE", "field_sig": "public static final String STANDALONE", "description": "standalone = \"yes\" | \"no\".\n\n standalone specifies whether the Transformer\n should output a standalone document declaration; the value must be\n yes or no."}, {"field_name": "DOCTYPE_PUBLIC", "field_sig": "public static final String DOCTYPE_PUBLIC", "description": "doctype-public = string.\n See the documentation for the DOCTYPE_SYSTEM property\n for a description of what the value of the key should be."}, {"field_name": "DOCTYPE_SYSTEM", "field_sig": "public static final String DOCTYPE_SYSTEM", "description": "doctype-system = string.\n doctype-system specifies the system identifier\n to be used in the document type declaration.\nIf the doctype-system property is specified, the xml output method\n should output a document type declaration immediately before the first\n element. The name following <!DOCTYPE should be the name of the first\n element. If doctype-public property is also specified, then the xml\n output method should output PUBLIC followed by the public identifier\n and then the system identifier; otherwise, it should output SYSTEM\n followed by the system identifier. The internal subset should be empty.\n The value of the doctype-public property should be ignored unless the doctype-system\n property is specified.\nIf the doctype-public or doctype-system properties are specified,\n then the html output method should output a document type declaration\n immediately before the first element. The name following <!DOCTYPE\n should be HTML or html. If the doctype-public property is specified,\n then the output method should output PUBLIC followed by the specified\n public identifier; if the doctype-system property is also specified,\n it should also output the specified system identifier following the\n public identifier. If the doctype-system property is specified but\n the doctype-public property is not specified, then the output method\n should output SYSTEM followed by the specified system identifier.\ndoctype-system specifies the system identifier\n to be used in the document type declaration."}, {"field_name": "CDATA_SECTION_ELEMENTS", "field_sig": "public static final String CDATA_SECTION_ELEMENTS", "description": "cdata-section-elements = expanded names.\n\n cdata-section-elements specifies a whitespace delimited\n list of the names of elements whose text node children should be output\n using CDATA sections. Note that these names must use the format\n described in the section Qualfied Name Representation in\n javax.xml.transform."}, {"field_name": "INDENT", "field_sig": "public static final String INDENT", "description": "indent = \"yes\" | \"no\".\n\n indent specifies whether the Transformer may\n add additional whitespace when outputting the result tree; the value\n must be yes or no.  "}, {"field_name": "MEDIA_TYPE", "field_sig": "public static final String MEDIA_TYPE", "description": "media-type = string.\n\n media-type specifies the media type (MIME\n content type) of the data that results from outputting the result\n tree. The charset parameter should not be specified\n explicitly; instead, when the top-level media type is\n text, a charset parameter should be added\n according to the character encoding actually used by the output\n method.  "}], "methods": []}