{"name": "Class PackedColorModel", "module": "java.desktop", "package": "java.awt.image", "text": "The PackedColorModel class is an abstract\n ColorModel class that works with pixel values which represent\n color and alpha information as separate samples and which pack all\n samples for a single pixel into a single int, short, or byte quantity.\n This class can be used with an arbitrary ColorSpace.  The number of\n color samples in the pixel values must be the same as the number of color\n components in the ColorSpace.  There can be a single alpha\n sample.  The array length is always 1 for those methods that use a\n primitive array pixel representation of type transferType.\n The transfer types supported are DataBuffer.TYPE_BYTE,\n DataBuffer.TYPE_USHORT, and DataBuffer.TYPE_INT.\n Color and alpha samples are stored in the single element of the array\n in bits indicated by bit masks.  Each bit mask must be contiguous and\n masks must not overlap.  The same masks apply to the single int\n pixel representation used by other methods.  The correspondence of\n masks and color/alpha samples is as follows:\n \n Masks are identified by indices running from 0 through\n getNumComponents - 1.\n  The first\n getNumColorComponents\n indices refer to color samples.\n  If an alpha sample is present, it corresponds the last index.\n  The order of the color indices is specified\n by the ColorSpace.  Typically, this reflects the name of\n the color space type (for example, TYPE_RGB), index 0\n corresponds to red, index 1 to green, and index 2 to blue.\n \n\n The translation from pixel values to color/alpha components for\n display or processing purposes is a one-to-one correspondence of\n samples to components.\n A PackedColorModel is typically used with image data\n that uses masks to define packed samples.  For example, a\n PackedColorModel can be used in conjunction with a\n SinglePixelPackedSampleModel to construct a\n BufferedImage.  Normally the masks used by the\n SampleModel and the ColorModel would be the same.\n However, if they are different, the color interpretation of pixel data is\n done according to the masks of the ColorModel.\n \n A single int pixel representation is valid for all objects\n of this class since it is always possible to represent pixel values\n used with this class in a single int.  Therefore, methods\n that use this representation do not throw an\n IllegalArgumentException due to an invalid pixel value.\n \n A subclass of PackedColorModel is DirectColorModel,\n which is similar to an X11 TrueColor visual.", "codes": ["public abstract class PackedColorModel\nextends ColorModel"], "fields": [], "methods": [{"method_name": "getMask", "method_sig": "public final int getMask (int index)", "description": "Returns the mask indicating which bits in a pixel\n contain the specified color/alpha sample.  For color\n samples, index corresponds to the placement of color\n sample names in the color space.  Thus, an index\n equal to 0 for a CMYK ColorSpace would correspond to\n Cyan and an index equal to 1 would correspond to\n Magenta.  If there is alpha, the alpha index would be:\n \n      alphaIndex = numComponents() - 1;\n "}, {"method_name": "getMasks", "method_sig": "public final int[] getMasks()", "description": "Returns a mask array indicating which bits in a pixel\n contain the color and alpha samples."}, {"method_name": "createCompatibleSampleModel", "method_sig": "public SampleModel createCompatibleSampleModel (int w,\n                                               int h)", "description": "Creates a SampleModel with the specified width and\n height that has a data layout compatible with this\n ColorModel."}, {"method_name": "isCompatibleSampleModel", "method_sig": "public boolean isCompatibleSampleModel (SampleModel sm)", "description": "Checks if the specified SampleModel is compatible\n with this ColorModel.  If sm is\n null, this method returns false."}, {"method_name": "getAlphaRaster", "method_sig": "public WritableRaster getAlphaRaster (WritableRaster raster)", "description": "Returns a WritableRaster representing the alpha channel of\n an image, extracted from the input WritableRaster.\n This method assumes that WritableRaster objects\n associated with this ColorModel store the alpha band,\n if present, as the last band of image data.  Returns null\n if there is no separate spatial alpha channel associated with this\n ColorModel.  This method creates a new\n WritableRaster, but shares the data array."}, {"method_name": "equals", "method_sig": "public boolean equals (Object obj)", "description": "Tests if the specified Object is an instance\n of PackedColorModel and equals this\n PackedColorModel."}, {"method_name": "hashCode", "method_sig": "public int hashCode()", "description": "Returns the hash code for this PackedColorModel."}]}