{"name": "Interface Pack200.Packer", "module": "java.base", "package": "java.util.jar", "text": "The packer engine applies various transformations to the input JAR file,\n making the pack stream highly compressible by a compressor such as\n gzip or zip. An instance of the engine can be obtained\n using Pack200.newPacker().\n\n The high degree of compression is achieved\n by using a number of techniques described in the JSR 200 specification.\n Some of the techniques are sorting, re-ordering and co-location of the\n constant pool.\n \n The pack engine is initialized to an initial state as described\n by their properties below.\n The initial state can be manipulated by getting the\n engine properties (using properties()) and storing\n the modified properties on the map.\n The resource files will be passed through with no changes at all.\n The class files will not contain identical bytes, since the unpacker\n is free to change minor class file features such as constant pool order.\n However, the class files will be semantically identical,\n as specified in\n The Java™ Virtual Machine Specification.\n \n By default, the packer does not change the order of JAR elements.\n Also, the modification time and deflation hint of each\n JAR element is passed unchanged.\n (Any other ZIP-archive information, such as extra attributes\n giving Unix file permissions, are lost.)\n \n Note that packing and unpacking a JAR will in general alter the\n bytewise contents of classfiles in the JAR.  This means that packing\n and unpacking will in general invalidate any digital signatures\n which rely on bytewise images of JAR elements.  In order both to sign\n and to pack a JAR, you must first pack and unpack the JAR to\n \"normalize\" it, then compute signatures on the unpacked JAR elements,\n and finally repack the signed JAR.\n Both packing steps should\n use precisely the same options, and the segment limit may also\n need to be set to \"-1\", to prevent accidental variation of segment\n boundaries as class file sizes change slightly.\n \n (Here's why this works:  Any reordering the packer does\n of any classfile structures is idempotent, so the second packing\n does not change the orderings produced by the first packing.\n Also, the unpacker is guaranteed by the JSR 200 specification\n to produce a specific bytewise image for any given transmission\n ordering of archive elements.)\n \n In order to maintain backward compatibility, the pack file's version is\n set to accommodate the class files present in the input JAR file. In\n other words, the pack file version will be the latest, if the class files\n are the latest and conversely the pack file version will be the oldest\n if the class file versions are also the oldest. For intermediate class\n file versions the corresponding pack file version will be used.\n For example:\n    If the input JAR-files are solely comprised of 1.5  (or  lesser)\n class files, a 1.5 compatible pack file is  produced. This will also be\n the case for archives that have no class files.\n    If the input JAR-files contains a 1.6 class file, then the pack file\n version will be set to 1.6.\n \n Note: Unless otherwise noted, passing a null argument to a\n constructor or method in this class will cause a NullPointerException\n to be thrown.", "codes": ["@Deprecated(since=\"11\",\n            forRemoval=true)\npublic static interface Pack200.Packer"], "fields": [{"field_name": "SEGMENT_LIMIT", "field_sig": "static final String SEGMENT_LIMIT", "description": "This property is a numeral giving the estimated target size N\n (in bytes) of each archive segment.\n If a single input file requires more than N bytes,\n it will be given its own archive segment.\n \n As a special case, a value of -1 will produce a single large\n segment with all input files, while a value of 0 will\n produce one segment for each class.\n Larger archive segments result in less fragmentation and\n better compression, but processing them requires more memory.\n \n The size of each segment is estimated by counting the size of each\n input file to be transmitted in the segment, along with the size\n of its name and other transmitted properties.\n \n The default is -1, which means the packer will always create a single\n segment output file. In cases where extremely large output files are\n generated, users are strongly encouraged to use segmenting or break\n up the input file into smaller JARs.\n \n A 10Mb JAR packed without this limit will\n typically pack about 10% smaller, but the packer may require\n a larger Java heap (about ten times the segment limit)."}, {"field_name": "KEEP_FILE_ORDER", "field_sig": "static final String KEEP_FILE_ORDER", "description": "If this property is set to TRUE, the packer will transmit\n all elements in their original order within the source archive.\n \n If it is set to FALSE, the packer may reorder elements,\n and also remove JAR directory entries, which carry no useful\n information for Java applications.\n (Typically this enables better compression.)\n \n The default is TRUE, which preserves the input information,\n but may cause the transmitted archive to be larger than necessary."}, {"field_name": "EFFORT", "field_sig": "static final String EFFORT", "description": "If this property is set to a single decimal digit, the packer will\n use the indicated amount of effort in compressing the archive.\n Level 1 may produce somewhat larger size and faster compression speed,\n while level 9 will take much longer but may produce better compression.\n \n The special value 0 instructs the packer to copy through the\n original JAR file directly, with no compression.  The JSR 200\n standard requires any unpacker to understand this special case\n as a pass-through of the entire archive.\n \n The default is 5, investing a modest amount of time to\n produce reasonable compression."}, {"field_name": "DEFLATE_HINT", "field_sig": "static final String DEFLATE_HINT", "description": "If this property is set to TRUE or FALSE, the packer\n will set the deflation hint accordingly in the output archive, and\n will not transmit the individual deflation hints of archive elements.\n \n If this property is set to the special string KEEP, the packer\n will attempt to determine an independent deflation hint for each\n available element of the input archive, and transmit this hint separately.\n \n The default is KEEP, which preserves the input information,\n but may cause the transmitted archive to be larger than necessary.\n \n It is up to the unpacker implementation\n to take action upon the hint to suitably compress the elements of\n the resulting unpacked jar.\n \n The deflation hint of a ZIP or JAR element indicates\n whether the element was deflated or stored directly."}, {"field_name": "MODIFICATION_TIME", "field_sig": "static final String MODIFICATION_TIME", "description": "If this property is set to the special string LATEST,\n the packer will attempt to determine the latest modification time,\n among all the available entries in the original archive or the latest\n modification time of all the available entries in each segment.\n This single value will be transmitted as part of the segment and applied\n to all the entries in each segment, SEGMENT_LIMIT.\n \n This can marginally decrease the transmitted size of the\n archive, at the expense of setting all installed files to a single\n date.\n \n If this property is set to the special string KEEP,\n the packer transmits a separate modification time for each input\n element.\n \n The default is KEEP, which preserves the input information,\n but may cause the transmitted archive to be larger than necessary.\n \n It is up to the unpacker implementation to take action to suitably\n set the modification time of each element of its output file."}, {"field_name": "PASS_FILE_PFX", "field_sig": "static final String PASS_FILE_PFX", "description": "Indicates that a file should be passed through bytewise, with no\n compression.  Multiple files may be specified by specifying\n additional properties with distinct strings appended, to\n make a family of properties with the common prefix.\n \n There is no pathname transformation, except\n that the system file separator is replaced by the JAR file\n separator '/'.\n \n The resulting file names must match exactly as strings with their\n occurrences in the JAR file.\n \n If a property value is a directory name, all files under that\n directory will be passed also.\n \n Examples:\n \n     Map p = packer.properties();\n     p.put(PASS_FILE_PFX+0, \"mutants/Rogue.class\");\n     p.put(PASS_FILE_PFX+1, \"mutants/Wolverine.class\");\n     p.put(PASS_FILE_PFX+2, \"mutants/Storm.class\");\n     # Pass all files in an entire directory hierarchy:\n     p.put(PASS_FILE_PFX+3, \"police/\");\n "}, {"field_name": "UNKNOWN_ATTRIBUTE", "field_sig": "static final String UNKNOWN_ATTRIBUTE", "description": "Indicates the action to take when a class-file containing an unknown\n attribute is encountered.  Possible values are the strings ERROR,\n STRIP, and PASS.\n \n The string ERROR means that the pack operation\n as a whole will fail, with an exception of type IOException.\n The string\n STRIP means that the attribute will be dropped.\n The string\n PASS means that the whole class-file will be passed through\n (as if it were a resource file) without compression, with  a suitable warning.\n This is the default value for this property.\n \n Examples:\n \n     Map p = pack200.getProperties();\n     p.put(UNKNOWN_ATTRIBUTE, ERROR);\n     p.put(UNKNOWN_ATTRIBUTE, STRIP);\n     p.put(UNKNOWN_ATTRIBUTE, PASS);\n "}, {"field_name": "CLASS_ATTRIBUTE_PFX", "field_sig": "static final String CLASS_ATTRIBUTE_PFX", "description": "When concatenated with a class attribute name,\n indicates the format of that attribute,\n using the layout language specified in the JSR 200 specification.\n \n For example, the effect of this option is built in:\n pack.class.attribute.SourceFile=RUH.\n \n The special strings ERROR, STRIP, and PASS are\n also allowed, with the same meaning as UNKNOWN_ATTRIBUTE.\n This provides a way for users to request that specific attributes be\n refused, stripped, or passed bitwise (with no class compression).\n \n Code like this might be used to support attributes for JCOV:\n \n     Map p = packer.properties();\n     p.put(CODE_ATTRIBUTE_PFX+\"CoverageTable\",       \"NH[PHHII]\");\n     p.put(CODE_ATTRIBUTE_PFX+\"CharacterRangeTable\", \"NH[PHPOHIIH]\");\n     p.put(CLASS_ATTRIBUTE_PFX+\"SourceID\",           \"RUH\");\n     p.put(CLASS_ATTRIBUTE_PFX+\"CompilationID\",      \"RUH\");\n \n\n Code like this might be used to strip debugging attributes:\n \n     Map p = packer.properties();\n     p.put(CODE_ATTRIBUTE_PFX+\"LineNumberTable\",    STRIP);\n     p.put(CODE_ATTRIBUTE_PFX+\"LocalVariableTable\", STRIP);\n     p.put(CLASS_ATTRIBUTE_PFX+\"SourceFile\",        STRIP);\n "}, {"field_name": "FIELD_ATTRIBUTE_PFX", "field_sig": "static final String FIELD_ATTRIBUTE_PFX", "description": "When concatenated with a field attribute name,\n indicates the format of that attribute.\n For example, the effect of this option is built in:\n pack.field.attribute.Deprecated=.\n The special strings ERROR, STRIP, and\n PASS are also allowed."}, {"field_name": "METHOD_ATTRIBUTE_PFX", "field_sig": "static final String METHOD_ATTRIBUTE_PFX", "description": "When concatenated with a method attribute name,\n indicates the format of that attribute.\n For example, the effect of this option is built in:\n pack.method.attribute.Exceptions=NH[RCH].\n The special strings ERROR, STRIP, and PASS\n are also allowed."}, {"field_name": "CODE_ATTRIBUTE_PFX", "field_sig": "static final String CODE_ATTRIBUTE_PFX", "description": "When concatenated with a code attribute name,\n indicates the format of that attribute.\n For example, the effect of this option is built in:\n pack.code.attribute.LocalVariableTable=NH[PHOHRUHRSHH].\n The special strings ERROR, STRIP, and PASS\n are also allowed."}, {"field_name": "PROGRESS", "field_sig": "static final String PROGRESS", "description": "The packer's progress as a percentage, as periodically\n updated by the packer.\n Values of 0 - 100 are normal, and -1 indicates a stall.\n Progress can be monitored by polling the value of this\n property.\n \n At a minimum, the packer must set progress to 0\n at the beginning of a packing operation, and to 100\n at the end."}, {"field_name": "KEEP", "field_sig": "static final String KEEP", "description": "The string \"keep\", a possible value for certain properties."}, {"field_name": "PASS", "field_sig": "static final String PASS", "description": "The string \"pass\", a possible value for certain properties."}, {"field_name": "STRIP", "field_sig": "static final String STRIP", "description": "The string \"strip\", a possible value for certain properties."}, {"field_name": "ERROR", "field_sig": "static final String ERROR", "description": "The string \"error\", a possible value for certain properties."}, {"field_name": "TRUE", "field_sig": "static final String TRUE", "description": "The string \"true\", a possible value for certain properties."}, {"field_name": "FALSE", "field_sig": "static final String FALSE", "description": "The string \"false\", a possible value for certain properties."}, {"field_name": "LATEST", "field_sig": "static final String LATEST", "description": "The string \"latest\", a possible value for certain properties."}], "methods": [{"method_name": "properties", "method_sig": "SortedMap<String, String> properties()", "description": "Get the set of this engine's properties.\n This set is a \"live view\", so that changing its\n contents immediately affects the Packer engine, and\n changes from the engine (such as progress indications)\n are immediately visible in the map.\n\n The property map may contain pre-defined implementation\n specific and default properties.  Users are encouraged to\n read the information and fully understand the implications,\n before modifying pre-existing properties.\n \n Implementation specific properties are prefixed with a\n package name associated with the implementor, beginning\n with com. or a similar prefix.\n All property names beginning with pack. and\n unpack. are reserved for use by this API.\n \n Unknown properties may be ignored or rejected with an\n unspecified error, and invalid entries may cause an\n unspecified error to be thrown.\n\n \n The returned map implements all optional SortedMap operations"}, {"method_name": "pack", "method_sig": "void pack (JarFile in,\n          OutputStream out)\n   throws IOException", "description": "Takes a JarFile and converts it into a Pack200 archive.\n \n Closes its input but not its output.  (Pack200 archives are appendable.)"}, {"method_name": "pack", "method_sig": "void pack (JarInputStream in,\n          OutputStream out)\n   throws IOException", "description": "Takes a JarInputStream and converts it into a Pack200 archive.\n \n Closes its input but not its output.  (Pack200 archives are appendable.)\n \n The modification time and deflation hint attributes are not available,\n for the JAR manifest file and its containing directory."}]}