{"name": "Class PageRanges", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class PageRanges is a printing attribute class, a set of integers,\n that identifies the range(s) of print-stream pages that the Printer object\n uses for each copy of each document which are to be printed. Nothing is\n printed for any pages identified that do not exist in the document(s). The\n attribute is associated with print-stream pages, not\n application-numbered pages (for example, the page numbers found in the\n headers and or footers for certain word processing applications).\n \n In most cases, the exact pages to be printed will be generated by a device\n driver and this attribute would not be required. However, when printing an\n archived document which has already been formatted, the end user may elect to\n print just a subset of the pages contained in the document. In this case, if\n a page range of \"n-m\" is specified, the first page\n to be printed will be page n. All subsequent pages of the document\n will be printed through and including page m.\n\n If a PageRanges attribute is not specified for a print job, all pages\n of the document will be printed. In other words, the default value for the\n PageRanges attribute is always {{1, Integer.MAX_VALUE}}.\n \n The effect of a PageRanges attribute on a multidoc print job (a job\n with multiple documents) depends on whether all the docs have the same page\n ranges specified or whether different docs have different page ranges\n specified, and on the (perhaps defaulted) value of the\n MultipleDocumentHandling attribute.\n \nIf all the docs have the same page ranges specified, then any value of\n   MultipleDocumentHandling makes sense, and\n   the printer's processing depends on the\n   MultipleDocumentHandling value:\n   \nSINGLE_DOCUMENT -- All the input docs will be combined\n     together into one output document. The specified page ranges of that\n     output document will be printed.\n     SINGLE_DOCUMENT_NEW_SHEET -- All the input docs will be\n     combined together into one output document, and the first impression of\n     each input doc will always start on a new media sheet. The specified page\n     ranges of that output document will be printed.\n     SEPARATE_DOCUMENTS_UNCOLLATED_COPIES -- For each separate\n     input doc, the specified page ranges will be printed.\n     SEPARATE_DOCUMENTS_COLLATED_COPIES -- For each separate input\n     doc, the specified page ranges will be printed.\n   \n\nSEPARATE_DOCUMENTS_UNCOLLATED_COPIES -- For each separate\n     input doc, its own specified page ranges will be printed.\n     SEPARATE_DOCUMENTS_COLLATED_COPIES -- For each separate input\n     doc, its own specified page ranges will be printed.\n   \n\n\nIPP Compatibility: The PageRanges attribute's canonical array form\n gives the lower and upper bound for each range of pages to be included in and\n IPP \"page-ranges\" attribute. See class\n SetOfIntegerSyntax for an explanation of canonical\n array form. The category name returned by getName() gives the IPP\n attribute name.", "codes": ["public final class PageRanges\nextends SetOfIntegerSyntax\nimplements DocAttribute, PrintRequestAttribute, PrintJobAttribute"], "fields": [], "methods": [{"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this page ranges attribute is equivalent to the passed in\n object. To be equivalent, all of the following conditions must be true:\n \nobject is not null.\n   object is an instance of class PageRanges.\n   This page ranges attribute's members and object's members\n   are the same.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class PageRanges, the category is class\n PageRanges itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class PageRanges, the category name is \"page-ranges\"."}]}