{"name": "Class PagesPerMinuteColor", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class PagesPerMinuteColor is an integer valued printing attribute\n that indicates the nominal number of pages per minute to the nearest whole\n number which may be generated by this printer when printing color (e.g.,\n simplex, color). For purposes of this attribute, \"color\" means the same as\n for the ColorSupported attribute, namely, the device\n is capable of any type of color printing at all, including highlight color as\n well as full process color. This attribute is informative, not a service\n guarantee. Generally, it is the value used in the marketing literature to\n describe the color capabilities of this device. A value of 0 indicates a\n device that takes more than two minutes to process a page. If a color device\n has several color modes, it may use the pages-per- minute value for this\n attribute that corresponds to the mode that produces the highest number.\n \n A black and white only printer must not include the\n PagesPerMinuteColor attribute in its attribute set or service\n registration. If this attribute is present, then the\n ColorSupported printer description attribute must also\n be present and have a value of SUPPORTED.\n \nIPP Compatibility: The integer value gives the IPP integer value. The\n category name returned by getName() gives the IPP attribute name.", "codes": ["public final class PagesPerMinuteColor\nextends IntegerSyntax\nimplements PrintServiceAttribute"], "fields": [], "methods": [{"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this pages per minute color attribute is equivalent to\n the passed in object. To be equivalent, all of the following conditions\n must be true:\n \nobject is not null.\n   object is an instance of class PagesPerMinuteColor.\n   This pages per minute attribute's value and object's value\n   are equal.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class PagesPerMinuteColor, the category is class\n PagesPerMinuteColor itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class PagesPerMinuteColor, the category name is\n \"pages-per-minute-color\"."}]}