{"name": "Interface PersistentMBean", "module": "java.management", "package": "javax.management", "text": "This class is the interface to be implemented by MBeans that are meant to be\n  persistent.  MBeans supporting this interface should call the load method during\n  construction in order to prime the MBean from the persistent store.\n  In the case of a ModelMBean, the store method should be called by the MBeanServer based on the descriptors in\n  the ModelMBean or by the MBean itself during normal processing of the ModelMBean.", "codes": ["public interface PersistentMBean"], "fields": [], "methods": [{"method_name": "load", "method_sig": "void load()\n   throws MBeanException,\n          RuntimeOperationsException,\n          InstanceNotFoundException", "description": "Instantiates thisMBean instance with the data found for\n the MBean in the persistent store.  The data loaded could include\n attribute and operation values.\n\n This method should be called during construction or initialization of this instance,\n and before the MBean is registered with the MBeanServer."}, {"method_name": "store", "method_sig": "void store()\n    throws MBeanException,\n           RuntimeOperationsException,\n           InstanceNotFoundException", "description": "Captures the current state of this MBean instance and\n writes it out to the persistent store.  The state stored could include\n attribute and operation values. If one of these methods of persistence is\n not supported a \"serviceNotFound\" exception will be thrown.\n \n Persistence policy from the MBean and attribute descriptor is used to guide execution\n of this method. The MBean should be stored if 'persistPolicy' field is:\n  != \"never\"\n   = \"always\"\n   = \"onTimer\" and now > 'lastPersistTime' + 'persistPeriod'\n   = \"NoMoreOftenThan\" and now > 'lastPersistTime' + 'persistPeriod'\n   = \"onUnregister\"\n \n\n Do not store the MBean if 'persistPolicy' field is:\n \n    = \"never\"\n    = \"onUpdate\"\n    = \"onTimer\" && now < 'lastPersistTime' + 'persistPeriod'\n "}]}