{"name": "Class PixelInterleavedSampleModel", "module": "java.desktop", "package": "java.awt.image", "text": "This class represents image data which is stored in a pixel interleaved\n  fashion and for\n  which each sample of a pixel occupies one data element of the DataBuffer.\n  It subclasses ComponentSampleModel but provides a more efficient\n  implementation for accessing pixel interleaved image data than is provided\n  by ComponentSampleModel.  This class\n  stores sample data for all bands in a single bank of the\n  DataBuffer. Accessor methods are provided so that image data can be\n  manipulated directly. Pixel stride is the number of\n  data array elements between two samples for the same band on the same\n  scanline. Scanline stride is the number of data array elements between\n  a given sample and the corresponding sample in the same column of the next\n  scanline.  Band offsets denote the number\n  of data array elements from the first data array element of the bank\n  of the DataBuffer holding each band to the first sample of the band.\n  The bands are numbered from 0 to N-1.\n  Bank indices denote the correspondence between a bank of the data buffer\n  and a band of image data.\n  This class supports\n  TYPE_BYTE,\n  TYPE_USHORT,\n  TYPE_SHORT,\n  TYPE_INT,\n  TYPE_FLOAT and\n  TYPE_DOUBLE datatypes.", "codes": ["public class PixelInterleavedSampleModel\nextends ComponentSampleModel"], "fields": [], "methods": [{"method_name": "createCompatibleSampleModel", "method_sig": "public SampleModel createCompatibleSampleModel (int w,\n                                               int h)", "description": "Creates a new PixelInterleavedSampleModel with the specified\n width and height.  The new PixelInterleavedSampleModel will have the\n same number of bands, storage data type, and pixel stride\n as this PixelInterleavedSampleModel.  The band offsets may be\n compressed such that the minimum of all of the band offsets is zero."}, {"method_name": "createSubsetSampleModel", "method_sig": "public SampleModel createSubsetSampleModel (int[] bands)", "description": "Creates a new PixelInterleavedSampleModel with a subset of the\n bands of this PixelInterleavedSampleModel.  The new\n PixelInterleavedSampleModel can be used with any DataBuffer that the\n existing PixelInterleavedSampleModel can be used with.  The new\n PixelInterleavedSampleModel/DataBuffer combination will represent\n an image with a subset of the bands of the original\n PixelInterleavedSampleModel/DataBuffer combination."}]}