{"name": "Class PKIXCertPathChecker", "module": "java.base", "package": "java.security.cert", "text": "An abstract class that performs one or more checks on an\n X509Certificate.\n\n A concrete implementation of the PKIXCertPathChecker class\n can be created to extend the PKIX certification path validation algorithm.\n For example, an implementation may check for and process a critical private\n extension of each certificate in a certification path.\n\n Instances of PKIXCertPathChecker are passed as parameters\n using the setCertPathCheckers\n or addCertPathChecker methods\n of the PKIXParameters and PKIXBuilderParameters\n class. Each of the PKIXCertPathCheckers check\n methods will be called, in turn, for each certificate processed by a PKIX\n CertPathValidator or CertPathBuilder\n implementation.\n\n A PKIXCertPathChecker may be called multiple times on\n successive certificates in a certification path. Concrete subclasses\n are expected to maintain any internal state that may be necessary to\n check successive certificates. The init method is used\n to initialize the internal state of the checker so that the certificates\n of a new certification path may be checked. A stateful implementation\n must override the clone method if necessary in\n order to allow a PKIX CertPathBuilder to efficiently\n backtrack and try other paths. In these situations, the\n CertPathBuilder is able to restore prior path validation\n states by restoring the cloned PKIXCertPathCheckers.\n\n The order in which the certificates are presented to the\n PKIXCertPathChecker may be either in the forward direction\n (from target to most-trusted CA) or in the reverse direction (from\n most-trusted CA to target). A PKIXCertPathChecker implementation\n must support reverse checking (the ability to perform its checks when\n it is presented with certificates in the reverse direction) and may\n support forward checking (the ability to perform its checks when it is\n presented with certificates in the forward direction). The\n isForwardCheckingSupported method\n indicates whether forward checking is supported.\n \n Additional input parameters required for executing the check may be\n specified through constructors of concrete implementations of this class.\n \nConcurrent Access\n\n Unless otherwise specified, the methods defined in this class are not\n thread-safe. Multiple threads that need to access a single\n object concurrently should synchronize amongst themselves and\n provide the necessary locking. Multiple threads each manipulating\n separate objects need not synchronize.", "codes": ["public abstract class PKIXCertPathChecker\nextends Object\nimplements CertPathChecker, Cloneable"], "fields": [], "methods": [{"method_name": "init", "method_sig": "public abstract void init (boolean forward)\n                   throws CertPathValidatorException", "description": "Initializes the internal state of this PKIXCertPathChecker.\n \n The forward flag specifies the order that\n certificates will be passed to the check method\n (forward or reverse). A PKIXCertPathChecker must\n support reverse checking and may support forward checking."}, {"method_name": "isForwardCheckingSupported", "method_sig": "public abstract boolean isForwardCheckingSupported()", "description": "Indicates if forward checking is supported. Forward checking refers\n to the ability of the PKIXCertPathChecker to perform\n its checks when certificates are presented to the check\n method in the forward direction (from target to most-trusted CA)."}, {"method_name": "getSupportedExtensions", "method_sig": "public abstract Set<String> getSupportedExtensions()", "description": "Returns an immutable Set of X.509 certificate extensions\n that this PKIXCertPathChecker supports (i.e. recognizes, is\n able to process), or null if no extensions are supported.\n \n Each element of the set is a String representing the\n Object Identifier (OID) of the X.509 extension that is supported.\n The OID is represented by a set of nonnegative integers separated by\n periods.\n \n All X.509 certificate extensions that a PKIXCertPathChecker\n might possibly be able to process should be included in the set."}, {"method_name": "check", "method_sig": "public abstract void check (Certificate cert,\n                           Collection<String> unresolvedCritExts)\n                    throws CertPathValidatorException", "description": "Performs the check(s) on the specified certificate using its internal\n state and removes any critical extensions that it processes from the\n specified collection of OID strings that represent the unresolved\n critical extensions. The certificates are presented in the order\n specified by the init method."}, {"method_name": "check", "method_sig": "public void check (Certificate cert)\n           throws CertPathValidatorException", "description": "Performs the check(s) on the specified certificate using its internal\n state. The certificates are presented in the order specified by the\n init method.\n\n This implementation calls\n check(cert, java.util.Collections.<String>emptySet())."}, {"method_name": "clone", "method_sig": "public Object clone()", "description": "Returns a clone of this object. Calls the Object.clone()\n method.\n All subclasses which maintain state must support and\n override this method, if necessary."}]}