{"name": "Class PKIXBuilderParameters", "module": "java.base", "package": "java.security.cert", "text": "Parameters used as input for the PKIX CertPathBuilder\n algorithm.\n \n A PKIX CertPathBuilder uses these parameters to build a CertPath which has been\n validated according to the PKIX certification path validation algorithm.\n\n To instantiate a PKIXBuilderParameters object, an\n application must specify one or more most-trusted CAs as defined by\n the PKIX certification path validation algorithm. The most-trusted CA\n can be specified using one of two constructors. An application\n can call PKIXBuilderParameters(Set, CertSelector), specifying a\n Set of TrustAnchor objects, each of which\n identifies a most-trusted CA. Alternatively, an application can call\n PKIXBuilderParameters(KeyStore, CertSelector), specifying a\n KeyStore instance containing trusted certificate entries, each\n of which will be considered as a most-trusted CA.\n\n In addition, an application must specify constraints on the target\n certificate that the CertPathBuilder will attempt\n to build a path to. The constraints are specified as a\n CertSelector object. These constraints should provide the\n CertPathBuilder with enough search criteria to find the target\n certificate. Minimal criteria for an X509Certificate usually\n include the subject name and/or one or more subject alternative names.\n If enough criteria is not specified, the CertPathBuilder\n may throw a CertPathBuilderException.\n \nConcurrent Access\n\n Unless otherwise specified, the methods defined in this class are not\n thread-safe. Multiple threads that need to access a single\n object concurrently should synchronize amongst themselves and\n provide the necessary locking. Multiple threads each manipulating\n separate objects need not synchronize.", "codes": ["public class PKIXBuilderParameters\nextends PKIXParameters"], "fields": [], "methods": [{"method_name": "setMaxPathLength", "method_sig": "public void setMaxPathLength (int maxPathLength)", "description": "Sets the value of the maximum number of non-self-issued intermediate\n certificates that may exist in a certification path. A certificate\n is self-issued if the DNs that appear in the subject and issuer\n fields are identical and are not empty. Note that the last certificate\n in a certification path is not an intermediate certificate, and is not\n included in this limit. Usually the last certificate is an end entity\n certificate, but it can be a CA certificate. A PKIX\n CertPathBuilder instance must not build\n paths longer than the length specified.\n\n  A value of 0 implies that the path can only contain\n a single certificate. A value of -1 implies that the\n path length is unconstrained (i.e. there is no maximum).\n The default maximum path length, if not specified, is 5.\n Setting a value less than -1 will cause an exception to be thrown.\n\n  If any of the CA certificates contain the\n BasicConstraintsExtension, the value of the\n pathLenConstraint field of the extension overrides\n the maximum path length parameter whenever the result is a\n certification path of smaller length."}, {"method_name": "getMaxPathLength", "method_sig": "public int getMaxPathLength()", "description": "Returns the value of the maximum number of intermediate non-self-issued\n certificates that may exist in a certification path. See\n the setMaxPathLength(int) method for more details."}, {"method_name": "toString", "method_sig": "public String toString()", "description": "Returns a formatted string describing the parameters."}]}