{"name": "Class PosixFilePermissions", "module": "java.base", "package": "java.nio.file.attribute", "text": "This class consists exclusively of static methods that operate on sets of\n PosixFilePermission objects.", "codes": ["public final class PosixFilePermissions\nextends Object"], "fields": [], "methods": [{"method_name": "toString", "method_sig": "public static String toString (Set<PosixFilePermission> perms)", "description": "Returns the String representation of a set of permissions. It\n is guaranteed that the returned String can be parsed by the\n fromString(java.lang.String) method.\n\n  If the set contains null or elements that are not of type\n PosixFilePermission then these elements are ignored."}, {"method_name": "fromString", "method_sig": "public static Set<PosixFilePermission> fromString (String perms)", "description": "Returns the set of permissions corresponding to a given String\n representation.\n\n  The perms parameter is a String representing the\n permissions. It has 9 characters that are interpreted as three sets of\n three. The first set refers to the owner's permissions; the next to the\n group permissions and the last to others. Within each set, the first\n character is 'r' to indicate permission to read, the second\n character is 'w' to indicate permission to write, and the third\n character is 'x' for execute permission. Where a permission is\n not set then the corresponding character is set to '-'.\n\n  Usage Example:\n Suppose we require the set of permissions that indicate the owner has read,\n write, and execute permissions, the group has read and execute permissions\n and others have none.\n \n   Set<PosixFilePermission> perms = PosixFilePermissions.fromString(\"rwxr-x---\");\n "}, {"method_name": "asFileAttribute", "method_sig": "public static FileAttribute<Set<PosixFilePermission>> asFileAttribute (Set<PosixFilePermission> perms)", "description": "Creates a FileAttribute, encapsulating a copy of the given file\n permissions, suitable for passing to the createFile or createDirectory\n methods."}]}