{"name": "Interface PosixFileAttributeView", "module": "java.base", "package": "java.nio.file.attribute", "text": "A file attribute view that provides a view of the file attributes commonly\n associated with files on file systems used by operating systems that implement\n the Portable Operating System Interface (POSIX) family of standards.\n\n  Operating systems that implement the \n POSIX family of standards commonly use file systems that have a\n file owner, group-owner, and related access\n permissions. This file attribute view provides read and write access\n to these attributes.\n\n  The readAttributes method is used to read the\n file's attributes. The file owner is\n represented by a UserPrincipal that is the identity of the file owner\n for the purposes of access control. The group-owner, represented by a GroupPrincipal, is the identity of the\n group owner, where a group is an identity created for administrative purposes\n so as to determine the access rights for the members of the group.\n\n  The permissions attribute is a\n set of access permissions. This file attribute view provides access to the nine\n permission defined by the PosixFilePermission class.\n These nine permission bits determine the read, write, and\n execute access for the file owner, group, and others (others\n meaning identities other than the owner and members of the group). Some\n operating systems and file systems may provide additional permission bits\n but access to these other bits is not defined by this class in this release.\n\n  Usage Example:\n Suppose we need to print out the owner and access permissions of a file:\n \n     Path file = ...\n     PosixFileAttributes attrs = Files.getFileAttributeView(file, PosixFileAttributeView.class)\n         .readAttributes();\n     System.out.format(\"%s %s%n\",\n         attrs.owner().getName(),\n         PosixFilePermissions.toString(attrs.permissions()));\n \n Dynamic Access \n Where dynamic access to file attributes is required, the attributes\n supported by this attribute view are as defined by BasicFileAttributeView and FileOwnerAttributeView, and in addition,\n the following attributes are supported:\n \n\nSupported attributes\n\n\n Name \n Type \n\n\n\n\n \"permissions\" \n Set<PosixFilePermission> \n\n\n \"group\" \n GroupPrincipal \n\n\n\n\n The getAttribute method may be used to read\n any of these attributes, or any of the attributes defined by BasicFileAttributeView as if by invoking the readAttributes() method.\n\n  The setAttribute method may be used to update\n the file's last modified time, last access time or create time attributes as\n defined by BasicFileAttributeView. It may also be used to update\n the permissions, owner, or group-owner as if by invoking the setPermissions, setOwner, and setGroup methods respectively.\n\n  Setting Initial Permissions \n Implementations supporting this attribute view may also support setting\n the initial permissions when creating a file or directory. The\n initial permissions are provided to the createFile\n or createDirectory methods as a FileAttribute with name \"posix:permissions\"\n and a value that is the set of permissions. The\n following example uses the asFileAttribute method to construct a FileAttribute when creating a\n file:\n\n \n     Path path = ...\n     Set<PosixFilePermission> perms =\n         EnumSet.of(OWNER_READ, OWNER_WRITE, OWNER_EXECUTE, GROUP_READ);\n     Files.createFile(path, PosixFilePermissions.asFileAttribute(perms));\n \n When the access permissions are set at file creation time then the actual\n value of the permissions may differ that the value of the attribute object.\n The reasons for this are implementation specific. On UNIX systems, for\n example, a process has a umask that impacts the permission bits\n of newly created files. Where an implementation supports the setting of\n the access permissions, and the underlying file system supports access\n permissions, then it is required that the value of the actual access\n permissions will be equal or less than the value of the attribute\n provided to the createFile or createDirectory methods. In other words, the file may\n be more secure than requested.", "codes": ["public interface PosixFileAttributeView\nextends BasicFileAttributeView, FileOwnerAttributeView"], "fields": [], "methods": [{"method_name": "name", "method_sig": "String name()", "description": "Returns the name of the attribute view. Attribute views of this type\n have the name \"posix\"."}, {"method_name": "readAttributes", "method_sig": "PosixFileAttributes readAttributes()\n                            throws IOException", "description": "Description copied from interface: BasicFileAttributeView"}, {"method_name": "setPermissions", "method_sig": "void setPermissions (Set<PosixFilePermission> perms)\n             throws IOException", "description": "Updates the file permissions."}, {"method_name": "setGroup", "method_sig": "void setGroup (GroupPrincipal group)\n       throws IOException", "description": "Updates the file group-owner."}]}