{"name": "Class Preferences", "module": "java.prefs", "package": "java.util.prefs", "text": "A node in a hierarchical collection of preference data.  This class\n allows applications to store and retrieve user and system\n preference and configuration data.  This data is stored\n persistently in an implementation-dependent backing store.  Typical\n implementations include flat files, OS-specific registries,\n directory servers and SQL databases.  The user of this class needn't\n be concerned with details of the backing store.\n\n There are two separate trees of preference nodes, one for user\n preferences and one for system preferences.  Each user has a separate user\n preference tree, and all users in a given system share the same system\n preference tree.  The precise description of \"user\" and \"system\" will vary\n from implementation to implementation.  Typical information stored in the\n user preference tree might include font choice, color choice, or preferred\n window location and size for a particular application.  Typical information\n stored in the system preference tree might include installation\n configuration data for an application.\n\n Nodes in a preference tree are named in a similar fashion to\n directories in a hierarchical file system.   Every node in a preference\n tree has a node name (which is not necessarily unique),\n a unique absolute path name, and a path name relative to each\n ancestor including itself.\n\n The root node has a node name of the empty string (\"\").  Every other\n node has an arbitrary node name, specified at the time it is created.  The\n only restrictions on this name are that it cannot be the empty string, and\n it cannot contain the slash character ('/').\n\n The root node has an absolute path name of \"/\".  Children of\n the root node have absolute path names of \"/\" + <node\n name>.  All other nodes have absolute path names of <parent's\n absolute path name> + \"/\" + <node name>.\n Note that all absolute path names begin with the slash character.\n\n A node n's path name relative to its ancestor a\n is simply the string that must be appended to a's absolute path name\n in order to form n's absolute path name, with the initial slash\n character (if present) removed.  Note that:\n \nNo relative path names begin with the slash character.\n Every node's path name relative to itself is the empty string.\n Every node's path name relative to its parent is its node name (except\n for the root node, which does not have a parent).\n Every node's path name relative to the root is its absolute path name\n with the initial slash character removed.\n \nNote finally that:\n \nNo path name contains multiple consecutive slash characters.\n No path name with the exception of the root's absolute path name\n ends in the slash character.\n Any string that conforms to these two rules is a valid path name.\n \nAll of the methods that modify preferences data are permitted to operate\n asynchronously; they may return immediately, and changes will eventually\n propagate to the persistent backing store with an implementation-dependent\n delay.  The flush method may be used to synchronously force\n updates to the backing store.  Normal termination of the Java Virtual\n Machine will not result in the loss of pending updates -- an explicit\n flush invocation is not required upon termination to ensure\n that pending updates are made persistent.\n\n All of the methods that read preferences from a Preferences\n object require the invoker to provide a default value.  The default value is\n returned if no value has been previously set or if the backing store is\n unavailable.  The intent is to allow applications to operate, albeit\n with slightly degraded functionality, even if the backing store becomes\n unavailable.  Several methods, like flush, have semantics that\n prevent them from operating if the backing store is unavailable.  Ordinary\n applications should have no need to invoke any of these methods, which can\n be identified by the fact that they are declared to throw BackingStoreException.\n\n The methods in this class may be invoked concurrently by multiple threads\n in a single JVM without the need for external synchronization, and the\n results will be equivalent to some serial execution.  If this class is used\n concurrently by multiple JVMs that store their preference data in\n the same backing store, the data store will not be corrupted, but no\n other guarantees are made concerning the consistency of the preference\n data.\n\n This class contains an export/import facility, allowing preferences\n to be \"exported\" to an XML document, and XML documents representing\n preferences to be \"imported\" back into the system.  This facility\n may be used to back up all or part of a preference tree, and\n subsequently restore from the backup.\n\n The XML document has the following DOCTYPE declaration:\n \n <!DOCTYPE preferences SYSTEM \"http://java.sun.com/dtd/preferences.dtd\">\n \n Note that the system URI (http://java.sun.com/dtd/preferences.dtd) is\n not accessed when exporting or importing preferences; it merely\n serves as a string to uniquely identify the DTD, which is:\n \n    <?xml version=\"1.0\" encoding=\"UTF-8\"?>\n\n    <!-- DTD for a Preferences tree. -->\n\n    <!-- The preferences element is at the root of an XML document\n         representing a Preferences tree. -->\n    <!ELEMENT preferences (root)>\n\n    <!-- The preferences element contains an optional version attribute,\n          which specifies version of DTD. -->\n    <!ATTLIST preferences EXTERNAL_XML_VERSION CDATA \"0.0\" >\n\n    <!-- The root element has a map representing the root's preferences\n         (if any), and one node for each child of the root (if any). -->\n    <!ELEMENT root (map, node*) >\n\n    <!-- Additionally, the root contains a type attribute, which\n         specifies whether it's the system or user root. -->\n    <!ATTLIST root\n              type (system|user) #REQUIRED >\n\n    <!-- Each node has a map representing its preferences (if any),\n         and one node for each child (if any). -->\n    <!ELEMENT node (map, node*) >\n\n    <!-- Additionally, each node has a name attribute -->\n    <!ATTLIST node\n              name CDATA #REQUIRED >\n\n    <!-- A map represents the preferences stored at a node (if any). -->\n    <!ELEMENT map (entry*) >\n\n    <!-- An entry represents a single preference, which is simply\n          a key-value pair. -->\n    <!ELEMENT entry EMPTY >\n    <!ATTLIST entry\n              key   CDATA #REQUIRED\n              value CDATA #REQUIRED >\n \n\n Every Preferences implementation must have an associated PreferencesFactory implementation.  Every Java(TM) SE implementation must provide\n some means of specifying which PreferencesFactory implementation\n is used to generate the root preferences nodes.  This allows the\n administrator to replace the default preferences implementation with an\n alternative implementation.", "codes": ["public abstract class Preferences\nextends Object"], "fields": [{"field_name": "MAX_KEY_LENGTH", "field_sig": "public static final int MAX_KEY_LENGTH", "description": "Maximum length of string allowed as a key (80 characters)."}, {"field_name": "MAX_VALUE_LENGTH", "field_sig": "public static final int MAX_VALUE_LENGTH", "description": "Maximum length of string allowed as a value (8192 characters)."}, {"field_name": "MAX_NAME_LENGTH", "field_sig": "public static final int MAX_NAME_LENGTH", "description": "Maximum length of a node name (80 characters)."}], "methods": [{"method_name": "userNodeForPackage", "method_sig": "public static Preferences userNodeForPackage (Class<?> c)", "description": "Returns the preference node from the calling user's preference tree\n that is associated (by convention) with the specified class's package.\n The convention is as follows: the absolute path name of the node is the\n fully qualified package name, preceded by a slash ('/'), and\n with each period ('.') replaced by a slash.  For example the\n absolute path name of the node associated with the class\n com.acme.widget.Foo is /com/acme/widget.\n\n This convention does not apply to the unnamed package, whose\n associated preference node is <unnamed>.  This node\n is not intended for long term use, but for convenience in the early\n development of programs that do not yet belong to a package, and\n for \"throwaway\" programs.  Valuable data should not be stored\n at this node as it is shared by all programs that use it.\nA class Foo wishing to access preferences pertaining to its\n package can obtain a preference node as follows: \n    static Preferences prefs = Preferences.userNodeForPackage(Foo.class);\n \n This idiom obviates the need for using a string to describe the\n preferences node and decreases the likelihood of a run-time failure.\n (If the class name is misspelled, it will typically result in a\n compile-time error.)\n\n Invoking this method will result in the creation of the returned\n node and its ancestors if they do not already exist.  If the returned\n node did not exist prior to this call, this node and any ancestors that\n were created by this call are not guaranteed to become permanent until\n the flush method is called on the returned node (or one of its\n ancestors or descendants)."}, {"method_name": "systemNodeForPackage", "method_sig": "public static Preferences systemNodeForPackage (Class<?> c)", "description": "Returns the preference node from the system preference tree that is\n associated (by convention) with the specified class's package.  The\n convention is as follows: the absolute path name of the node is the\n fully qualified package name, preceded by a slash ('/'), and\n with each period ('.') replaced by a slash.  For example the\n absolute path name of the node associated with the class\n com.acme.widget.Foo is /com/acme/widget.\n\n This convention does not apply to the unnamed package, whose\n associated preference node is <unnamed>.  This node\n is not intended for long term use, but for convenience in the early\n development of programs that do not yet belong to a package, and\n for \"throwaway\" programs.  Valuable data should not be stored\n at this node as it is shared by all programs that use it.\nA class Foo wishing to access preferences pertaining to its\n package can obtain a preference node as follows: \n  static Preferences prefs = Preferences.systemNodeForPackage(Foo.class);\n \n This idiom obviates the need for using a string to describe the\n preferences node and decreases the likelihood of a run-time failure.\n (If the class name is misspelled, it will typically result in a\n compile-time error.)\n\n Invoking this method will result in the creation of the returned\n node and its ancestors if they do not already exist.  If the returned\n node did not exist prior to this call, this node and any ancestors that\n were created by this call are not guaranteed to become permanent until\n the flush method is called on the returned node (or one of its\n ancestors or descendants)."}, {"method_name": "userRoot", "method_sig": "public static Preferences userRoot()", "description": "Returns the root preference node for the calling user."}, {"method_name": "systemRoot", "method_sig": "public static Preferences systemRoot()", "description": "Returns the root preference node for the system."}, {"method_name": "put", "method_sig": "public abstract void put (String key,\n                         String value)", "description": "Associates the specified value with the specified key in this\n preference node."}, {"method_name": "get", "method_sig": "public abstract String get (String key,\n                           String def)", "description": "Returns the value associated with the specified key in this preference\n node.  Returns the specified default if there is no value associated\n with the key, or the backing store is inaccessible.\n\n Some implementations may store default values in their backing\n stores.  If there is no value associated with the specified key\n but there is such a stored default, it is returned in\n preference to the specified default."}, {"method_name": "remove", "method_sig": "public abstract void remove (String key)", "description": "Removes the value associated with the specified key in this preference\n node, if any.\n\n If this implementation supports stored defaults, and there is\n such a default for the specified preference, the stored default will be\n \"exposed\" by this call, in the sense that it will be returned\n by a succeeding call to get."}, {"method_name": "clear", "method_sig": "public abstract void clear()\n                    throws BackingStoreException", "description": "Removes all of the preferences (key-value associations) in this\n preference node.  This call has no effect on any descendants\n of this node.\n\n If this implementation supports stored defaults, and this\n node in the preferences hierarchy contains any such defaults,\n the stored defaults will be \"exposed\" by this call, in the sense that\n they will be returned by succeeding calls to get."}, {"method_name": "putInt", "method_sig": "public abstract void putInt (String key,\n                            int value)", "description": "Associates a string representing the specified int value with the\n specified key in this preference node.  The associated string is the\n one that would be returned if the int value were passed to\n Integer.toString(int).  This method is intended for use in\n conjunction with getInt(java.lang.String, int)."}, {"method_name": "getInt", "method_sig": "public abstract int getInt (String key,\n                           int def)", "description": "Returns the int value represented by the string associated with the\n specified key in this preference node.  The string is converted to\n an integer as by Integer.parseInt(String).  Returns the\n specified default if there is no value associated with the key,\n the backing store is inaccessible, or if\n Integer.parseInt(String) would throw a NumberFormatException if the associated value were passed.  This\n method is intended for use in conjunction with putInt(java.lang.String, int).\n\n If the implementation supports stored defaults and such a\n default exists, is accessible, and could be converted to an int\n with Integer.parseInt, this int is returned in preference to\n the specified default."}, {"method_name": "putLong", "method_sig": "public abstract void putLong (String key,\n                             long value)", "description": "Associates a string representing the specified long value with the\n specified key in this preference node.  The associated string is the\n one that would be returned if the long value were passed to\n Long.toString(long).  This method is intended for use in\n conjunction with getLong(java.lang.String, long)."}, {"method_name": "getLong", "method_sig": "public abstract long getLong (String key,\n                             long def)", "description": "Returns the long value represented by the string associated with the\n specified key in this preference node.  The string is converted to\n a long as by Long.parseLong(String).  Returns the\n specified default if there is no value associated with the key,\n the backing store is inaccessible, or if\n Long.parseLong(String) would throw a NumberFormatException if the associated value were passed.  This\n method is intended for use in conjunction with putLong(java.lang.String, long).\n\n If the implementation supports stored defaults and such a\n default exists, is accessible, and could be converted to a long\n with Long.parseLong, this long is returned in preference to\n the specified default."}, {"method_name": "putBoolean", "method_sig": "public abstract void putBoolean (String key,\n                                boolean value)", "description": "Associates a string representing the specified boolean value with the\n specified key in this preference node.  The associated string is\n \"true\" if the value is true, and \"false\" if it is\n false.  This method is intended for use in conjunction with\n getBoolean(java.lang.String, boolean)."}, {"method_name": "getBoolean", "method_sig": "public abstract boolean getBoolean (String key,\n                                   boolean def)", "description": "Returns the boolean value represented by the string associated with the\n specified key in this preference node.  Valid strings\n are \"true\", which represents true, and \"false\", which\n represents false.  Case is ignored, so, for example, \"TRUE\"\n and \"False\" are also valid.  This method is intended for use in\n conjunction with putBoolean(java.lang.String, boolean).\n\n Returns the specified default if there is no value\n associated with the key, the backing store is inaccessible, or if the\n associated value is something other than \"true\" or\n \"false\", ignoring case.\n\n If the implementation supports stored defaults and such a\n default exists and is accessible, it is used in preference to the\n specified default, unless the stored default is something other than\n \"true\" or \"false\", ignoring case, in which case the\n specified default is used."}, {"method_name": "putFloat", "method_sig": "public abstract void putFloat (String key,\n                              float value)", "description": "Associates a string representing the specified float value with the\n specified key in this preference node.  The associated string is the\n one that would be returned if the float value were passed to\n Float.toString(float).  This method is intended for use in\n conjunction with getFloat(java.lang.String, float)."}, {"method_name": "getFloat", "method_sig": "public abstract float getFloat (String key,\n                               float def)", "description": "Returns the float value represented by the string associated with the\n specified key in this preference node.  The string is converted to an\n integer as by Float.parseFloat(String).  Returns the specified\n default if there is no value associated with the key, the backing store\n is inaccessible, or if Float.parseFloat(String) would throw a\n NumberFormatException if the associated value were passed.\n This method is intended for use in conjunction with putFloat(java.lang.String, float).\n\n If the implementation supports stored defaults and such a\n default exists, is accessible, and could be converted to a float\n with Float.parseFloat, this float is returned in preference to\n the specified default."}, {"method_name": "putDouble", "method_sig": "public abstract void putDouble (String key,\n                               double value)", "description": "Associates a string representing the specified double value with the\n specified key in this preference node.  The associated string is the\n one that would be returned if the double value were passed to\n Double.toString(double).  This method is intended for use in\n conjunction with getDouble(java.lang.String, double)."}, {"method_name": "getDouble", "method_sig": "public abstract double getDouble (String key,\n                                 double def)", "description": "Returns the double value represented by the string associated with the\n specified key in this preference node.  The string is converted to an\n integer as by Double.parseDouble(String).  Returns the specified\n default if there is no value associated with the key, the backing store\n is inaccessible, or if Double.parseDouble(String) would throw a\n NumberFormatException if the associated value were passed.\n This method is intended for use in conjunction with putDouble(java.lang.String, double).\n\n If the implementation supports stored defaults and such a\n default exists, is accessible, and could be converted to a double\n with Double.parseDouble, this double is returned in preference\n to the specified default."}, {"method_name": "putByteArray", "method_sig": "public abstract void putByteArray (String key,\n                                  byte[] value)", "description": "Associates a string representing the specified byte array with the\n specified key in this preference node.  The associated string is\n the Base64 encoding of the byte array, as defined in RFC 2045, Section 6.8,\n with one minor change: the string will consist solely of characters\n from the Base64 Alphabet; it will not contain any newline\n characters.  Note that the maximum length of the byte array is limited\n to three quarters of MAX_VALUE_LENGTH so that the length\n of the Base64 encoded String does not exceed MAX_VALUE_LENGTH.\n This method is intended for use in conjunction with\n getByteArray(java.lang.String, byte[])."}, {"method_name": "getByteArray", "method_sig": "public abstract byte[] getByteArray (String key,\n                                    byte[] def)", "description": "Returns the byte array value represented by the string associated with\n the specified key in this preference node.  Valid strings are\n Base64 encoded binary data, as defined in RFC 2045, Section 6.8,\n with one minor change: the string must consist solely of characters\n from the Base64 Alphabet; no newline characters or\n extraneous characters are permitted.  This method is intended for use\n in conjunction with putByteArray(java.lang.String, byte[]).\n\n Returns the specified default if there is no value\n associated with the key, the backing store is inaccessible, or if the\n associated value is not a valid Base64 encoded byte array\n (as defined above).\n\n If the implementation supports stored defaults and such a\n default exists and is accessible, it is used in preference to the\n specified default, unless the stored default is not a valid Base64\n encoded byte array (as defined above), in which case the\n specified default is used."}, {"method_name": "keys", "method_sig": "public abstract String[] keys()\n                       throws BackingStoreException", "description": "Returns all of the keys that have an associated value in this\n preference node.  (The returned array will be of size zero if\n this node has no preferences.)\n\n If the implementation supports stored defaults and there\n are any such defaults at this node that have not been overridden,\n by explicit preferences, the defaults are returned in the array in\n addition to any explicit preferences."}, {"method_name": "childrenNames", "method_sig": "public abstract String[] childrenNames()\n                                throws BackingStoreException", "description": "Returns the names of the children of this preference node, relative to\n this node.  (The returned array will be of size zero if this node has\n no children.)"}, {"method_name": "parent", "method_sig": "public abstract Preferences parent()", "description": "Returns the parent of this preference node, or null if this is\n the root."}, {"method_name": "node", "method_sig": "public abstract Preferences node (String pathName)", "description": "Returns the named preference node in the same tree as this node,\n creating it and any of its ancestors if they do not already exist.\n Accepts a relative or absolute path name.  Relative path names\n (which do not begin with the slash character ('/')) are\n interpreted relative to this preference node.\n\n If the returned node did not exist prior to this call, this node and\n any ancestors that were created by this call are not guaranteed\n to become permanent until the flush method is called on\n the returned node (or one of its ancestors or descendants)."}, {"method_name": "nodeExists", "method_sig": "public abstract boolean nodeExists (String pathName)\n                            throws BackingStoreException", "description": "Returns true if the named preference node exists in the same tree\n as this node.  Relative path names (which do not begin with the slash\n character ('/')) are interpreted relative to this preference\n node.\n\n If this node (or an ancestor) has already been removed with the\n removeNode() method, it is legal to invoke this method,\n but only with the path name \"\"; the invocation will return\n false.  Thus, the idiom p.nodeExists(\"\") may be\n used to test whether p has been removed."}, {"method_name": "removeNode", "method_sig": "public abstract void removeNode()\n                         throws BackingStoreException", "description": "Removes this preference node and all of its descendants, invalidating\n any preferences contained in the removed nodes.  Once a node has been\n removed, attempting any method other than name(),\n absolutePath(), isUserNode(), flush() or\n nodeExists(\"\") on the corresponding\n Preferences instance will fail with an\n IllegalStateException.  (The methods defined on Object\n can still be invoked on a node after it has been removed; they will not\n throw IllegalStateException.)\n\n The removal is not guaranteed to be persistent until the\n flush method is called on this node (or an ancestor).\n\n If this implementation supports stored defaults, removing a\n node exposes any stored defaults at or below this node.  Thus, a\n subsequent call to nodeExists on this node's path name may\n return true, and a subsequent call to node on this\n path name may return a (different) Preferences instance\n representing a non-empty collection of preferences and/or children."}, {"method_name": "name", "method_sig": "public abstract String name()", "description": "Returns this preference node's name, relative to its parent."}, {"method_name": "absolutePath", "method_sig": "public abstract String absolutePath()", "description": "Returns this preference node's absolute path name."}, {"method_name": "isUserNode", "method_sig": "public abstract boolean isUserNode()", "description": "Returns true if this preference node is in the user\n preference tree, false if it's in the system preference tree."}, {"method_name": "toString", "method_sig": "public abstract String toString()", "description": "Returns a string representation of this preferences node,\n as if computed by the expression:(this.isUserNode() ? \"User\" :\n \"System\") + \" Preference Node: \" + this.absolutePath()."}, {"method_name": "flush", "method_sig": "public abstract void flush()\n                    throws BackingStoreException", "description": "Forces any changes in the contents of this preference node and its\n descendants to the persistent store.  Once this method returns\n successfully, it is safe to assume that all changes made in the\n subtree rooted at this node prior to the method invocation have become\n permanent.\n\n Implementations are free to flush changes into the persistent store\n at any time.  They do not need to wait for this method to be called.\n\n When a flush occurs on a newly created node, it is made persistent,\n as are any ancestors (and descendants) that have yet to be made\n persistent.  Note however that any preference value changes in\n ancestors are not guaranteed to be made persistent.\n\n  If this method is invoked on a node that has been removed with\n the removeNode() method, flushSpi() is invoked on this node,\n but not on others."}, {"method_name": "sync", "method_sig": "public abstract void sync()\n                   throws BackingStoreException", "description": "Ensures that future reads from this preference node and its\n descendants reflect any changes that were committed to the persistent\n store (from any VM) prior to the sync invocation.  As a\n side-effect, forces any changes in the contents of this preference node\n and its descendants to the persistent store, as if the flush\n method had been invoked on this node."}, {"method_name": "addPreferenceChangeListener", "method_sig": "public abstract void addPreferenceChangeListener (PreferenceChangeListener pcl)", "description": "Registers the specified listener to receive preference change\n events for this preference node.  A preference change event is\n generated when a preference is added to this node, removed from this\n node, or when the value associated with a preference is changed.\n (Preference change events are not generated by the removeNode() method, which generates a node change event.\n Preference change events are generated by the clear\n method.)\n\n Events are only guaranteed for changes made within the same JVM\n as the registered listener, though some implementations may generate\n events for changes made outside this JVM.  Events may be generated\n before the changes have been made persistent.  Events are not generated\n when preferences are modified in descendants of this node; a caller\n desiring such events must register with each descendant."}, {"method_name": "removePreferenceChangeListener", "method_sig": "public abstract void removePreferenceChangeListener (PreferenceChangeListener pcl)", "description": "Removes the specified preference change listener, so it no longer\n receives preference change events."}, {"method_name": "addNodeChangeListener", "method_sig": "public abstract void addNodeChangeListener (NodeChangeListener ncl)", "description": "Registers the specified listener to receive node change events\n for this node.  A node change event is generated when a child node is\n added to or removed from this node.  (A single removeNode()\n invocation results in multiple node change events, one for every\n node in the subtree rooted at the removed node.)\n\n Events are only guaranteed for changes made within the same JVM\n as the registered listener, though some implementations may generate\n events for changes made outside this JVM.  Events may be generated\n before the changes have become permanent.  Events are not generated\n when indirect descendants of this node are added or removed; a\n caller desiring such events must register with each descendant.\n\n Few guarantees can be made regarding node creation.  Because nodes\n are created implicitly upon access, it may not be feasible for an\n implementation to determine whether a child node existed in the backing\n store prior to access (for example, because the backing store is\n unreachable or cached information is out of date).  Under these\n circumstances, implementations are neither required to generate node\n change events nor prohibited from doing so."}, {"method_name": "removeNodeChangeListener", "method_sig": "public abstract void removeNodeChangeListener (NodeChangeListener ncl)", "description": "Removes the specified NodeChangeListener, so it no longer\n receives change events."}, {"method_name": "exportNode", "method_sig": "public abstract void exportNode (OutputStream os)\n                         throws IOException,\n                                BackingStoreException", "description": "Emits on the specified output stream an XML document representing all\n of the preferences contained in this node (but not its descendants).\n This XML document is, in effect, an offline backup of the node.\n\n The XML document will have the following DOCTYPE declaration:\n \n <!DOCTYPE preferences SYSTEM \"http://java.sun.com/dtd/preferences.dtd\">\n \n The UTF-8 character encoding will be used.\n\n This method is an exception to the general rule that the results of\n concurrently executing multiple methods in this class yields\n results equivalent to some serial execution.  If the preferences\n at this node are modified concurrently with an invocation of this\n method, the exported preferences comprise a \"fuzzy snapshot\" of the\n preferences contained in the node; some of the concurrent modifications\n may be reflected in the exported data while others may not."}, {"method_name": "exportSubtree", "method_sig": "public abstract void exportSubtree (OutputStream os)\n                            throws IOException,\n                                   BackingStoreException", "description": "Emits an XML document representing all of the preferences contained\n in this node and all of its descendants.  This XML document is, in\n effect, an offline backup of the subtree rooted at the node.\n\n The XML document will have the following DOCTYPE declaration:\n \n <!DOCTYPE preferences SYSTEM \"http://java.sun.com/dtd/preferences.dtd\">\n \n The UTF-8 character encoding will be used.\n\n This method is an exception to the general rule that the results of\n concurrently executing multiple methods in this class yields\n results equivalent to some serial execution.  If the preferences\n or nodes in the subtree rooted at this node are modified concurrently\n with an invocation of this method, the exported preferences comprise a\n \"fuzzy snapshot\" of the subtree; some of the concurrent modifications\n may be reflected in the exported data while others may not."}, {"method_name": "importPreferences", "method_sig": "public static void importPreferences (InputStream is)\n                              throws IOException,\n                                     InvalidPreferencesFormatException", "description": "Imports all of the preferences represented by the XML document on the\n specified input stream.  The document may represent user preferences or\n system preferences.  If it represents user preferences, the preferences\n will be imported into the calling user's preference tree (even if they\n originally came from a different user's preference tree).  If any of\n the preferences described by the document inhabit preference nodes that\n do not exist, the nodes will be created.\n\n The XML document must have the following DOCTYPE declaration:\n \n <!DOCTYPE preferences SYSTEM \"http://java.sun.com/dtd/preferences.dtd\">\n \n (This method is designed for use in conjunction with\n exportNode(OutputStream) and\n exportSubtree(OutputStream).\n\n This method is an exception to the general rule that the results of\n concurrently executing multiple methods in this class yields\n results equivalent to some serial execution.  The method behaves\n as if implemented on top of the other public methods in this class,\n notably node(String) and put(String, String)."}]}