{"name": "Interface PrintJobListener", "module": "java.desktop", "package": "javax.print.event", "text": "Implementations of this listener interface should be attached to a\n DocPrintJob to monitor the status of the\n printer job. These callback methods may be invoked on the thread processing\n the print job, or a service created notification thread. In either case the\n client should not perform lengthy processing in these callbacks.", "codes": ["public interface PrintJobListener"], "fields": [], "methods": [{"method_name": "printDataTransferCompleted", "method_sig": "void printDataTransferCompleted (PrintJobEvent pje)", "description": "Called to notify the client that data has been successfully transferred\n to the print service, and the client may free local resources allocated\n for that data. The client should not assume that the data has been\n completely printed after receiving this event. If this event is not\n received the client should wait for a terminal event\n (completed/canceled/failed) before freeing the resources."}, {"method_name": "printJobCompleted", "method_sig": "void printJobCompleted (PrintJobEvent pje)", "description": "Called to notify the client that the job completed successfully."}, {"method_name": "printJobFailed", "method_sig": "void printJobFailed (PrintJobEvent pje)", "description": "Called to notify the client that the job failed to complete successfully\n and will have to be resubmitted."}, {"method_name": "printJobCanceled", "method_sig": "void printJobCanceled (PrintJobEvent pje)", "description": "Called to notify the client that the job was canceled by a user or a\n program."}, {"method_name": "printJobNoMoreEvents", "method_sig": "void printJobNoMoreEvents (PrintJobEvent pje)", "description": "Called to notify the client that no more events will be delivered. One\n cause of this event being generated is if the job has successfully\n completed, but the printing system is limited in capability and cannot\n verify this. This event is required to be delivered if none of the other\n terminal events (completed/failed/canceled) are delivered."}, {"method_name": "printJobRequiresAttention", "method_sig": "void printJobRequiresAttention (PrintJobEvent pje)", "description": "Called to notify the client that an error has occurred that the user\n might be able to fix. One example of an error that can generate this\n event is when the printer runs out of paper."}]}