{"name": "Class PrinterMessageFromOperator", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class PrinterMessageFromOperator is a printing attribute class, a\n text attribute, that provides a message from an operator, system\n administrator, or \"intelligent\" process to indicate to the end user\n information about or status of the printer, such as why it is unavailable or\n when it is expected to be available.\n \n A Print Service's attribute set includes zero instances or one instance of a\n PrinterMessageFromOperator attribute, not more than one instance. A\n new PrinterMessageFromOperator attribute replaces an existing\n PrinterMessageFromOperator attribute, if any. In other words,\n PrinterMessageFromOperator is not intended to be a history log. If it\n wishes, the client can detect changes to a Print Service's\n PrinterMessageFromOperator attribute and maintain the client's own\n history log of the PrinterMessageFromOperator attribute values.\n \nIPP Compatibility: The string value gives the IPP name value. The\n locale gives the IPP natural language. The category name returned by\n getName() gives the IPP attribute name.", "codes": ["public final class PrinterMessageFromOperator\nextends TextSyntax\nimplements PrintServiceAttribute"], "fields": [], "methods": [{"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this printer message from operator attribute is\n equivalent to the passed in object. To be equivalent, all of the\n following conditions must be true:\n \nobject is not null.\n   object is an instance of class\n   PrinterMessageFromOperator.\n   This printer message from operator attribute's underlying string\n   and object's underlying string are equal.\n   This printer message from operator attribute's locale and\n   object's locale are equal.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class PrinterMessageFromOperator, the category is class\n PrinterMessageFromOperator itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class PrinterMessageFromOperator, the category name is\n \"printer-message-from-operator\"."}]}