{"name": "Class PrinterResolution", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class PrinterResolution is a printing attribute class that specifies\n an exact resolution supported by a printer or to be used for a print job.\n This attribute assumes that printers have a small set of device resolutions\n at which they can operate rather than a continuum.\n \nPrinterResolution is used in multiple ways:\n \nWhen a client searches looking for a printer that supports the client's\n   desired resolution exactly (no more, no less), the client specifies an\n   instance of class PrinterResolution indicating the exact resolution\n   the client wants. Only printers supporting that exact resolution will match\n   the search.\n   When a client needs to print a job using the client's desired\n   resolution exactly (no more, no less), the client specifies an instance of\n   class PrinterResolution as an attribute of the Print Job. This will\n   fail if the Print Job doesn't support that exact resolution, and\n   Fidelity is set to true.\n \n If a client wants to locate a printer supporting a resolution greater than\n some required minimum, then it may be necessary to exclude this attribute\n from a lookup request and to directly query the set of supported resolutions,\n and specify the one that most closely meets the client's requirements. In\n some cases this may be more simply achieved by specifying a\n PrintQuality attribute which often controls resolution.\n \nIPP Compatibility: The information needed to construct an IPP\n \"printer-resolution\" attribute can be obtained by calling methods on\n the PrinterResolution object. The category name returned by getName()\n gives the IPP attribute name.", "codes": ["public final class PrinterResolution\nextends ResolutionSyntax\nimplements DocAttribute, PrintRequestAttribute, PrintJobAttribute"], "fields": [], "methods": [{"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this printer resolution attribute is equivalent to the\n passed in object. To be equivalent, all of the following conditions must\n be true:\n \nobject is not null.\n   object is an instance of class PrinterResolution.\n   This attribute's cross feed direction resolution is equal to\n   object's cross feed direction resolution.\n   This attribute's feed direction resolution is equal to\n   object's feed direction resolution.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class PrinterResolution, the category is class\n PrinterResolution itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class PrinterResolution, the category name is\n \"printer-resolution\"."}]}