{"name": "Class PrinterMoreInfo", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class PrinterMoreInfo is a printing attribute class, a URI,\n that is used to obtain more information about this specific printer. For\n example, this could be an HTTP type URI referencing an HTML page\n accessible to a web browser. The information obtained from this URI\n is intended for end user consumption. Features outside the scope of the Print\n Service API can be accessed from this URI. The information is\n intended to be specific to this printer instance and site specific services\n (e.g. job pricing, services offered, end user assistance).\n \n In contrast, the\n PrinterMoreInfoManufacturer attribute is\n used to find out more information about this general kind of printer rather\n than this specific printer.\n \nIPP Compatibility: The string form returned by toString()\n gives the IPP uri value. The category name returned by getName()\n gives the IPP attribute name.", "codes": ["public final class PrinterMoreInfo\nextends URISyntax\nimplements PrintServiceAttribute"], "fields": [], "methods": [{"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Returns whether this printer more info attribute is equivalent to the\n passed in object. To be equivalent, all of the following conditions must\n be true:\n \nobject is not null.\n   object is an instance of class PrinterMoreInfo.\n   This printer more info attribute's URI and object's\n   URI are equal.\n "}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class PrinterMoreInfo, the category is class\n PrinterMoreInfo itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class PrinterMoreInfo, the category name is\n \"printer-more-info\"."}]}