{"name": "Class PrinterStateReasons", "module": "java.desktop", "package": "javax.print.attribute.standard", "text": "Class PrinterStateReasons is a printing attribute class, a set of\n enumeration values, that provides additional information about the printer's\n current state, i.e., information that augments the value of the printer's\n PrinterState attribute.\n \n Instances of PrinterStateReason do not appear in a\n Print Service's attribute set directly. Rather, a PrinterStateReasons\n attribute appears in the Print Service's attribute set. The\n PrinterStateReasons attribute contains zero, one, or more than one\n PrinterStateReason objects which pertain to the\n Print Service's status, and each\n PrinterStateReason object is associated with a\n Severity level of REPORT (least severe),\n WARNING, or ERROR (most severe). The printer adds a\n PrinterStateReason object to the Print Service's\n PrinterStateReasons attribute when the corresponding condition\n becomes true of the printer, and the printer removes the\n PrinterStateReason object again when the\n corresponding condition becomes false, regardless of whether the Print\n Service's overall PrinterState also changed.\n \n Class PrinterStateReasons inherits its implementation from class\n java.util.HashMap. Each entry in the map consists of a\n PrinterStateReason object (key) mapping to a\n Severity object (value):\n \n Unlike most printing attributes which are immutable once constructed, class\n PrinterStateReasons is designed to be mutable; you can add\n PrinterStateReason objects to an existing\n PrinterStateReasons object and remove them again. However, like class\n java.util.HashMap, class PrinterStateReasons is not\n multiple thread safe. If a PrinterStateReasons object will be used by\n multiple threads, be sure to synchronize its operations (e.g., using a\n synchronized map view obtained from class java.util.Collections).\n \nIPP Compatibility: The string values returned by each individual\n PrinterStateReason object's and the associated\n Severity object's toString() methods, concatenated\n together with a hyphen (\"-\") in between, gives the IPP keyword value.\n The category name returned by getName() gives the IPP attribute name.", "codes": ["public final class PrinterStateReasons\nextends HashMap<PrinterStateReason, Severity>\nimplements PrintServiceAttribute"], "fields": [], "methods": [{"method_name": "put", "method_sig": "public Severity put (PrinterStateReason reason,\n                    Severity severity)", "description": "Adds the given printer state reason to this printer state reasons\n attribute, associating it with the given severity level. If this printer\n state reasons attribute previously contained a mapping for the given\n printer state reason, the old value is replaced."}, {"method_name": "getCategory", "method_sig": "public final Class<? extends Attribute> getCategory()", "description": "Get the printing attribute class which is to be used as the \"category\"\n for this printing attribute value.\n \n For class PrinterStateReasons, the category is class\n PrinterStateReasons itself."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Get the name of the category of which this attribute value is an\n instance.\n \n For class PrinterStateReasons, the category name is\n \"printer-state-reasons\"."}, {"method_name": "printerStateReasonSet", "method_sig": "public Set<PrinterStateReason> printerStateReasonSet (Severity severity)", "description": "Obtain an unmodifiable set view of the individual printer state reason\n attributes at the given severity level in this\n PrinterStateReasons attribute. Each element in the set view is a\n PrinterStateReason object. The only elements\n in the set view are the PrinterStateReason\n objects that map to the given severity value. The set view is backed by\n this PrinterStateReasons attribute, so changes to this\n PrinterStateReasons attribute are reflected in the set view. The\n set view does not support element insertion or removal. The set view's\n iterator does not support element removal."}]}