{"name": "Interface ProcessingEnvironment", "module": "java.compiler", "package": "javax.annotation.processing", "text": "An annotation processing tool framework will provide an annotation processor with an object\n implementing this interface so the processor can use facilities\n provided by the framework to write new files, report error\n messages, and find other utilities.\n\n Third parties may wish to provide value-add wrappers around the\n facility objects from this interface, for example a Filer\n extension that allows multiple processors to coordinate writing out\n a single source file.  To enable this, for processors running in a\n context where their side effects via the API could be visible to\n each other, the tool infrastructure must provide corresponding\n facility objects that are .equals, Filers that are\n .equals, and so on.  In addition, the tool invocation must\n be able to be configured such that from the perspective of the\n running annotation processors, at least the chosen subset of helper\n classes are viewed as being loaded by the same class loader.\n (Since the facility objects manage shared state, the implementation\n of a wrapper class must know whether or not the same base facility\n object has been wrapped before.)", "codes": ["public interface ProcessingEnvironment"], "fields": [], "methods": [{"method_name": "getOptions", "method_sig": "Map<String, String> getOptions()", "description": "Returns the processor-specific options passed to the annotation\n processing tool.  Options are returned in the form of a map from\n option name to option value.  For an option with no value, the\n corresponding value in the map is null.\n\n See documentation of the particular tool infrastructure\n being used for details on how to pass in processor-specific\n options.  For example, a command-line implementation may\n distinguish processor-specific options by prefixing them with a\n known string like \"-A\"; other tool implementations may\n follow different conventions or provide alternative mechanisms.\n A given implementation may also provide implementation-specific\n ways of finding options passed to the tool in addition to the\n processor-specific options."}, {"method_name": "getMessager", "method_sig": "Messager getMessager()", "description": "Returns the messager used to report errors, warnings, and other\n notices."}, {"method_name": "getFiler", "method_sig": "Filer getFiler()", "description": "Returns the filer used to create new source, class, or auxiliary\n files."}, {"method_name": "getElementUtils", "method_sig": "Elements getElementUtils()", "description": "Returns an implementation of some utility methods for\n operating on elements"}, {"method_name": "getTypeUtils", "method_sig": "Types getTypeUtils()", "description": "Returns an implementation of some utility methods for\n operating on types."}, {"method_name": "getSourceVersion", "method_sig": "SourceVersion getSourceVersion()", "description": "Returns the source version that any generated source and class files should conform to."}, {"method_name": "getLocale", "method_sig": "Locale getLocale()", "description": "Returns the current locale or null if no locale is in\n effect.  The locale can be be used to provide localized\n messages."}]}