{"name": "Class PropertyChangeEvent", "module": "java.desktop", "package": "java.beans", "text": "A \"PropertyChange\" event gets delivered whenever a bean changes a \"bound\"\n or \"constrained\" property.  A PropertyChangeEvent object is sent as an\n argument to the PropertyChangeListener and VetoableChangeListener methods.\n \n Normally PropertyChangeEvents are accompanied by the name and the old\n and new value of the changed property.  If the new value is a primitive\n type (such as int or boolean) it must be wrapped as the\n corresponding java.lang.* Object type (such as Integer or Boolean).\n \n Null values may be provided for the old and the new values if their\n true values are not known.\n \n An event source may send a null object as the name to indicate that an\n arbitrary set of if its properties have changed.  In this case the\n old and new values should also be null.", "codes": ["public class PropertyChangeEvent\nextends EventObject"], "fields": [], "methods": [{"method_name": "getPropertyName", "method_sig": "public String getPropertyName()", "description": "Gets the programmatic name of the property that was changed."}, {"method_name": "getNewValue", "method_sig": "public Object getNewValue()", "description": "Gets the new value for the property, expressed as an Object."}, {"method_name": "getOldValue", "method_sig": "public Object getOldValue()", "description": "Gets the old value for the property, expressed as an Object."}, {"method_name": "setPropagationId", "method_sig": "public void setPropagationId (Object propagationId)", "description": "Sets the propagationId object for the event."}, {"method_name": "getPropagationId", "method_sig": "public Object getPropagationId()", "description": "The \"propagationId\" field is reserved for future use.  In Beans 1.0\n the sole requirement is that if a listener catches a PropertyChangeEvent\n and then fires a PropertyChangeEvent of its own, then it should\n make sure that it propagates the propagationId field from its\n incoming event to its outgoing event."}, {"method_name": "toString", "method_sig": "public String toString()", "description": "Returns a string representation of the object."}]}