{"name": "Interface PropertyEditor", "module": "java.desktop", "package": "java.beans", "text": "A PropertyEditor class provides support for GUIs that want to\n allow users to edit a property value of a given type.\n \n PropertyEditor supports a variety of different kinds of ways of\n displaying and updating property values.  Most PropertyEditors will\n only need to support a subset of the different options available in\n this API.\n \n Simple PropertyEditors may only support the getAsText and setAsText\n methods and need not support (say) paintValue or getCustomEditor.  More\n complex types may be unable to support getAsText and setAsText but will\n instead support paintValue and getCustomEditor.\n \n Every propertyEditor must support one or more of the three simple\n display styles.  Thus it can either (1) support isPaintable or (2)\n both return a non-null String[] from getTags() and return a non-null\n value from getAsText or (3) simply return a non-null String from\n getAsText().\n \n Every property editor must support a call on setValue when the argument\n object is of the type for which this is the corresponding propertyEditor.\n In addition, each property editor must either support a custom editor,\n or support setAsText.\n \n Each PropertyEditor should have a null constructor.", "codes": ["public interface PropertyEditor"], "fields": [], "methods": [{"method_name": "setValue", "method_sig": "void setValue (Object value)", "description": "Set (or change) the object that is to be edited.  Primitive types such\n as \"int\" must be wrapped as the corresponding object type such as\n \"java.lang.Integer\"."}, {"method_name": "getValue", "method_sig": "Object getValue()", "description": "Gets the property value."}, {"method_name": "isPaintable", "method_sig": "boolean isPaintable()", "description": "Determines whether this property editor is paintable."}, {"method_name": "paintValue", "method_sig": "void paintValue (Graphics gfx,\n                Rectangle box)", "description": "Paint a representation of the value into a given area of screen\n real estate.  Note that the propertyEditor is responsible for doing\n its own clipping so that it fits into the given rectangle.\n \n If the PropertyEditor doesn't honor paint requests (see isPaintable)\n this method should be a silent noop.\n \n The given Graphics object will have the default font, color, etc of\n the parent container.  The PropertyEditor may change graphics attributes\n such as font and color and doesn't need to restore the old values."}, {"method_name": "getJavaInitializationString", "method_sig": "String getJavaInitializationString()", "description": "Returns a fragment of Java code that can be used to set a property\n to match the editors current state. This method is intended\n for use when generating Java code to reflect changes made through the\n property editor.\n \n The code fragment should be context free and must be a legal Java\n expression as specified by the JLS.\n \n Specifically, if the expression represents a computation then all\n classes and static members should be fully qualified. This rule\n applies to constructors, static methods and non primitive arguments.\n \n Caution should be used when evaluating the expression as it may throw\n exceptions. In particular, code generators must ensure that generated\n code will compile in the presence of an expression that can throw\n checked exceptions.\n \n Example results are:\n \nPrimitive expresssion: 2\nClass constructor: new java.awt.Color(127,127,34)\nStatic field: java.awt.Color.orange\nStatic method: javax.swing.Box.createRigidArea(new\n                                   java.awt.Dimension(0, 5))\n"}, {"method_name": "getAsText", "method_sig": "String getAsText()", "description": "Gets the property value as text."}, {"method_name": "setAsText", "method_sig": "void setAsText (String text)\n        throws IllegalArgumentException", "description": "Set the property value by parsing a given String.  May raise\n java.lang.IllegalArgumentException if either the String is\n badly formatted or if this kind of property can't be expressed\n as text."}, {"method_name": "getTags", "method_sig": "String[] getTags()", "description": "If the property value must be one of a set of known tagged values,\n then this method should return an array of the tags.  This can\n be used to represent (for example) enum values.  If a PropertyEditor\n supports tags, then it should support the use of setAsText with\n a tag value as a way of setting the value and the use of getAsText\n to identify the current value."}, {"method_name": "getCustomEditor", "method_sig": "Component getCustomEditor()", "description": "A PropertyEditor may choose to make available a full custom Component\n that edits its property value.  It is the responsibility of the\n PropertyEditor to hook itself up to its editor Component itself and\n to report property value changes by firing a PropertyChange event.\n \n The higher-level code that calls getCustomEditor may either embed\n the Component in some larger property sheet, or it may put it in\n its own individual dialog, or ..."}, {"method_name": "supportsCustomEditor", "method_sig": "boolean supportsCustomEditor()", "description": "Determines whether this property editor supports a custom editor."}, {"method_name": "addPropertyChangeListener", "method_sig": "void addPropertyChangeListener (PropertyChangeListener listener)", "description": "Adds a listener for the value change.\n When the property editor changes its value\n it should fire a PropertyChangeEvent\n on all registered PropertyChangeListeners,\n specifying the null value for the property name\n and itself as the source."}, {"method_name": "removePropertyChangeListener", "method_sig": "void removePropertyChangeListener (PropertyChangeListener listener)", "description": "Removes a listener for the value change."}]}