{"name": "Class ProxySelector", "module": "java.base", "package": "java.net", "text": "Selects the proxy server to use, if any, when connecting to the\n network resource referenced by a URL. A proxy selector is a\n concrete sub-class of this class and is registered by invoking the\n setDefault method. The\n currently registered proxy selector can be retrieved by calling\n getDefault method.\n\n  When a proxy selector is registered, for instance, a subclass\n of URLConnection class should call the select\n method for each URL request so that the proxy selector can decide\n if a direct, or proxied connection should be used. The select method returns an iterator over a collection with\n the preferred connection approach.\n\n  If a connection cannot be established to a proxy (PROXY or\n SOCKS) servers then the caller should call the proxy selector's\n connectFailed method to notify the proxy\n selector that the proxy server is unavailable. \nThe default proxy selector does enforce a\n set of System Properties\n related to proxy settings.", "codes": ["public abstract class ProxySelector\nextends Object"], "fields": [], "methods": [{"method_name": "getDefault", "method_sig": "public static ProxySelector getDefault()", "description": "Gets the system-wide proxy selector."}, {"method_name": "setDefault", "method_sig": "public static void setDefault (ProxySelector ps)", "description": "Sets (or unsets) the system-wide proxy selector.\n\n Note: non-standard protocol handlers may ignore this setting."}, {"method_name": "select", "method_sig": "public abstract List<Proxy> select (URI uri)", "description": "Selects all the applicable proxies based on the protocol to\n access the resource with and a destination address to access\n the resource at.\n The format of the URI is defined as follow:\n \nhttp URI for http connections\nhttps URI for https connections\n socket://host:port\n     for tcp client sockets connections\n"}, {"method_name": "connectFailed", "method_sig": "public abstract void connectFailed (URI uri,\n                                   SocketAddress sa,\n                                   IOException ioe)", "description": "Called to indicate that a connection could not be established\n to a proxy/socks server. An implementation of this method can\n temporarily remove the proxies or reorder the sequence of\n proxies returned by select(URI), using the address\n and the IOException caught when trying to connect."}, {"method_name": "of", "method_sig": "public static ProxySelector of (InetSocketAddress proxyAddress)", "description": "Returns a ProxySelector which uses the given proxy address for all HTTP\n and HTTPS requests. If proxy is null then proxying is disabled."}]}