{"name": "Interface Queue<E>", "module": "java.base", "package": "java.util", "text": "A collection designed for holding elements prior to processing.\n Besides basic Collection operations, queues provide\n additional insertion, extraction, and inspection operations.\n Each of these methods exists in two forms: one throws an exception\n if the operation fails, the other returns a special value (either\n null or false, depending on the operation).  The\n latter form of the insert operation is designed specifically for\n use with capacity-restricted Queue implementations; in most\n implementations, insert operations cannot fail.\n\n \nSummary of Queue methods\n\n\n\nThrows exception\nReturns special value\n\n\n\n\nInsert\nadd(e)\noffer(e)\n\n\nRemove\nremove()\npoll()\n\n\nExamine\nelement()\npeek()\n\n\n\nQueues typically, but do not necessarily, order elements in a\n FIFO (first-in-first-out) manner.  Among the exceptions are\n priority queues, which order elements according to a supplied\n comparator, or the elements' natural ordering, and LIFO queues (or\n stacks) which order the elements LIFO (last-in-first-out).\n Whatever the ordering used, the head of the queue is that\n element which would be removed by a call to remove() or\n poll().  In a FIFO queue, all new elements are inserted at\n the tail of the queue. Other kinds of queues may use\n different placement rules.  Every Queue implementation\n must specify its ordering properties.\n\n The offer method inserts an element if possible,\n otherwise returning false.  This differs from the Collection.add method, which can fail to\n add an element only by throwing an unchecked exception.  The\n offer method is designed for use when failure is a normal,\n rather than exceptional occurrence, for example, in fixed-capacity\n (or \"bounded\") queues.\n\n The remove() and poll() methods remove and\n return the head of the queue.\n Exactly which element is removed from the queue is a\n function of the queue's ordering policy, which differs from\n implementation to implementation. The remove() and\n poll() methods differ only in their behavior when the\n queue is empty: the remove() method throws an exception,\n while the poll() method returns null.\n\n The element() and peek() methods return, but do\n not remove, the head of the queue.\n\n The Queue interface does not define the blocking queue\n methods, which are common in concurrent programming.  These methods,\n which wait for elements to appear or for space to become available, are\n defined in the BlockingQueue interface, which\n extends this interface.\n\n Queue implementations generally do not allow insertion\n of null elements, although some implementations, such as\n LinkedList, do not prohibit insertion of null.\n Even in the implementations that permit it, null should\n not be inserted into a Queue, as null is also\n used as a special return value by the poll method to\n indicate that the queue contains no elements.\n\n Queue implementations generally do not define\n element-based versions of methods equals and\n hashCode but instead inherit the identity based versions\n from class Object, because element-based equality is not\n always well-defined for queues with the same elements but different\n ordering properties.\n\n This interface is a member of the\n \n Java Collections Framework.", "codes": ["public interface Queue<E>\nextends Collection<E>"], "fields": [], "methods": [{"method_name": "add", "method_sig": "boolean add (E e)", "description": "Inserts the specified element into this queue if it is possible to do so\n immediately without violating capacity restrictions, returning\n true upon success and throwing an IllegalStateException\n if no space is currently available."}, {"method_name": "offer", "method_sig": "boolean offer (E e)", "description": "Inserts the specified element into this queue if it is possible to do\n so immediately without violating capacity restrictions.\n When using a capacity-restricted queue, this method is generally\n preferable to add(E), which can fail to insert an element only\n by throwing an exception."}, {"method_name": "remove", "method_sig": "E remove()", "description": "Retrieves and removes the head of this queue.  This method differs\n from poll() only in that it throws an exception if\n this queue is empty."}, {"method_name": "poll", "method_sig": "E poll()", "description": "Retrieves and removes the head of this queue,\n or returns null if this queue is empty."}, {"method_name": "element", "method_sig": "E element()", "description": "Retrieves, but does not remove, the head of this queue.  This method\n differs from peek only in that it throws an exception\n if this queue is empty."}, {"method_name": "peek", "method_sig": "E peek()", "description": "Retrieves, but does not remove, the head of this queue,\n or returns null if this queue is empty."}]}