{"name": "Class ReentrantReadWriteLock", "module": "java.base", "package": "java.util.concurrent.locks", "text": "An implementation of ReadWriteLock supporting similar\n semantics to ReentrantLock.\n This class has the following properties:\n\n \nAcquisition order\nThis class does not impose a reader or writer preference\n ordering for lock access.  However, it does support an optional\n fairness policy.\n\n \nNon-fair mode (default)\nWhen constructed as non-fair (the default), the order of entry\n to the read and write lock is unspecified, subject to reentrancy\n constraints.  A nonfair lock that is continuously contended may\n indefinitely postpone one or more reader or writer threads, but\n will normally have higher throughput than a fair lock.\n\n Fair mode\nWhen constructed as fair, threads contend for entry using an\n approximately arrival-order policy. When the currently held lock\n is released, either the longest-waiting single writer thread will\n be assigned the write lock, or if there is a group of reader threads\n waiting longer than all waiting writer threads, that group will be\n assigned the read lock.\n\n A thread that tries to acquire a fair read lock (non-reentrantly)\n will block if either the write lock is held, or there is a waiting\n writer thread. The thread will not acquire the read lock until\n after the oldest currently waiting writer thread has acquired and\n released the write lock. Of course, if a waiting writer abandons\n its wait, leaving one or more reader threads as the longest waiters\n in the queue with the write lock free, then those readers will be\n assigned the read lock.\n\n A thread that tries to acquire a fair write lock (non-reentrantly)\n will block unless both the read lock and write lock are free (which\n implies there are no waiting threads).  (Note that the non-blocking\n ReentrantReadWriteLock.ReadLock.tryLock() and ReentrantReadWriteLock.WriteLock.tryLock() methods\n do not honor this fair setting and will immediately acquire the lock\n if it is possible, regardless of waiting threads.)\n \nReentrancy\nThis lock allows both readers and writers to reacquire read or\n write locks in the style of a ReentrantLock. Non-reentrant\n readers are not allowed until all write locks held by the writing\n thread have been released.\n\n Additionally, a writer can acquire the read lock, but not\n vice-versa.  Among other applications, reentrancy can be useful\n when write locks are held during calls or callbacks to methods that\n perform reads under read locks.  If a reader tries to acquire the\n write lock it will never succeed.\n\n Lock downgrading\nReentrancy also allows downgrading from the write lock to a read lock,\n by acquiring the write lock, then the read lock and then releasing the\n write lock. However, upgrading from a read lock to the write lock is\n not possible.\n\n Interruption of lock acquisition\nThe read lock and write lock both support interruption during lock\n acquisition.\n\n Condition support\nThe write lock provides a Condition implementation that\n behaves in the same way, with respect to the write lock, as the\n Condition implementation provided by\n ReentrantLock.newCondition() does for ReentrantLock.\n This Condition can, of course, only be used with the write lock.\n\n The read lock does not support a Condition and\n readLock().newCondition() throws\n UnsupportedOperationException.\n\n Instrumentation\nThis class supports methods to determine whether locks\n are held or contended. These methods are designed for monitoring\n system state, not for synchronization control.\n \nSerialization of this class behaves in the same way as built-in\n locks: a deserialized lock is in the unlocked state, regardless of\n its state when serialized.\n\n Sample usages. Here is a code sketch showing how to perform\n lock downgrading after updating a cache (exception handling is\n particularly tricky when handling multiple locks in a non-nested\n fashion):\n\n  \n class CachedData {\n   Object data;\n   boolean cacheValid;\n   final ReentrantReadWriteLock rwl = new ReentrantReadWriteLock();\n\n   void processCachedData() {\n     rwl.readLock().lock();\n     if (!cacheValid) {\n       // Must release read lock before acquiring write lock\n       rwl.readLock().unlock();\n       rwl.writeLock().lock();\n       try {\n         // Recheck state because another thread might have\n         // acquired write lock and changed state before we did.\n         if (!cacheValid) {\n           data = ...\n           cacheValid = true;\n         }\n         // Downgrade by acquiring read lock before releasing write lock\n         rwl.readLock().lock();\n       } finally {\n         rwl.writeLock().unlock(); // Unlock write, still hold read\n       }\n     }\n\n     try {\n       use(data);\n     } finally {\n       rwl.readLock().unlock();\n     }\n   }\n }\n\n ReentrantReadWriteLocks can be used to improve concurrency in some\n uses of some kinds of Collections. This is typically worthwhile\n only when the collections are expected to be large, accessed by\n more reader threads than writer threads, and entail operations with\n overhead that outweighs synchronization overhead. For example, here\n is a class using a TreeMap that is expected to be large and\n concurrently accessed.\n\n  \n class RWDictionary {\n   private final Map<String, Data> m = new TreeMap<>();\n   private final ReentrantReadWriteLock rwl = new ReentrantReadWriteLock();\n   private final Lock r = rwl.readLock();\n   private final Lock w = rwl.writeLock();\n\n   public Data get(String key) {\n     r.lock();\n     try { return m.get(key); }\n     finally { r.unlock(); }\n   }\n   public List<String> allKeys() {\n     r.lock();\n     try { return new ArrayList<>(m.keySet()); }\n     finally { r.unlock(); }\n   }\n   public Data put(String key, Data value) {\n     w.lock();\n     try { return m.put(key, value); }\n     finally { w.unlock(); }\n   }\n   public void clear() {\n     w.lock();\n     try { m.clear(); }\n     finally { w.unlock(); }\n   }\n }\nImplementation Notes\nThis lock supports a maximum of 65535 recursive write locks\n and 65535 read locks. Attempts to exceed these limits result in\n Error throws from locking methods.", "codes": ["public class ReentrantReadWriteLock\nextends Object\nimplements ReadWriteLock, Serializable"], "fields": [], "methods": [{"method_name": "isFair", "method_sig": "public final boolean isFair()", "description": "Returns true if this lock has fairness set true."}, {"method_name": "getOwner", "method_sig": "protected Thread getOwner()", "description": "Returns the thread that currently owns the write lock, or\n null if not owned. When this method is called by a\n thread that is not the owner, the return value reflects a\n best-effort approximation of current lock status. For example,\n the owner may be momentarily null even if there are\n threads trying to acquire the lock but have not yet done so.\n This method is designed to facilitate construction of\n subclasses that provide more extensive lock monitoring\n facilities."}, {"method_name": "getReadLockCount", "method_sig": "public int getReadLockCount()", "description": "Queries the number of read locks held for this lock. This\n method is designed for use in monitoring system state, not for\n synchronization control."}, {"method_name": "isWriteLocked", "method_sig": "public boolean isWriteLocked()", "description": "Queries if the write lock is held by any thread. This method is\n designed for use in monitoring system state, not for\n synchronization control."}, {"method_name": "isWriteLockedByCurrentThread", "method_sig": "public boolean isWriteLockedByCurrentThread()", "description": "Queries if the write lock is held by the current thread."}, {"method_name": "getWriteHoldCount", "method_sig": "public int getWriteHoldCount()", "description": "Queries the number of reentrant write holds on this lock by the\n current thread.  A writer thread has a hold on a lock for\n each lock action that is not matched by an unlock action."}, {"method_name": "getReadHoldCount", "method_sig": "public int getReadHoldCount()", "description": "Queries the number of reentrant read holds on this lock by the\n current thread.  A reader thread has a hold on a lock for\n each lock action that is not matched by an unlock action."}, {"method_name": "getQueuedWriterThreads", "method_sig": "protected Collection<Thread> getQueuedWriterThreads()", "description": "Returns a collection containing threads that may be waiting to\n acquire the write lock.  Because the actual set of threads may\n change dynamically while constructing this result, the returned\n collection is only a best-effort estimate.  The elements of the\n returned collection are in no particular order.  This method is\n designed to facilitate construction of subclasses that provide\n more extensive lock monitoring facilities."}, {"method_name": "getQueuedReaderThreads", "method_sig": "protected Collection<Thread> getQueuedReaderThreads()", "description": "Returns a collection containing threads that may be waiting to\n acquire the read lock.  Because the actual set of threads may\n change dynamically while constructing this result, the returned\n collection is only a best-effort estimate.  The elements of the\n returned collection are in no particular order.  This method is\n designed to facilitate construction of subclasses that provide\n more extensive lock monitoring facilities."}, {"method_name": "hasQueuedThreads", "method_sig": "public final boolean hasQueuedThreads()", "description": "Queries whether any threads are waiting to acquire the read or\n write lock. Note that because cancellations may occur at any\n time, a true return does not guarantee that any other\n thread will ever acquire a lock.  This method is designed\n primarily for use in monitoring of the system state."}, {"method_name": "hasQueuedThread", "method_sig": "public final boolean hasQueuedThread (Thread thread)", "description": "Queries whether the given thread is waiting to acquire either\n the read or write lock. Note that because cancellations may\n occur at any time, a true return does not guarantee\n that this thread will ever acquire a lock.  This method is\n designed primarily for use in monitoring of the system state."}, {"method_name": "getQueueLength", "method_sig": "public final int getQueueLength()", "description": "Returns an estimate of the number of threads waiting to acquire\n either the read or write lock.  The value is only an estimate\n because the number of threads may change dynamically while this\n method traverses internal data structures.  This method is\n designed for use in monitoring system state, not for\n synchronization control."}, {"method_name": "getQueuedThreads", "method_sig": "protected Collection<Thread> getQueuedThreads()", "description": "Returns a collection containing threads that may be waiting to\n acquire either the read or write lock.  Because the actual set\n of threads may change dynamically while constructing this\n result, the returned collection is only a best-effort estimate.\n The elements of the returned collection are in no particular\n order.  This method is designed to facilitate construction of\n subclasses that provide more extensive monitoring facilities."}, {"method_name": "hasWaiters", "method_sig": "public boolean hasWaiters (Condition condition)", "description": "Queries whether any threads are waiting on the given condition\n associated with the write lock. Note that because timeouts and\n interrupts may occur at any time, a true return does\n not guarantee that a future signal will awaken any\n threads.  This method is designed primarily for use in\n monitoring of the system state."}, {"method_name": "getWaitQueueLength", "method_sig": "public int getWaitQueueLength (Condition condition)", "description": "Returns an estimate of the number of threads waiting on the\n given condition associated with the write lock. Note that because\n timeouts and interrupts may occur at any time, the estimate\n serves only as an upper bound on the actual number of waiters.\n This method is designed for use in monitoring of the system\n state, not for synchronization control."}, {"method_name": "getWaitingThreads", "method_sig": "protected Collection<Thread> getWaitingThreads (Condition condition)", "description": "Returns a collection containing those threads that may be\n waiting on the given condition associated with the write lock.\n Because the actual set of threads may change dynamically while\n constructing this result, the returned collection is only a\n best-effort estimate. The elements of the returned collection\n are in no particular order.  This method is designed to\n facilitate construction of subclasses that provide more\n extensive condition monitoring facilities."}, {"method_name": "toString", "method_sig": "public String toString()", "description": "Returns a string identifying this lock, as well as its lock state.\n The state, in brackets, includes the String \"Write locks =\"\n followed by the number of reentrantly held write locks, and the\n String \"Read locks =\" followed by the number of held\n read locks."}]}