{"name": "Interface Ref", "module": "java.sql", "package": "java.sql", "text": "The mapping in the Java programming language of an SQL REF\n value, which is a reference to an SQL structured type value in the database.\n \n SQL REF values are stored in a table that contains\n instances of a referenceable SQL structured type, and each REF\n value is a unique identifier for one instance in that table.\n An SQL REF value may be used in place of the\n SQL structured type it references, either as a column value in a\n table or an attribute value in a structured type.\n \n Because an SQL REF value is a logical pointer to an\n SQL structured type, a Ref object is by default also a logical\n pointer. Thus, retrieving an SQL REF value as\n a Ref object does not materialize\n the attributes of the structured type on the client.\n \n A Ref object can be stored in the database using the\n PreparedStatement.setRef method.\n \n All methods on the Ref interface must be fully implemented if the\n JDBC driver supports the data type.", "codes": ["public interface Ref"], "fields": [], "methods": [{"method_name": "getBaseTypeName", "method_sig": "String getBaseTypeName()\n                throws SQLException", "description": "Retrieves the fully-qualified SQL name of the SQL structured type that\n this Ref object references."}, {"method_name": "getObject", "method_sig": "Object getObject (Map<String, Class<?>> map)\n          throws SQLException", "description": "Retrieves the referenced object and maps it to a Java type\n using the given type map."}, {"method_name": "getObject", "method_sig": "Object getObject()\n          throws SQLException", "description": "Retrieves the SQL structured type instance referenced by\n this Ref object.  If the connection's type map has an entry\n for the structured type, the instance will be custom mapped to\n the Java class indicated in the type map.  Otherwise, the\n structured type instance will be mapped to a Struct object."}, {"method_name": "setObject", "method_sig": "void setObject (Object value)\n        throws SQLException", "description": "Sets the structured type value that this Ref\n object references to the given instance of Object.\n The driver converts this to an SQL structured type when it\n sends it to the database."}]}