{"name": "Interface RenderableImage", "module": "java.desktop", "package": "java.awt.image.renderable", "text": "A RenderableImage is a common interface for rendering-independent\n images (a notion which subsumes resolution independence).  That is,\n images which are described and have operations applied to them\n independent of any specific rendering of the image.  For example, a\n RenderableImage can be rotated and cropped in\n resolution-independent terms.  Then, it can be rendered for various\n specific contexts, such as a draft preview, a high-quality screen\n display, or a printer, each in an optimal fashion.\n\n  A RenderedImage is returned from a RenderableImage via the\n createRendering() method, which takes a RenderContext.  The\n RenderContext specifies how the RenderedImage should be\n constructed.  Note that it is not possible to extract pixels\n directly from a RenderableImage.\n\n  The createDefaultRendering() and createScaledRendering() methods are\n convenience methods that construct an appropriate RenderContext\n internally.  All of the rendering methods may return a reference to a\n previously produced rendering.", "codes": ["public interface RenderableImage"], "fields": [{"field_name": "HINTS_OBSERVED", "field_sig": "static final String HINTS_OBSERVED", "description": "String constant that can be used to identify a property on\n a RenderedImage obtained via the createRendering or\n createScaledRendering methods.  If such a property exists,\n the value of the property will be a RenderingHints object\n specifying which hints were observed in creating the rendering."}], "methods": [{"method_name": "getSources", "method_sig": "Vector<RenderableImage> getSources()", "description": "Returns a vector of RenderableImages that are the sources of\n image data for this RenderableImage. Note that this method may\n return an empty vector, to indicate that the image has no sources,\n or null, to indicate that no information is available."}, {"method_name": "getProperty", "method_sig": "Object getProperty (String name)", "description": "Gets a property from the property set of this image.\n If the property name is not recognized, java.awt.Image.UndefinedProperty\n will be returned."}, {"method_name": "getPropertyNames", "method_sig": "String[] getPropertyNames()", "description": "Returns a list of names recognized by getProperty."}, {"method_name": "isDynamic", "method_sig": "boolean isDynamic()", "description": "Returns true if successive renderings (that is, calls to\n createRendering() or createScaledRendering()) with the same arguments\n may produce different results.  This method may be used to\n determine whether an existing rendering may be cached and\n reused.  It is always safe to return true."}, {"method_name": "getWidth", "method_sig": "float getWidth()", "description": "Gets the width in user coordinate space.  By convention, the\n usual width of a RenderableImage is equal to the image's aspect\n ratio (width divided by height)."}, {"method_name": "getHeight", "method_sig": "float getHeight()", "description": "Gets the height in user coordinate space.  By convention, the\n usual height of a RenderedImage is equal to 1.0F."}, {"method_name": "getMinX", "method_sig": "float getMinX()", "description": "Gets the minimum X coordinate of the rendering-independent image data."}, {"method_name": "getMinY", "method_sig": "float getMinY()", "description": "Gets the minimum Y coordinate of the rendering-independent image data."}, {"method_name": "createScaledRendering", "method_sig": "RenderedImage createScaledRendering (int w,\n                                    int h,\n                                    RenderingHints hints)", "description": "Creates a RenderedImage instance of this image with width w, and\n height h in pixels.  The RenderContext is built automatically\n with an appropriate usr2dev transform and an area of interest\n of the full image.  All the rendering hints come from hints\n passed in.\n\n  If w == 0, it will be taken to equal\n Math.round(h*(getWidth()/getHeight())).\n Similarly, if h == 0, it will be taken to equal\n Math.round(w*(getHeight()/getWidth())).  One of\n w or h must be non-zero or else an IllegalArgumentException\n will be thrown.\n\n  The created RenderedImage may have a property identified\n by the String HINTS_OBSERVED to indicate which RenderingHints\n were used to create the image.  In addition any RenderedImages\n that are obtained via the getSources() method on the created\n RenderedImage may have such a property."}, {"method_name": "createDefaultRendering", "method_sig": "RenderedImage createDefaultRendering()", "description": "Returns a RenderedImage instance of this image with a default\n width and height in pixels.  The RenderContext is built\n automatically with an appropriate usr2dev transform and an area\n of interest of the full image.  The rendering hints are\n empty.  createDefaultRendering may make use of a stored\n rendering for speed."}, {"method_name": "createRendering", "method_sig": "RenderedImage createRendering (RenderContext renderContext)", "description": "Creates a RenderedImage that represented a rendering of this image\n using a given RenderContext.  This is the most general way to obtain a\n rendering of a RenderableImage.\n\n  The created RenderedImage may have a property identified\n by the String HINTS_OBSERVED to indicate which RenderingHints\n (from the RenderContext) were used to create the image.\n In addition any RenderedImages\n that are obtained via the getSources() method on the created\n RenderedImage may have such a property."}]}