{"name": "Class Runtime", "module": "java.base", "package": "java.lang", "text": "Every Java application has a single instance of class\n Runtime that allows the application to interface with\n the environment in which the application is running. The current\n runtime can be obtained from the getRuntime method.\n \n An application cannot create its own instance of this class.", "codes": ["public class Runtime\nextends Object"], "fields": [], "methods": [{"method_name": "getRuntime", "method_sig": "public static Runtime getRuntime()", "description": "Returns the runtime object associated with the current Java application.\n Most of the methods of class Runtime are instance\n methods and must be invoked with respect to the current runtime object."}, {"method_name": "exit", "method_sig": "public void exit (int status)", "description": "Terminates the currently running Java virtual machine by initiating its\n shutdown sequence.  This method never returns normally.  The argument\n serves as a status code; by convention, a nonzero status code indicates\n abnormal termination.\n\n  All registered shutdown hooks, if any,\n are started in some unspecified order and allowed to run concurrently\n until they finish.  Once this is done the virtual machine\n halts.\n\n  If this method is invoked after all shutdown hooks have already\n been run and the status is nonzero then this method halts the\n virtual machine with the given status code. Otherwise, this method\n blocks indefinitely.\n\n  The System.exit method is the\n conventional and convenient means of invoking this method."}, {"method_name": "addShutdownHook", "method_sig": "public void addShutdownHook (Thread hook)", "description": "Registers a new virtual-machine shutdown hook.\n\n  The Java virtual machine shuts down in response to two kinds\n of events:\n\n   \n The program exits normally, when the last non-daemon\n   thread exits or when the exit (equivalently,\n   System.exit) method is invoked, or\n\n    The virtual machine is terminated in response to a\n   user interrupt, such as typing ^C, or a system-wide event,\n   such as user logoff or system shutdown.\n\n   \n A shutdown hook is simply an initialized but unstarted\n thread.  When the virtual machine begins its shutdown sequence it will\n start all registered shutdown hooks in some unspecified order and let\n them run concurrently.  When all the hooks have finished it will then\n halt. Note that daemon threads will continue to run during the shutdown\n sequence, as will non-daemon threads if shutdown was initiated by\n invoking the exit method.\n\n  Once the shutdown sequence has begun it can be stopped only by\n invoking the halt method, which forcibly\n terminates the virtual machine.\n\n  Once the shutdown sequence has begun it is impossible to register a\n new shutdown hook or de-register a previously-registered hook.\n Attempting either of these operations will cause an\n IllegalStateException to be thrown.\n\n  Shutdown hooks run at a delicate time in the life cycle of a virtual\n machine and should therefore be coded defensively.  They should, in\n particular, be written to be thread-safe and to avoid deadlocks insofar\n as possible.  They should also not rely blindly upon services that may\n have registered their own shutdown hooks and therefore may themselves in\n the process of shutting down.  Attempts to use other thread-based\n services such as the AWT event-dispatch thread, for example, may lead to\n deadlocks.\n\n  Shutdown hooks should also finish their work quickly.  When a\n program invokes exit the expectation is\n that the virtual machine will promptly shut down and exit.  When the\n virtual machine is terminated due to user logoff or system shutdown the\n underlying operating system may only allow a fixed amount of time in\n which to shut down and exit.  It is therefore inadvisable to attempt any\n user interaction or to perform a long-running computation in a shutdown\n hook.\n\n  Uncaught exceptions are handled in shutdown hooks just as in any\n other thread, by invoking the\n uncaughtException method of the\n thread's ThreadGroup object. The default implementation of this\n method prints the exception's stack trace to System.err and\n terminates the thread; it does not cause the virtual machine to exit or\n halt.\n\n  In rare circumstances the virtual machine may abort, that is,\n stop running without shutting down cleanly.  This occurs when the\n virtual machine is terminated externally, for example with the\n SIGKILL signal on Unix or the TerminateProcess call on\n Microsoft Windows.  The virtual machine may also abort if a native\n method goes awry by, for example, corrupting internal data structures or\n attempting to access nonexistent memory.  If the virtual machine aborts\n then no guarantee can be made about whether or not any shutdown hooks\n will be run."}, {"method_name": "removeShutdownHook", "method_sig": "public boolean removeShutdownHook (Thread hook)", "description": "De-registers a previously-registered virtual-machine shutdown hook."}, {"method_name": "halt", "method_sig": "public void halt (int status)", "description": "Forcibly terminates the currently running Java virtual machine.  This\n method never returns normally.\n\n  This method should be used with extreme caution.  Unlike the\n exit method, this method does not cause shutdown\n hooks to be started.  If the shutdown sequence has already been\n initiated then this method does not wait for any running\n shutdown hooks to finish their work."}, {"method_name": "exec", "method_sig": "public Process exec (String command)\n             throws IOException", "description": "Executes the specified string command in a separate process.\n\n This is a convenience method.  An invocation of the form\n exec(command)\n behaves in exactly the same way as the invocation\n exec(command, null, null)."}, {"method_name": "exec", "method_sig": "public Process exec (String command,\n                    String[] envp)\n             throws IOException", "description": "Executes the specified string command in a separate process with the\n specified environment.\n\n This is a convenience method.  An invocation of the form\n exec(command, envp)\n behaves in exactly the same way as the invocation\n exec(command, envp, null)."}, {"method_name": "exec", "method_sig": "public Process exec (String command,\n                    String[] envp,\n                    File dir)\n             throws IOException", "description": "Executes the specified string command in a separate process with the\n specified environment and working directory.\n\n This is a convenience method.  An invocation of the form\n exec(command, envp, dir)\n behaves in exactly the same way as the invocation\n exec(cmdarray, envp, dir),\n where cmdarray is an array of all the tokens in\n command.\n\n More precisely, the command string is broken\n into tokens using a StringTokenizer created by the call\n new {@link StringTokenizer}(command) with no\n further modification of the character categories.  The tokens\n produced by the tokenizer are then placed in the new string\n array cmdarray, in the same order."}, {"method_name": "exec", "method_sig": "public Process exec (String[] cmdarray)\n             throws IOException", "description": "Executes the specified command and arguments in a separate process.\n\n This is a convenience method.  An invocation of the form\n exec(cmdarray)\n behaves in exactly the same way as the invocation\n exec(cmdarray, null, null)."}, {"method_name": "exec", "method_sig": "public Process exec (String[] cmdarray,\n                    String[] envp)\n             throws IOException", "description": "Executes the specified command and arguments in a separate process\n with the specified environment.\n\n This is a convenience method.  An invocation of the form\n exec(cmdarray, envp)\n behaves in exactly the same way as the invocation\n exec(cmdarray, envp, null)."}, {"method_name": "exec", "method_sig": "public Process exec (String[] cmdarray,\n                    String[] envp,\n                    File dir)\n             throws IOException", "description": "Executes the specified command and arguments in a separate process with\n the specified environment and working directory.\n\n Given an array of strings cmdarray, representing the\n tokens of a command line, and an array of strings envp,\n representing \"environment\" variable settings, this method creates\n a new process in which to execute the specified command.\n\n This method checks that cmdarray is a valid operating\n system command.  Which commands are valid is system-dependent,\n but at the very least the command must be a non-empty list of\n non-null strings.\n\n If envp is null, the subprocess inherits the\n environment settings of the current process.\n\n A minimal set of system dependent environment variables may\n be required to start a process on some operating systems.\n As a result, the subprocess may inherit additional environment variable\n settings beyond those in the specified environment.\n\n ProcessBuilder.start() is now the preferred way to\n start a process with a modified environment.\n\n The working directory of the new subprocess is specified by dir.\n If dir is null, the subprocess inherits the\n current working directory of the current process.\n\n If a security manager exists, its\n checkExec\n method is invoked with the first component of the array\n cmdarray as its argument. This may result in a\n SecurityException being thrown.\n\n Starting an operating system process is highly system-dependent.\n Among the many things that can go wrong are:\n \nThe operating system program file was not found.\n Access to the program file was denied.\n The working directory does not exist.\n \nIn such cases an exception will be thrown.  The exact nature\n of the exception is system-dependent, but it will always be a\n subclass of IOException.\n\n If the operating system does not support the creation of\n processes, an UnsupportedOperationException will be thrown."}, {"method_name": "availableProcessors", "method_sig": "public int availableProcessors()", "description": "Returns the number of processors available to the Java virtual machine.\n\n  This value may change during a particular invocation of the virtual\n machine.  Applications that are sensitive to the number of available\n processors should therefore occasionally poll this property and adjust\n their resource usage appropriately. "}, {"method_name": "freeMemory", "method_sig": "public long freeMemory()", "description": "Returns the amount of free memory in the Java Virtual Machine.\n Calling the\n gc method may result in increasing the value returned\n by freeMemory."}, {"method_name": "totalMemory", "method_sig": "public long totalMemory()", "description": "Returns the total amount of memory in the Java virtual machine.\n The value returned by this method may vary over time, depending on\n the host environment.\n \n Note that the amount of memory required to hold an object of any\n given type may be implementation-dependent."}, {"method_name": "maxMemory", "method_sig": "public long maxMemory()", "description": "Returns the maximum amount of memory that the Java virtual machine\n will attempt to use.  If there is no inherent limit then the value\n Long.MAX_VALUE will be returned."}, {"method_name": "gc", "method_sig": "public void gc()", "description": "Runs the garbage collector.\n Calling this method suggests that the Java virtual machine expend\n effort toward recycling unused objects in order to make the memory\n they currently occupy available for quick reuse. When control\n returns from the method call, the virtual machine has made\n its best effort to recycle all discarded objects.\n \n The name gc stands for \"garbage\n collector\". The virtual machine performs this recycling\n process automatically as needed, in a separate thread, even if the\n gc method is not invoked explicitly.\n \n The method System.gc() is the conventional and convenient\n means of invoking this method."}, {"method_name": "runFinalization", "method_sig": "public void runFinalization()", "description": "Runs the finalization methods of any objects pending finalization.\n Calling this method suggests that the Java virtual machine expend\n effort toward running the finalize methods of objects\n that have been found to be discarded but whose finalize\n methods have not yet been run. When control returns from the\n method call, the virtual machine has made a best effort to\n complete all outstanding finalizations.\n \n The virtual machine performs the finalization process\n automatically as needed, in a separate thread, if the\n runFinalization method is not invoked explicitly.\n \n The method System.runFinalization() is the conventional\n and convenient means of invoking this method."}, {"method_name": "traceInstructions", "method_sig": "@Deprecated(since=\"9\",\n            forRemoval=true)\npublic void traceInstructions (boolean on)", "description": "Not implemented, does nothing."}, {"method_name": "traceMethodCalls", "method_sig": "@Deprecated(since=\"9\",\n            forRemoval=true)\npublic void traceMethodCalls (boolean on)", "description": "Not implemented, does nothing."}, {"method_name": "load", "method_sig": "public void load (String filename)", "description": "Loads the native library specified by the filename argument.  The filename\n argument must be an absolute path name.\n (for example\n Runtime.getRuntime().load(\"/home/avh/lib/libX11.so\");).\n\n If the filename argument, when stripped of any platform-specific library\n prefix, path, and file extension, indicates a library whose name is,\n for example, L, and a native library called L is statically linked\n with the VM, then the JNI_OnLoad_L function exported by the library\n is invoked rather than attempting to load a dynamic library.\n A filename matching the argument does not have to exist in the file\n system.\n See the  JNI Specification\n for more details.\n\n Otherwise, the filename argument is mapped to a native library image in\n an implementation-dependent manner.\n \n First, if there is a security manager, its checkLink\n method is called with the filename as its argument.\n This may result in a security exception.\n \n This is similar to the method loadLibrary(String), but it\n accepts a general file name as an argument rather than just a library\n name, allowing any file of native code to be loaded.\n \n The method System.load(String) is the conventional and\n convenient means of invoking this method."}, {"method_name": "loadLibrary", "method_sig": "public void loadLibrary (String libname)", "description": "Loads the native library specified by the libname\n argument.  The libname argument must not contain any platform\n specific prefix, file extension or path. If a native library\n called libname is statically linked with the VM, then the\n JNI_OnLoad_libname function exported by the library is invoked.\n See the  JNI Specification\n for more details.\n\n Otherwise, the libname argument is loaded from a system library\n location and mapped to a native library image in an implementation-\n dependent manner.\n \n First, if there is a security manager, its checkLink\n method is called with the libname as its argument.\n This may result in a security exception.\n \n The method System.loadLibrary(String) is the conventional\n and convenient means of invoking this method. If native\n methods are to be used in the implementation of a class, a standard\n strategy is to put the native code in a library file (call it\n LibFile) and then to put a static initializer:\n \n static { System.loadLibrary(\"LibFile\"); }\n \n within the class declaration. When the class is loaded and\n initialized, the necessary native code implementation for the native\n methods will then be loaded as well.\n \n If this method is called more than once with the same library\n name, the second and subsequent calls are ignored."}, {"method_name": "version", "method_sig": "public static Runtime.Version version()", "description": "Returns the version of the Java Runtime Environment as a Runtime.Version."}]}