{"name": "Class SelectionKey", "module": "java.base", "package": "java.nio.channels", "text": "A token representing the registration of a SelectableChannel with a\n Selector.\n\n  A selection key is created each time a channel is registered with a\n selector.  A key remains valid until it is cancelled by invoking its\n cancel method, by closing its channel, or by closing its\n selector.  Cancelling a key does not immediately remove it from its\n selector; it is instead added to the selector's cancelled-key set for removal during the\n next selection operation.  The validity of a key may be tested by invoking\n its isValid method.\n\n \n A selection key contains two operation sets represented as\n integer values.  Each bit of an operation set denotes a category of\n selectable operations that are supported by the key's channel.\n\n \n The interest set determines which operation categories will\n   be tested for readiness the next time one of the selector's selection\n   methods is invoked.  The interest set is initialized with the value given\n   when the key is created; it may later be changed via the interestOps(int) method. \n The ready set identifies the operation categories for which\n   the key's channel has been detected to be ready by the key's selector.\n   The ready set is initialized to zero when the key is created; it may later\n   be updated by the selector during a selection operation, but it cannot be\n   updated directly. \n\n That a selection key's ready set indicates that its channel is ready for\n some operation category is a hint, but not a guarantee, that an operation in\n such a category may be performed by a thread without causing the thread to\n block.  A ready set is most likely to be accurate immediately after the\n completion of a selection operation.  It is likely to be made inaccurate by\n external events and by I/O operations that are invoked upon the\n corresponding channel.\n\n  This class defines all known operation-set bits, but precisely which\n bits are supported by a given channel depends upon the type of the channel.\n Each subclass of SelectableChannel defines an validOps() method which returns a set\n identifying just those operations that are supported by the channel.  An\n attempt to set or test an operation-set bit that is not supported by a key's\n channel will result in an appropriate run-time exception.\n\n  It is often necessary to associate some application-specific data with a\n selection key, for example an object that represents the state of a\n higher-level protocol and handles readiness notifications in order to\n implement that protocol.  Selection keys therefore support the\n attachment of a single arbitrary object to a key.  An object can be\n attached via the attach method and then later retrieved via\n the attachment method.\n\n  Selection keys are safe for use by multiple concurrent threads.  A\n selection operation will always use the interest-set value that was current\n at the moment that the operation began.  ", "codes": ["public abstract class SelectionKey\nextends Object"], "fields": [{"field_name": "OP_READ", "field_sig": "public static final int OP_READ", "description": "Operation-set bit for read operations.\n\n  Suppose that a selection key's interest set contains\n OP_READ at the start of a selection operation.  If the selector\n detects that the corresponding channel is ready for reading, has reached\n end-of-stream, has been remotely shut down for further reading, or has\n an error pending, then it will add OP_READ to the key's\n ready-operation set.  "}, {"field_name": "OP_WRITE", "field_sig": "public static final int OP_WRITE", "description": "Operation-set bit for write operations.\n\n  Suppose that a selection key's interest set contains\n OP_WRITE at the start of a selection operation.  If the selector\n detects that the corresponding channel is ready for writing, has been\n remotely shut down for further writing, or has an error pending, then it\n will add OP_WRITE to the key's ready set.  "}, {"field_name": "OP_CONNECT", "field_sig": "public static final int OP_CONNECT", "description": "Operation-set bit for socket-connect operations.\n\n  Suppose that a selection key's interest set contains\n OP_CONNECT at the start of a selection operation.  If the selector\n detects that the corresponding socket channel is ready to complete its\n connection sequence, or has an error pending, then it will add\n OP_CONNECT to the key's ready set.  "}, {"field_name": "OP_ACCEPT", "field_sig": "public static final int OP_ACCEPT", "description": "Operation-set bit for socket-accept operations.\n\n  Suppose that a selection key's interest set contains\n OP_ACCEPT at the start of a selection operation.  If the selector\n detects that the corresponding server-socket channel is ready to accept\n another connection, or has an error pending, then it will add\n OP_ACCEPT to the key's ready set.  "}], "methods": [{"method_name": "channel", "method_sig": "public abstract SelectableChannel channel()", "description": "Returns the channel for which this key was created.  This method will\n continue to return the channel even after the key is cancelled."}, {"method_name": "selector", "method_sig": "public abstract Selector selector()", "description": "Returns the selector for which this key was created.  This method will\n continue to return the selector even after the key is cancelled."}, {"method_name": "isValid", "method_sig": "public abstract boolean isValid()", "description": "Tells whether or not this key is valid.\n\n  A key is valid upon creation and remains so until it is cancelled,\n its channel is closed, or its selector is closed.  "}, {"method_name": "cancel", "method_sig": "public abstract void cancel()", "description": "Requests that the registration of this key's channel with its selector\n be cancelled.  Upon return the key will be invalid and will have been\n added to its selector's cancelled-key set.  The key will be removed from\n all of the selector's key sets during the next selection operation.\n\n  If this key has already been cancelled then invoking this method has\n no effect.  Once cancelled, a key remains forever invalid. \n This method may be invoked at any time.  It synchronizes on the\n selector's cancelled-key set, and therefore may block briefly if invoked\n concurrently with a cancellation or selection operation involving the\n same selector.  "}, {"method_name": "interestOps", "method_sig": "public abstract int interestOps()", "description": "Retrieves this key's interest set.\n\n  It is guaranteed that the returned set will only contain operation\n bits that are valid for this key's channel. "}, {"method_name": "interestOps", "method_sig": "public abstract SelectionKey interestOps (int ops)", "description": "Sets this key's interest set to the given value.\n\n  This method may be invoked at any time.  If this method is invoked\n while a selection operation is in progress then it has no effect upon\n that operation; the change to the key's interest set will be seen by the\n next selection operation."}, {"method_name": "interestOpsOr", "method_sig": "public int interestOpsOr (int ops)", "description": "Atomically sets this key's interest set to the bitwise union (\"or\") of\n the existing interest set and the given value. This method is guaranteed\n to be atomic with respect to other concurrent calls to this method or to\n interestOpsAnd(int).\n\n  This method may be invoked at any time.  If this method is invoked\n while a selection operation is in progress then it has no effect upon\n that operation; the change to the key's interest set will be seen by the\n next selection operation."}, {"method_name": "interestOpsAnd", "method_sig": "public int interestOpsAnd (int ops)", "description": "Atomically sets this key's interest set to the bitwise intersection (\"and\")\n of the existing interest set and the given value. This method is guaranteed\n to be atomic with respect to other concurrent calls to this method or to\n interestOpsOr(int).\n\n  This method may be invoked at any time.  If this method is invoked\n while a selection operation is in progress then it has no effect upon\n that operation; the change to the key's interest set will be seen by the\n next selection operation."}, {"method_name": "readyOps", "method_sig": "public abstract int readyOps()", "description": "Retrieves this key's ready-operation set.\n\n  It is guaranteed that the returned set will only contain operation\n bits that are valid for this key's channel.  "}, {"method_name": "isReadable", "method_sig": "public final boolean isReadable()", "description": "Tests whether this key's channel is ready for reading.\n\n  An invocation of this method of the form k.isReadable()\n behaves in exactly the same way as the expression\n\n \n k.readyOps() & OP_READ != 0\n \n If this key's channel does not support read operations then this\n method always returns false.  "}, {"method_name": "isWritable", "method_sig": "public final boolean isWritable()", "description": "Tests whether this key's channel is ready for writing.\n\n  An invocation of this method of the form k.isWritable()\n behaves in exactly the same way as the expression\n\n \n k.readyOps() & OP_WRITE != 0\n \n If this key's channel does not support write operations then this\n method always returns false.  "}, {"method_name": "isConnectable", "method_sig": "public final boolean isConnectable()", "description": "Tests whether this key's channel has either finished, or failed to\n finish, its socket-connection operation.\n\n  An invocation of this method of the form k.isConnectable()\n behaves in exactly the same way as the expression\n\n \n k.readyOps() & OP_CONNECT != 0\n \n If this key's channel does not support socket-connect operations\n then this method always returns false.  "}, {"method_name": "isAcceptable", "method_sig": "public final boolean isAcceptable()", "description": "Tests whether this key's channel is ready to accept a new socket\n connection.\n\n  An invocation of this method of the form k.isAcceptable()\n behaves in exactly the same way as the expression\n\n \n k.readyOps() & OP_ACCEPT != 0\n \n If this key's channel does not support socket-accept operations then\n this method always returns false.  "}, {"method_name": "attach", "method_sig": "public final Object attach (Object ob)", "description": "Attaches the given object to this key.\n\n  An attached object may later be retrieved via the attachment method.  Only one object may be attached at a time; invoking\n this method causes any previous attachment to be discarded.  The current\n attachment may be discarded by attaching null.  "}, {"method_name": "attachment", "method_sig": "public final Object attachment()", "description": "Retrieves the current attachment."}]}