{"name": "Class SelectableChannel", "module": "java.base", "package": "java.nio.channels", "text": "A channel that can be multiplexed via a Selector.\n\n  In order to be used with a selector, an instance of this class must\n first be registered via the register method.  This method returns a new SelectionKey object\n that represents the channel's registration with the selector.\n\n  Once registered with a selector, a channel remains registered until it\n is deregistered.  This involves deallocating whatever resources were\n allocated to the channel by the selector.\n\n  A channel cannot be deregistered directly; instead, the key representing\n its registration must be cancelled.  Cancelling a key requests that\n the channel be deregistered during the selector's next selection operation.\n A key may be cancelled explicitly by invoking its cancel method.  All of a channel's keys are cancelled\n implicitly when the channel is closed, whether by invoking its close method or by interrupting a thread blocked in an I/O\n operation upon the channel.\n\n  If the selector itself is closed then the channel will be deregistered,\n and the key representing its registration will be invalidated, without\n further delay.\n\n  A channel may be registered at most once with any particular selector.\n\n  Whether or not a channel is registered with one or more selectors may be\n determined by invoking the isRegistered method.\n\n  Selectable channels are safe for use by multiple concurrent\n threads. \n\nBlocking mode\n\n A selectable channel is either in blocking mode or in\n non-blocking mode.  In blocking mode, every I/O operation invoked\n upon the channel will block until it completes.  In non-blocking mode an I/O\n operation will never block and may transfer fewer bytes than were requested\n or possibly no bytes at all.  The blocking mode of a selectable channel may\n be determined by invoking its isBlocking method.\n\n  Newly-created selectable channels are always in blocking mode.\n Non-blocking mode is most useful in conjunction with selector-based\n multiplexing.  A channel must be placed into non-blocking mode before being\n registered with a selector, and may not be returned to blocking mode until\n it has been deregistered.", "codes": ["public abstract class SelectableChannel\nextends AbstractInterruptibleChannel\nimplements Channel"], "fields": [], "methods": [{"method_name": "provider", "method_sig": "public abstract SelectorProvider provider()", "description": "Returns the provider that created this channel."}, {"method_name": "validOps", "method_sig": "public abstract int validOps()", "description": "Returns an operation set\n identifying this channel's supported operations.  The bits that are set\n in this integer value denote exactly the operations that are valid for\n this channel.  This method always returns the same value for a given\n concrete channel class."}, {"method_name": "isRegistered", "method_sig": "public abstract boolean isRegistered()", "description": "Tells whether or not this channel is currently registered with any\n selectors.  A newly-created channel is not registered.\n\n  Due to the inherent delay between key cancellation and channel\n deregistration, a channel may remain registered for some time after all\n of its keys have been cancelled.  A channel may also remain registered\n for some time after it is closed.  "}, {"method_name": "keyFor", "method_sig": "public abstract SelectionKey keyFor (Selector sel)", "description": "Retrieves the key representing the channel's registration with the given\n selector."}, {"method_name": "register", "method_sig": "public abstract SelectionKey register (Selector sel,\n                                      int ops,\n                                      Object att)\n                               throws ClosedChannelException", "description": "Registers this channel with the given selector, returning a selection\n key.\n\n  If this channel is currently registered with the given selector then\n the selection key representing that registration is returned.  The key's\n interest set will have been changed to ops, as if by invoking\n the interestOps(int) method.  If\n the att argument is not null then the key's attachment\n will have been set to that value.  A CancelledKeyException will\n be thrown if the key has already been cancelled.\n\n  Otherwise this channel has not yet been registered with the given\n selector, so it is registered and the resulting new key is returned.\n The key's initial interest set will be ops and its attachment\n will be att.\n\n  This method may be invoked at any time.  If this method is invoked\n while a selection operation is in progress then it has no effect upon\n that operation; the new registration or change to the key's interest set\n will be seen by the next selection operation.  If this method is invoked\n while an invocation of configureBlocking\n is in progress then it will block until the channel's blocking mode has\n been adjusted.\n\n  If this channel is closed while this operation is in progress then\n the key returned by this method will have been cancelled and will\n therefore be invalid. "}, {"method_name": "register", "method_sig": "public final SelectionKey register (Selector sel,\n                                   int ops)\n                            throws ClosedChannelException", "description": "Registers this channel with the given selector, returning a selection\n key.\n\n  An invocation of this convenience method of the form\n\n sc.register(sel, ops)\n\n behaves in exactly the same way as the invocation\n\n sc.register(sel, ops, null)"}, {"method_name": "configureBlocking", "method_sig": "public abstract SelectableChannel configureBlocking (boolean block)\n                                             throws IOException", "description": "Adjusts this channel's blocking mode.\n\n  If this channel is registered with one or more selectors then an\n attempt to place it into blocking mode will cause an IllegalBlockingModeException to be thrown.\n\n  This method may be invoked at any time.  The new blocking mode will\n only affect I/O operations that are initiated after this method returns.\n For some implementations this may require blocking until all pending I/O\n operations are complete.\n\n  If this method is invoked while another invocation of this method or\n of the register method is in progress\n then it will first block until the other operation is complete. "}, {"method_name": "isBlocking", "method_sig": "public abstract boolean isBlocking()", "description": "Tells whether or not every I/O operation on this channel will block\n until it completes.  A newly-created channel is always in blocking mode.\n\n  If this channel is closed then the value returned by this method is\n not specified. "}, {"method_name": "blockingLock", "method_sig": "public abstract Object blockingLock()", "description": "Retrieves the object upon which the configureBlocking and register methods synchronize.\n This is often useful in the implementation of adaptors that require a\n specific blocking mode to be maintained for a short period of time."}]}