{"name": "Class Sequencer.SyncMode", "module": "java.desktop", "package": "javax.sound.midi", "text": "A SyncMode object represents one of the ways in which a MIDI\n sequencer's notion of time can be synchronized with a master or slave\n device. If the sequencer is being synchronized to a master, the sequencer\n revises its current time in response to messages from the master. If the\n sequencer has a slave, the sequencer similarly sends messages to control\n the slave's timing.\n \n There are three predefined modes that specify possible masters for a\n sequencer: INTERNAL_CLOCK, MIDI_SYNC, and\n MIDI_TIME_CODE. The latter two work if the sequencer receives\n MIDI messages from another device. In these two modes, the sequencer's\n time gets reset based on system real-time timing clock messages or MIDI\n time code (MTC) messages, respectively. These two modes can also be used\n as slave modes, in which case the sequencer sends the corresponding types\n of MIDI messages to its receiver (whether or not the sequencer is also\n receiving them from a master). A fourth mode, NO_SYNC, is used to\n indicate that the sequencer should not control its receiver's timing.", "codes": ["public static class Sequencer.SyncMode\nextends Object"], "fields": [{"field_name": "INTERNAL_CLOCK", "field_sig": "public static final Sequencer.SyncMode INTERNAL_CLOCK", "description": "A master synchronization mode that makes the sequencer get its timing\n information from its internal clock. This is not a legal slave sync\n mode."}, {"field_name": "MIDI_SYNC", "field_sig": "public static final Sequencer.SyncMode MIDI_SYNC", "description": "A master or slave synchronization mode that specifies the use of MIDI\n clock messages. If this mode is used as the master sync mode, the\n sequencer gets its timing information from system real-time MIDI\n clock messages. This mode only applies as the master sync mode for\n sequencers that are also MIDI receivers. If this is the slave sync\n mode, the sequencer sends system real-time MIDI clock messages to its\n receiver. MIDI clock messages are sent at a rate of 24 per quarter\n note."}, {"field_name": "MIDI_TIME_CODE", "field_sig": "public static final Sequencer.SyncMode MIDI_TIME_CODE", "description": "A master or slave synchronization mode that specifies the use of MIDI\n Time Code. If this mode is used as the master sync mode, the\n sequencer gets its timing information from MIDI Time Code messages.\n This mode only applies as the master sync mode to sequencers that are\n also MIDI receivers. If this mode is used as the slave sync mode, the\n sequencer sends MIDI Time Code messages to its receiver. (See the\n MIDI 1.0 Detailed Specification for a description of MIDI Time Code.)"}, {"field_name": "NO_SYNC", "field_sig": "public static final Sequencer.SyncMode NO_SYNC", "description": "A slave synchronization mode indicating that no timing information\n should be sent to the receiver. This is not a legal master sync mode."}], "methods": [{"method_name": "equals", "method_sig": "public final boolean equals (Object obj)", "description": "Indicates whether the specified object is equal to this\n synchronization mode, returning true if the objects are the\n same."}, {"method_name": "hashCode", "method_sig": "public final int hashCode()", "description": "Returns a hash code value for this synchronization mode."}, {"method_name": "toString", "method_sig": "public final String toString()", "description": "Provides this synchronization mode's name as the string\n representation of the mode."}]}