{"name": "Class SequenceInputStream", "module": "java.base", "package": "java.io", "text": "A SequenceInputStream represents\n the logical concatenation of other input\n streams. It starts out with an ordered\n collection of input streams and reads from\n the first one until end of file is reached,\n whereupon it reads from the second one,\n and so on, until end of file is reached\n on the last of the contained input streams.", "codes": ["public class SequenceInputStream\nextends InputStream"], "fields": [], "methods": [{"method_name": "available", "method_sig": "public int available()\n              throws IOException", "description": "Returns an estimate of the number of bytes that can be read (or\n skipped over) from the current underlying input stream without\n blocking by the next invocation of a method for the current\n underlying input stream. The next invocation might be\n the same thread or another thread.  A single read or skip of this\n many bytes will not block, but may read or skip fewer bytes.\n \n This method simply calls available of the current underlying\n input stream and returns the result."}, {"method_name": "read", "method_sig": "public int read()\n         throws IOException", "description": "Reads the next byte of data from this input stream. The byte is\n returned as an int in the range 0 to\n 255. If no byte is available because the end of the\n stream has been reached, the value -1 is returned.\n This method blocks until input data is available, the end of the\n stream is detected, or an exception is thrown.\n \n This method\n tries to read one character from the current substream. If it\n reaches the end of the stream, it calls the close\n method of the current substream and begins reading from the next\n substream."}, {"method_name": "read", "method_sig": "public int read (byte[] b,\n                int off,\n                int len)\n         throws IOException", "description": "Reads up to len bytes of data from this input stream\n into an array of bytes.  If len is not zero, the method\n blocks until at least 1 byte of input is available; otherwise, no\n bytes are read and 0 is returned.\n \n The read method of SequenceInputStream\n tries to read the data from the current substream. If it fails to\n read any characters because the substream has reached the end of\n the stream, it calls the close method of the current\n substream and begins reading from the next substream."}, {"method_name": "close", "method_sig": "public void close()\n           throws IOException", "description": "Closes this input stream and releases any system resources\n associated with the stream.\n A closed SequenceInputStream\n cannot  perform input operations and cannot\n be reopened.\n \n If this stream was created\n from an enumeration, all remaining elements\n are requested from the enumeration and closed\n before the close method returns."}]}