{"name": "Class SerialStruct", "module": "java.sql.rowset", "package": "javax.sql.rowset.serial", "text": "A serialized mapping in the Java programming language of an SQL\n structured type. Each attribute that is not already serialized\n is mapped to a serialized form, and if an attribute is itself\n a structured type, each of its attributes that is not already\n serialized is mapped to a serialized form.\n \n In addition, the structured type is custom mapped to a class in the\n Java programming language if there is such a mapping, as are\n its attributes, if appropriate.\n \n The SerialStruct class provides a constructor for creating\n an instance from a Struct object, a method for retrieving\n the SQL type name of the SQL structured type in the database, and methods\n for retrieving its attribute values.\n\n  Thread safety \n\n A SerialStruct is not safe for use by multiple concurrent threads.  If a\n SerialStruct is to be used by more than one thread then access to the\n SerialStruct should be controlled by appropriate synchronization.", "codes": ["public class SerialStruct\nextends Object\nimplements Struct, Serializable, Cloneable"], "fields": [], "methods": [{"method_name": "getSQLTypeName", "method_sig": "public String getSQLTypeName()\n                      throws SerialException", "description": "Retrieves the SQL type name for this SerialStruct\n object. This is the name used in the SQL definition of the\n structured type"}, {"method_name": "getAttributes", "method_sig": "public Object[] getAttributes()\n                       throws SerialException", "description": "Retrieves an array of Object values containing the\n attributes of the SQL structured type that this\n SerialStruct object represents."}, {"method_name": "getAttributes", "method_sig": "public Object[] getAttributes (Map<String, Class<?>> map)\n                       throws SerialException", "description": "Retrieves the attributes for the SQL structured type that\n this SerialStruct represents as an array of\n Object values, using the given type map for\n custom mapping if appropriate."}, {"method_name": "equals", "method_sig": "public boolean equals (Object obj)", "description": "Compares this SerialStruct to the specified object.  The result is\n true if and only if the argument is not null and is a\n SerialStruct object whose attributes are identical to this\n object's attributes"}, {"method_name": "hashCode", "method_sig": "public int hashCode()", "description": "Returns a hash code for this SerialStruct. The hash code for a\n SerialStruct object is computed using the hash codes\n of the attributes of the SerialStruct object and its\n SQLTypeName"}, {"method_name": "clone", "method_sig": "public Object clone()", "description": "Returns a clone of this SerialStruct. The copy will contain a\n reference to a clone of the underlying attribs array, not a reference\n to the original underlying attribs array of this SerialStruct object."}]}