{"name": "Class SerialJavaObject", "module": "java.sql.rowset", "package": "javax.sql.rowset.serial", "text": "A serializable mapping in the Java programming language of an SQL\n JAVA_OBJECT value. Assuming the Java object\n implements the Serializable interface, this class simply wraps the\n serialization process.\n \n If however, the serialization is not possible because\n the Java object is not immediately serializable, this class will\n attempt to serialize all non-static members to permit the object\n state to be serialized.\n Static or transient fields cannot be serialized; an attempt to serialize\n them will result in a SerialException object being thrown.\n\n  Thread safety \n\n A SerialJavaObject is not safe for use by multiple concurrent threads.  If a\n SerialJavaObject is to be used by more than one thread then access to the\n SerialJavaObject should be controlled by appropriate synchronization.", "codes": ["public class SerialJavaObject\nextends Object\nimplements Serializable, Cloneable"], "fields": [], "methods": [{"method_name": "getObject", "method_sig": "public Object getObject()\n                 throws SerialException", "description": "Returns an Object that is a copy of this SerialJavaObject\n object."}, {"method_name": "getFields", "method_sig": "public Field[] getFields()\n                  throws SerialException", "description": "Returns an array of Field objects that contains each\n field of the object that this helper class is serializing."}, {"method_name": "equals", "method_sig": "public boolean equals (Object o)", "description": "Compares this SerialJavaObject to the specified object.\n The result is true if and only if the argument\n is not null and is a SerialJavaObject\n object that is identical to this object"}, {"method_name": "hashCode", "method_sig": "public int hashCode()", "description": "Returns a hash code for this SerialJavaObject. The hash code for a\n SerialJavaObject object is taken as the hash code of\n the Object it stores"}, {"method_name": "clone", "method_sig": "public Object clone()", "description": "Returns a clone of this SerialJavaObject."}]}