{"name": "Class ServiceUI", "module": "java.desktop", "package": "javax.print", "text": "This class is a collection of UI convenience methods which provide a\n graphical user dialog for browsing print services looked up through the Java\n Print Service API.\n \n The dialogs follow a standard pattern of acting as a continue/cancel option\n for a user as well as allowing the user to select the print service to use\n and specify choices such as paper size and number of copies.\n \n The dialogs are designed to work with pluggable print services though the\n public APIs of those print services.\n \n If a print service provides any vendor extensions these may be made\n accessible to the user through a vendor supplied tab panel Component.\n Such a vendor extension is encouraged to use Swing! and to support its\n accessibility APIs. The vendor extensions should return the settings as part\n of the AttributeSet. Applications which want to preserve the user\n settings should use those settings to specify the print job. Note that this\n class is not referenced by any other part of the Java Print Service and may\n not be included in profiles which cannot depend on the presence of the AWT\n packages.", "codes": ["public class ServiceUI\nextends Object"], "fields": [], "methods": [{"method_name": "printDialog", "method_sig": "public static PrintService printDialog (GraphicsConfiguration gc,\n                                       int x,\n                                       int y,\n                                       PrintService[] services,\n                                       PrintService defaultService,\n                                       DocFlavor flavor,\n                                       PrintRequestAttributeSet attributes)\n                                throws HeadlessException", "description": "Presents a dialog to the user for selecting a print service (printer). It\n is displayed at the location specified by the application and is modal.\n If the specification is invalid or would make the dialog not visible it\n will be displayed at a location determined by the implementation. The\n dialog blocks its calling thread and is application modal.\n \n The dialog may include a tab panel with custom UI lazily obtained from\n the PrintService's ServiceUIFactory when the\n PrintService is browsed. The dialog will attempt to locate a\n MAIN_UIROLE first as a JComponent, then as a\n Panel. If there is no ServiceUIFactory or no matching\n role the custom tab will be empty or not visible.\n \n The dialog returns the print service selected by the user if the user\n OK's the dialog and null if the user cancels the dialog.\n \n An application must pass in an array of print services to browse. The\n array must be non-null and non-empty. Typically an application\n will pass in only PrintServices capable of printing a particular\n document flavor.\n \n An application may pass in a PrintService to be initially\n displayed. A non-null parameter must be included in the array of\n browsable services. If this parameter is null a service is chosen\n by the implementation.\n \n An application may optionally pass in the flavor to be printed. If this\n is non-null choices presented to the user can be better validated\n against those supported by the services. An application must pass in a\n PrintRequestAttributeSet for returning user choices. On calling\n the PrintRequestAttributeSet may be empty, or may contain\n application-specified values.\n \n These are used to set the initial settings for the initially displayed\n print service. Values which are not supported by the print service are\n ignored. As the user browses print services, attributes and values are\n copied to the new display. If a user browses a print service which does\n not support a particular attribute-value, the default for that service is\n used as the new value to be copied.\n \n If the user cancels the dialog, the returned attributes will not reflect\n any changes made by the user.\n \n A typical basic usage of this method may be:\n \n PrintService[] services = PrintServiceLookup.lookupPrintServices(\n                            DocFlavor.INPUT_STREAM.JPEG, null);\n PrintRequestAttributeSet attributes = new HashPrintRequestAttributeSet();\n if (services.length > 0) {\n    PrintService service =  ServiceUI.printDialog(null, 50, 50,\n                                               services, services[0],\n                                               null,\n                                               attributes);\n    if (service != null) {\n     ... print ...\n    }\n }\n "}]}