{"name": "Interface Set<E>", "module": "java.base", "package": "java.util", "text": "A collection that contains no duplicate elements.  More formally, sets\n contain no pair of elements e1 and e2 such that\n e1.equals(e2), and at most one null element.  As implied by\n its name, this interface models the mathematical set abstraction.\n\n The Set interface places additional stipulations, beyond those\n inherited from the Collection interface, on the contracts of all\n constructors and on the contracts of the add, equals and\n hashCode methods.  Declarations for other inherited methods are\n also included here for convenience.  (The specifications accompanying these\n declarations have been tailored to the Set interface, but they do\n not contain any additional stipulations.)\n\n The additional stipulation on constructors is, not surprisingly,\n that all constructors must create a set that contains no duplicate elements\n (as defined above).\n\n Note: Great care must be exercised if mutable objects are used as set\n elements.  The behavior of a set is not specified if the value of an object\n is changed in a manner that affects equals comparisons while the\n object is an element in the set.  A special case of this prohibition is\n that it is not permissible for a set to contain itself as an element.\n\n Some set implementations have restrictions on the elements that\n they may contain.  For example, some implementations prohibit null elements,\n and some have restrictions on the types of their elements.  Attempting to\n add an ineligible element throws an unchecked exception, typically\n NullPointerException or ClassCastException.  Attempting\n to query the presence of an ineligible element may throw an exception,\n or it may simply return false; some implementations will exhibit the former\n behavior and some will exhibit the latter.  More generally, attempting an\n operation on an ineligible element whose completion would not result in\n the insertion of an ineligible element into the set may throw an\n exception or it may succeed, at the option of the implementation.\n Such exceptions are marked as \"optional\" in the specification for this\n interface.\n\n Unmodifiable Sets\nThe Set.of and\n Set.copyOf static factory methods\n provide a convenient way to create unmodifiable sets. The Set\n instances created by these methods have the following characteristics:\n\n \nThey are unmodifiable. Elements cannot\n be added or removed. Calling any mutator method on the Set\n will always cause UnsupportedOperationException to be thrown.\n However, if the contained elements are themselves mutable, this may cause the\n Set to behave inconsistently or its contents to appear to change.\n They disallow null elements. Attempts to create them with\n null elements result in NullPointerException.\n They are serializable if all elements are serializable.\n They reject duplicate elements at creation time. Duplicate elements\n passed to a static factory method result in IllegalArgumentException.\n The iteration order of set elements is unspecified and is subject to change.\n They are value-based.\n Callers should make no assumptions about the identity of the returned instances.\n Factories are free to create new instances or reuse existing ones. Therefore,\n identity-sensitive operations on these instances (reference equality (==),\n identity hash code, and synchronization) are unreliable and should be avoided.\n They are serialized as specified on the\n Serialized Form\n page.\n \nThis interface is a member of the\n \n Java Collections Framework.", "codes": ["public interface Set<E>\nextends Collection<E>"], "fields": [], "methods": [{"method_name": "size", "method_sig": "int size()", "description": "Returns the number of elements in this set (its cardinality).  If this\n set contains more than Integer.MAX_VALUE elements, returns\n Integer.MAX_VALUE."}, {"method_name": "isEmpty", "method_sig": "boolean isEmpty()", "description": "Returns true if this set contains no elements."}, {"method_name": "contains", "method_sig": "boolean contains (Object o)", "description": "Returns true if this set contains the specified element.\n More formally, returns true if and only if this set\n contains an element e such that\n Objects.equals(o, e)."}, {"method_name": "iterator", "method_sig": "Iterator<E> iterator()", "description": "Returns an iterator over the elements in this set.  The elements are\n returned in no particular order (unless this set is an instance of some\n class that provides a guarantee)."}, {"method_name": "toArray", "method_sig": "Object[] toArray()", "description": "Returns an array containing all of the elements in this set.\n If this set makes any guarantees as to what order its elements\n are returned by its iterator, this method must return the\n elements in the same order.\n\n The returned array will be \"safe\" in that no references to it\n are maintained by this set.  (In other words, this method must\n allocate a new array even if this set is backed by an array).\n The caller is thus free to modify the returned array.\n\n This method acts as bridge between array-based and collection-based\n APIs."}, {"method_name": "toArray", "method_sig": "<T> T[] toArray (T[] a)", "description": "Returns an array containing all of the elements in this set; the\n runtime type of the returned array is that of the specified array.\n If the set fits in the specified array, it is returned therein.\n Otherwise, a new array is allocated with the runtime type of the\n specified array and the size of this set.\n\n If this set fits in the specified array with room to spare\n (i.e., the array has more elements than this set), the element in\n the array immediately following the end of the set is set to\n null.  (This is useful in determining the length of this\n set only if the caller knows that this set does not contain\n any null elements.)\n\n If this set makes any guarantees as to what order its elements\n are returned by its iterator, this method must return the elements\n in the same order.\n\n Like the toArray() method, this method acts as bridge between\n array-based and collection-based APIs.  Further, this method allows\n precise control over the runtime type of the output array, and may,\n under certain circumstances, be used to save allocation costs.\n\n Suppose x is a set known to contain only strings.\n The following code can be used to dump the set into a newly allocated\n array of String:\n\n \n     String[] y = x.toArray(new String[0]);\n\n Note that toArray(new Object[0]) is identical in function to\n toArray()."}, {"method_name": "add", "method_sig": "boolean add (E e)", "description": "Adds the specified element to this set if it is not already present\n (optional operation).  More formally, adds the specified element\n e to this set if the set contains no element e2\n such that\n Objects.equals(e, e2).\n If this set already contains the element, the call leaves the set\n unchanged and returns false.  In combination with the\n restriction on constructors, this ensures that sets never contain\n duplicate elements.\n\n The stipulation above does not imply that sets must accept all\n elements; sets may refuse to add any particular element, including\n null, and throw an exception, as described in the\n specification for Collection.add.\n Individual set implementations should clearly document any\n restrictions on the elements that they may contain."}, {"method_name": "remove", "method_sig": "boolean remove (Object o)", "description": "Removes the specified element from this set if it is present\n (optional operation).  More formally, removes an element e\n such that\n Objects.equals(o, e), if\n this set contains such an element.  Returns true if this set\n contained the element (or equivalently, if this set changed as a\n result of the call).  (This set will not contain the element once the\n call returns.)"}, {"method_name": "containsAll", "method_sig": "boolean containsAll (Collection<?> c)", "description": "Returns true if this set contains all of the elements of the\n specified collection.  If the specified collection is also a set, this\n method returns true if it is a subset of this set."}, {"method_name": "addAll", "method_sig": "boolean addAll (Collection<? extends E> c)", "description": "Adds all of the elements in the specified collection to this set if\n they're not already present (optional operation).  If the specified\n collection is also a set, the addAll operation effectively\n modifies this set so that its value is the union of the two\n sets.  The behavior of this operation is undefined if the specified\n collection is modified while the operation is in progress."}, {"method_name": "retainAll", "method_sig": "boolean retainAll (Collection<?> c)", "description": "Retains only the elements in this set that are contained in the\n specified collection (optional operation).  In other words, removes\n from this set all of its elements that are not contained in the\n specified collection.  If the specified collection is also a set, this\n operation effectively modifies this set so that its value is the\n intersection of the two sets."}, {"method_name": "removeAll", "method_sig": "boolean removeAll (Collection<?> c)", "description": "Removes from this set all of its elements that are contained in the\n specified collection (optional operation).  If the specified\n collection is also a set, this operation effectively modifies this\n set so that its value is the asymmetric set difference of\n the two sets."}, {"method_name": "clear", "method_sig": "void clear()", "description": "Removes all of the elements from this set (optional operation).\n The set will be empty after this call returns."}, {"method_name": "equals", "method_sig": "boolean equals (Object o)", "description": "Compares the specified object with this set for equality.  Returns\n true if the specified object is also a set, the two sets\n have the same size, and every member of the specified set is\n contained in this set (or equivalently, every member of this set is\n contained in the specified set).  This definition ensures that the\n equals method works properly across different implementations of the\n set interface."}, {"method_name": "hashCode", "method_sig": "int hashCode()", "description": "Returns the hash code value for this set.  The hash code of a set is\n defined to be the sum of the hash codes of the elements in the set,\n where the hash code of a null element is defined to be zero.\n This ensures that s1.equals(s2) implies that\n s1.hashCode()==s2.hashCode() for any two sets s1\n and s2, as required by the general contract of\n Object.hashCode()."}, {"method_name": "spliterator", "method_sig": "default Spliterator<E> spliterator()", "description": "Creates a Spliterator over the elements in this set.\n\n The Spliterator reports Spliterator.DISTINCT.\n Implementations should document the reporting of additional\n characteristic values."}, {"method_name": "of", "method_sig": "static <E> Set<E> of()", "description": "Returns an unmodifiable set containing zero elements.\n See Unmodifiable Sets for details."}, {"method_name": "of", "method_sig": "static <E> Set<E> of (E e1)", "description": "Returns an unmodifiable set containing one element.\n See Unmodifiable Sets for details."}, {"method_name": "of", "method_sig": "static <E> Set<E> of (E e1,\n                     E e2)", "description": "Returns an unmodifiable set containing two elements.\n See Unmodifiable Sets for details."}, {"method_name": "of", "method_sig": "static <E> Set<E> of (E e1,\n                     E e2,\n                     E e3)", "description": "Returns an unmodifiable set containing three elements.\n See Unmodifiable Sets for details."}, {"method_name": "of", "method_sig": "static <E> Set<E> of (E e1,\n                     E e2,\n                     E e3,\n                     E e4)", "description": "Returns an unmodifiable set containing four elements.\n See Unmodifiable Sets for details."}, {"method_name": "of", "method_sig": "static <E> Set<E> of (E e1,\n                     E e2,\n                     E e3,\n                     E e4,\n                     E e5)", "description": "Returns an unmodifiable set containing five elements.\n See Unmodifiable Sets for details."}, {"method_name": "of", "method_sig": "static <E> Set<E> of (E e1,\n                     E e2,\n                     E e3,\n                     E e4,\n                     E e5,\n                     E e6)", "description": "Returns an unmodifiable set containing six elements.\n See Unmodifiable Sets for details."}, {"method_name": "of", "method_sig": "static <E> Set<E> of (E e1,\n                     E e2,\n                     E e3,\n                     E e4,\n                     E e5,\n                     E e6,\n                     E e7)", "description": "Returns an unmodifiable set containing seven elements.\n See Unmodifiable Sets for details."}, {"method_name": "of", "method_sig": "static <E> Set<E> of (E e1,\n                     E e2,\n                     E e3,\n                     E e4,\n                     E e5,\n                     E e6,\n                     E e7,\n                     E e8)", "description": "Returns an unmodifiable set containing eight elements.\n See Unmodifiable Sets for details."}, {"method_name": "of", "method_sig": "static <E> Set<E> of (E e1,\n                     E e2,\n                     E e3,\n                     E e4,\n                     E e5,\n                     E e6,\n                     E e7,\n                     E e8,\n                     E e9)", "description": "Returns an unmodifiable set containing nine elements.\n See Unmodifiable Sets for details."}, {"method_name": "of", "method_sig": "static <E> Set<E> of (E e1,\n                     E e2,\n                     E e3,\n                     E e4,\n                     E e5,\n                     E e6,\n                     E e7,\n                     E e8,\n                     E e9,\n                     E e10)", "description": "Returns an unmodifiable set containing ten elements.\n See Unmodifiable Sets for details."}, {"method_name": "of", "method_sig": "@SafeVarargs\nstatic <E> Set<E> of (E... elements)", "description": "Returns an unmodifiable set containing an arbitrary number of elements.\n See Unmodifiable Sets for details."}, {"method_name": "copyOf", "method_sig": "static <E> Set<E> copyOf (Collection<? extends E> coll)", "description": "Returns an unmodifiable Set containing the elements\n of the given Collection. The given Collection must not be null, and it must not\n contain any null elements. If the given Collection contains duplicate elements,\n an arbitrary element of the duplicates is preserved. If the given Collection is\n subsequently modified, the returned Set will not reflect such modifications."}]}