{"name": "Interface SortedSet<E>", "module": "java.base", "package": "java.util", "text": "A Set that further provides a total ordering on its elements.\n The elements are ordered using their natural\n ordering, or by a Comparator typically provided at sorted\n set creation time.  The set's iterator will traverse the set in\n ascending element order. Several additional operations are provided\n to take advantage of the ordering.  (This interface is the set\n analogue of SortedMap.)\n\n All elements inserted into a sorted set must implement the Comparable\n interface (or be accepted by the specified comparator).  Furthermore, all\n such elements must be mutually comparable: e1.compareTo(e2)\n (or comparator.compare(e1, e2)) must not throw a\n ClassCastException for any elements e1 and e2 in\n the sorted set.  Attempts to violate this restriction will cause the\n offending method or constructor invocation to throw a\n ClassCastException.\n\n Note that the ordering maintained by a sorted set (whether or not an\n explicit comparator is provided) must be consistent with equals if\n the sorted set is to correctly implement the Set interface.  (See\n the Comparable interface or Comparator interface for a\n precise definition of consistent with equals.)  This is so because\n the Set interface is defined in terms of the equals\n operation, but a sorted set performs all element comparisons using its\n compareTo (or compare) method, so two elements that are\n deemed equal by this method are, from the standpoint of the sorted set,\n equal.  The behavior of a sorted set is well-defined even if its\n ordering is inconsistent with equals; it just fails to obey the general\n contract of the Set interface.\n\n All general-purpose sorted set implementation classes should\n provide four \"standard\" constructors: 1) A void (no arguments)\n constructor, which creates an empty sorted set sorted according to\n the natural ordering of its elements.  2) A constructor with a\n single argument of type Comparator, which creates an empty\n sorted set sorted according to the specified comparator.  3) A\n constructor with a single argument of type Collection,\n which creates a new sorted set with the same elements as its\n argument, sorted according to the natural ordering of the elements.\n 4) A constructor with a single argument of type SortedSet,\n which creates a new sorted set with the same elements and the same\n ordering as the input sorted set.  There is no way to enforce this\n recommendation, as interfaces cannot contain constructors.\n\n Note: several methods return subsets with restricted ranges.\n Such ranges are half-open, that is, they include their low\n endpoint but not their high endpoint (where applicable).\n If you need a closed range (which includes both endpoints), and\n the element type allows for calculation of the successor of a given\n value, merely request the subrange from lowEndpoint to\n successor(highEndpoint).  For example, suppose that s\n is a sorted set of strings.  The following idiom obtains a view\n containing all of the strings in s from low to\n high, inclusive:\n   SortedSet<String> sub = s.subSet(low, high+\"\\0\");\n\n A similar technique can be used to generate an open range (which\n contains neither endpoint).  The following idiom obtains a view\n containing all of the Strings in s from low to\n high, exclusive:\n   SortedSet<String> sub = s.subSet(low+\"\\0\", high);\nThis interface is a member of the\n \n Java Collections Framework.", "codes": ["public interface SortedSet<E>\nextends Set<E>"], "fields": [], "methods": [{"method_name": "comparator", "method_sig": "Comparator<? super E> comparator()", "description": "Returns the comparator used to order the elements in this set,\n or null if this set uses the natural ordering of its elements."}, {"method_name": "subSet", "method_sig": "SortedSet<E> subSet (E fromElement,\n                    E toElement)", "description": "Returns a view of the portion of this set whose elements range\n from fromElement, inclusive, to toElement,\n exclusive.  (If fromElement and toElement are\n equal, the returned set is empty.)  The returned set is backed\n by this set, so changes in the returned set are reflected in\n this set, and vice-versa.  The returned set supports all\n optional set operations that this set supports.\n\n The returned set will throw an IllegalArgumentException\n on an attempt to insert an element outside its range."}, {"method_name": "headSet", "method_sig": "SortedSet<E> headSet (E toElement)", "description": "Returns a view of the portion of this set whose elements are\n strictly less than toElement.  The returned set is\n backed by this set, so changes in the returned set are\n reflected in this set, and vice-versa.  The returned set\n supports all optional set operations that this set supports.\n\n The returned set will throw an IllegalArgumentException\n on an attempt to insert an element outside its range."}, {"method_name": "tailSet", "method_sig": "SortedSet<E> tailSet (E fromElement)", "description": "Returns a view of the portion of this set whose elements are\n greater than or equal to fromElement.  The returned\n set is backed by this set, so changes in the returned set are\n reflected in this set, and vice-versa.  The returned set\n supports all optional set operations that this set supports.\n\n The returned set will throw an IllegalArgumentException\n on an attempt to insert an element outside its range."}, {"method_name": "first", "method_sig": "E first()", "description": "Returns the first (lowest) element currently in this set."}, {"method_name": "last", "method_sig": "E last()", "description": "Returns the last (highest) element currently in this set."}, {"method_name": "spliterator", "method_sig": "default Spliterator<E> spliterator()", "description": "Creates a Spliterator over the elements in this sorted set.\n\n The Spliterator reports Spliterator.DISTINCT,\n Spliterator.SORTED and Spliterator.ORDERED.\n Implementations should document the reporting of additional\n characteristic values.\n\n The spliterator's comparator (see\n Spliterator.getComparator()) must be null if\n the sorted set's comparator (see comparator()) is null.\n Otherwise, the spliterator's comparator must be the same as or impose the\n same total ordering as the sorted set's comparator."}]}