{"name": "Class SoundbankResource", "module": "java.desktop", "package": "javax.sound.midi", "text": "A SoundbankResource represents any audio resource stored in a\n Soundbank. Common soundbank resources include:\n \nInstruments. An instrument may be specified in a variety of ways.\n   However, all soundbanks have some mechanism for defining instruments. In\n   doing so, they may reference other resources stored in the soundbank.\n   Each instrument has a Patch which specifies the MIDI program and\n   bank by which it may be referenced in MIDI messages. Instrument information\n   may be stored in Instrument objects.\n   Audio samples. A sample typically is a sampled audio waveform which\n   contains a short sound recording whose duration is a fraction of a\n   second, or at most a few seconds. These audio samples may be used by a\n   Synthesizer to synthesize sound in response to MIDI commands, or\n   extracted for use by an application. (The terminology reflects musicians'\n   use of the word \"sample\" to refer collectively to a series of contiguous\n   audio samples or frames, rather than to a single, instantaneous sample.)\n   The data class for an audio sample will be an object that encapsulates\n   the audio sample data itself and information about how to interpret it\n   (the format of the audio data), such as an AudioInputStream.\n   Embedded sequences. A sound bank may contain built-in song data stored\n   in a data object such as a Sequence.\n \n Synthesizers that use wavetable synthesis or related techniques play back the\n audio in a sample when synthesizing notes, often when emulating the\n real-world instrument that was originally recorded. However, there is not\n necessarily a one-to-one correspondence between the Instruments and\n samples in a Soundbank. A single Instrument can use multiple\n SoundbankResources (typically for notes of dissimilar pitch or brightness).\n Also, more than one Instrument can use the same sample.", "codes": ["public abstract class SoundbankResource\nextends Object"], "fields": [], "methods": [{"method_name": "getSoundbank", "method_sig": "public Soundbank getSoundbank()", "description": "Obtains the sound bank that contains this SoundbankResource."}, {"method_name": "getName", "method_sig": "public String getName()", "description": "Obtains the name of the resource. This should generally be a string\n descriptive of the resource."}, {"method_name": "getDataClass", "method_sig": "public Class<?> getDataClass()", "description": "Obtains the class used by this sample to represent its data. The object\n returned by getData will be of this class. If this\n SoundbankResource object does not support direct access to its\n data, returns null."}, {"method_name": "getData", "method_sig": "public abstract Object getData()", "description": "Obtains the sampled audio that is stored in this\n SoundbankResource. The type of object returned depends on the\n implementation of the concrete class, and may be queried using\n getDataClass."}]}