{"name": "Class SplashScreen", "module": "java.desktop", "package": "java.awt", "text": "The splash screen can be displayed at application startup, before the\n Java Virtual Machine (JVM) starts. The splash screen is displayed as an\n undecorated window containing an image. You can use GIF, JPEG, or PNG files\n for the image. Animation is supported for the GIF format, while transparency\n is supported both for GIF and PNG.  The window is positioned at the center\n of the screen. The position on multi-monitor systems is not specified. It is\n platform and implementation dependent.  The splash screen window is closed\n automatically as soon as the first window is displayed by Swing/AWT (may be\n also closed manually using the Java API, see below).\n \n If your application is packaged in a jar file, you can use the\n \"SplashScreen-Image\" option in a manifest file to show a splash screen.\n Place the image in the jar archive and specify the path in the option.\n The path should not have a leading slash.\n \n For example, in the manifest.mf file:\n \n Manifest-Version: 1.0\n Main-Class: Test\n SplashScreen-Image: filename.gif\n \n\n If the Java implementation provides the command-line interface and you run\n your application by using the command line or a shortcut, use the Java\n application launcher option to show a splash screen. The Oracle reference\n implementation allows you to specify the splash screen image location with\n the -splash: option.\n \n For example:\n \n java -splash:filename.gif Test\n \n HiDPI scaled image is also supported.\n Unscaled image name i.e. filename.gif should be passed in\n manifest.mf/-splash: option for all image types irrespective of\n HiDPI and Non-HiDPI.\n Following is the naming convention for scaled images.\n Screen scale 1.25: filename@125pct.gif\n Screen scale 1.50: filename@150pct.gif\n Screen scale 2:    filename@200pct.gif and filename@2x.gif both are supported\n Screen scale 2.50: filename@250pct.gif\n Screen scale 3:    filename@300pct.gif and filename@3x.gif both are supported\n The command line interface has higher precedence over the manifest\n setting.\n \n The splash screen will be displayed as faithfully as possible to present the\n whole splash screen image given the limitations of the target platform and\n display.\n \n It is implied that the specified image is presented on the screen \"as is\",\n i.e. preserving the exact color values as specified in the image file. Under\n certain circumstances, though, the presented image may differ, e.g. when\n applying color dithering to present a 32 bits per pixel (bpp) image on a 16\n or 8 bpp screen. The native platform display configuration may also affect\n the colors of the displayed image (e.g.  color profiles, etc.)\n \n The SplashScreen class provides the API for controlling the splash\n screen. This class may be used to close the splash screen, change the splash\n screen image, get the splash screen native window position/size, and paint\n in the splash screen. It cannot be used to create the splash screen. You\n should use the options provided by the Java implementation for that.\n \n This class cannot be instantiated. Only a single instance of this class\n can exist, and it may be obtained by using the getSplashScreen()\n static method. In case the splash screen has not been created at\n application startup via the command line or manifest file option,\n the getSplashScreen method returns null.", "codes": ["public final class SplashScreen\nextends Object"], "fields": [], "methods": [{"method_name": "getSplashScreen", "method_sig": "public static SplashScreen getSplashScreen()", "description": "Returns the SplashScreen object used for\n Java startup splash screen control on systems that support display."}, {"method_name": "setImageURL", "method_sig": "public void setImageURL (URL imageURL)\n                 throws NullPointerException,\n                        IOException,\n                        IllegalStateException", "description": "Changes the splash screen image. The new image is loaded from the\n specified URL; GIF, JPEG and PNG image formats are supported.\n The method returns after the image has finished loading and the window\n has been updated.\n The splash screen window is resized according to the size of\n the image and is centered on the screen."}, {"method_name": "getImageURL", "method_sig": "public URL getImageURL()\n                throws IllegalStateException", "description": "Returns the current splash screen image."}, {"method_name": "getBounds", "method_sig": "public Rectangle getBounds()\n                    throws IllegalStateException", "description": "Returns the bounds of the splash screen window as a Rectangle.\n This may be useful if, for example, you want to replace the splash\n screen with your window at the same location.\n \n You cannot control the size or position of the splash screen.\n The splash screen size is adjusted automatically when the image changes.\n \n The image may contain transparent areas, and thus the reported bounds may\n be larger than the visible splash screen image on the screen."}, {"method_name": "getSize", "method_sig": "public Dimension getSize()\n                  throws IllegalStateException", "description": "Returns the size of the splash screen window as a Dimension.\n This may be useful if, for example,\n you want to draw on the splash screen overlay surface.\n \n You cannot control the size or position of the splash screen.\n The splash screen size is adjusted automatically when the image changes.\n \n The image may contain transparent areas, and thus the reported size may\n be larger than the visible splash screen image on the screen."}, {"method_name": "createGraphics", "method_sig": "public Graphics2D createGraphics()\n                          throws IllegalStateException", "description": "Creates a graphics context (as a Graphics2D object) for the splash\n screen overlay image, which allows you to draw over the splash screen.\n Note that you do not draw on the main image but on the image that is\n displayed over the main image using alpha blending. Also note that drawing\n on the overlay image does not necessarily update the contents of splash\n screen window. You should call update() on the\n SplashScreen when you want the splash screen to be\n updated immediately.\n \n The pixel (0, 0) in the coordinate space of the graphics context\n corresponds to the origin of the splash screen native window bounds (see\n getBounds())."}, {"method_name": "update", "method_sig": "public void update()\n            throws IllegalStateException", "description": "Updates the splash window with current contents of the overlay image."}, {"method_name": "close", "method_sig": "public void close()\n           throws IllegalStateException", "description": "Hides the splash screen, closes the window, and releases all associated\n resources."}, {"method_name": "isVisible", "method_sig": "public boolean isVisible()", "description": "Determines whether the splash screen is visible. The splash screen may\n be hidden using close(), it is also hidden automatically when\n the first AWT/Swing window is made visible.\n \n Note that the native platform may delay presenting the splash screen\n native window on the screen. The return value of true for this\n method only guarantees that the conditions to hide the splash screen\n window have not occurred yet."}]}