{"name": "Interface StatementEventListener", "module": "java.sql", "package": "javax.sql", "text": "An object that registers to be notified of events that occur on PreparedStatements\n that are in the Statement pool.\n \n The JDBC 3.0 specification added the maxStatements\n ConnectionPooledDataSource property to provide a standard mechanism for\n enabling the pooling of PreparedStatements\n and to specify the size of the statement\n pool.  However, there was no way for a driver to notify an external\n statement pool when a PreparedStatement becomes invalid.  For some databases, a\n statement becomes invalid if a DDL operation is performed that affects the\n table.  For example an application may create a temporary table to do some work\n on the table and then destroy it.  It may later recreate the same table when\n it is needed again.  Some databases will invalidate any prepared statements\n that reference the temporary table when the table is dropped.\n \n Similar to the methods defined in the ConnectionEventListener interface,\n the driver will call the StatementEventListener.statementErrorOccurred\n method prior to throwing any exceptions when it detects a statement is invalid.\n The driver will also call the StatementEventListener.statementClosed\n method when a PreparedStatement is closed.\n \n Methods which allow a component to register a StatementEventListener with a\n PooledConnection have been added to the PooledConnection interface.", "codes": ["public interface StatementEventListener\nextends EventListener"], "fields": [], "methods": [{"method_name": "statementClosed", "method_sig": "void statementClosed (StatementEvent event)", "description": "The driver calls this method on all StatementEventListeners registered on the connection when it detects that a\n PreparedStatement is closed."}, {"method_name": "statementErrorOccurred", "method_sig": "void statementErrorOccurred (StatementEvent event)", "description": "The driver calls this method on all StatementEventListeners\n registered on the connection when it detects that a\n PreparedStatement is invalid. The driver calls this method\n just before it throws the SQLException,\n contained in the given event, to the application."}]}