{"name": "Class StreamPrintService", "module": "java.desktop", "package": "javax.print", "text": "This class extends PrintService and represents a print service that\n prints data in different formats to a client-provided output stream. This is\n principally intended for services where the output format is a document type\n suitable for viewing or archiving. The output format must be declared as a\n mime type. This is equivalent to an output document flavor where the\n representation class is always \"java.io.OutputStream\" An instance of the\n StreamPrintService class is obtained from a\n StreamPrintServiceFactory instance.\n \n Note that a StreamPrintService is different from a\n PrintService, which supports a\n Destination attribute. A\n StreamPrintService always requires an output stream, whereas a\n PrintService optionally accepts a Destination. A\n StreamPrintService has no default destination for its formatted\n output. Additionally a StreamPrintService is expected to generate\n output in a format useful in other contexts. StreamPrintService's are\n not expected to support the Destination attribute.", "codes": ["public abstract class StreamPrintService\nextends Object\nimplements PrintService"], "fields": [], "methods": [{"method_name": "getOutputStream", "method_sig": "public OutputStream getOutputStream()", "description": "Gets the output stream."}, {"method_name": "getOutputFormat", "method_sig": "public abstract String getOutputFormat()", "description": "Returns the document format emitted by this print service. Must be in\n mimetype format, compatible with the mime type components of\n DocFlavors"}, {"method_name": "dispose", "method_sig": "public void dispose()", "description": "Disposes this StreamPrintService. If a stream service cannot be\n re-used, it must be disposed to indicate this. Typically the client will\n call this method. Services which write data which cannot meaningfully be\n appended to may also dispose the stream. This does not close the stream.\n It just marks it as not for further use by this service."}, {"method_name": "isDisposed", "method_sig": "public boolean isDisposed()", "description": "Returns a boolean indicating whether or not this\n StreamPrintService has been disposed. If this object has been\n disposed, will return true. Used by services and client\n applications to recognize streams to which no further data should be\n written."}]}