{"name": "Class StringJoiner", "module": "java.base", "package": "java.util", "text": "StringJoiner is used to construct a sequence of characters separated\n by a delimiter and optionally starting with a supplied prefix\n and ending with a supplied suffix.\n \n Prior to adding something to the StringJoiner, its\n sj.toString() method will, by default, return prefix + suffix.\n However, if the setEmptyValue method is called, the emptyValue\n supplied will be returned instead. This can be used, for example, when\n creating a string using set notation to indicate an empty set, i.e.\n \"{}\", where the prefix is \"{\", the\n suffix is \"}\" and nothing has been added to the\n StringJoiner.", "codes": ["public final class StringJoiner\nextends Object"], "fields": [], "methods": [{"method_name": "setEmptyValue", "method_sig": "public StringJoiner setEmptyValue (CharSequence emptyValue)", "description": "Sets the sequence of characters to be used when determining the string\n representation of this StringJoiner and no elements have been\n added yet, that is, when it is empty.  A copy of the emptyValue\n parameter is made for this purpose. Note that once an add method has been\n called, the StringJoiner is no longer considered empty, even if\n the element(s) added correspond to the empty String."}, {"method_name": "toString", "method_sig": "public String toString()", "description": "Returns the current value, consisting of the prefix, the values\n added so far separated by the delimiter, and the suffix,\n unless no elements have been added in which case, the\n prefix + suffix or the emptyValue characters are returned."}, {"method_name": "add", "method_sig": "public StringJoiner add (CharSequence newElement)", "description": "Adds a copy of the given CharSequence value as the next\n element of the StringJoiner value. If newElement is\n null, then \"null\" is added."}, {"method_name": "merge", "method_sig": "public StringJoiner merge (StringJoiner other)", "description": "Adds the contents of the given StringJoiner without prefix and\n suffix as the next element if it is non-empty. If the given \n StringJoiner is empty, the call has no effect.\n\n A StringJoiner is empty if add()\n has never been called, and if merge() has never been called\n with a non-empty StringJoiner argument.\n\n If the other StringJoiner is using a different delimiter,\n then elements from the other StringJoiner are concatenated with\n that delimiter and the result is appended to this StringJoiner\n as a single element."}, {"method_name": "length", "method_sig": "public int length()", "description": "Returns the length of the String representation\n of this StringJoiner. Note that if\n no add methods have been called, then the length of the String\n representation (either prefix + suffix or emptyValue)\n will be returned. The value should be equivalent to\n toString().length()."}]}