{"name": "Class StyledEditorKit.StyledTextAction", "module": "java.desktop", "package": "javax.swing.text", "text": "An action that assumes it's being fired on a JEditorPane\n with a StyledEditorKit (or subclass) installed.  This has\n some convenience methods for causing character or paragraph\n level attribute changes.  The convenience methods will\n throw an IllegalArgumentException if the assumption of\n a StyledDocument, a JEditorPane, or a StyledEditorKit\n fail to be true.\n \n The component that gets acted upon by the action\n will be the source of the ActionEvent if the source\n can be narrowed to a JEditorPane type.  If the source\n can't be narrowed, the most recently focused text\n component is changed.  If neither of these are the\n case, the action cannot be performed.\n \nWarning:\n Serialized objects of this class will not be compatible with\n future Swing releases. The current serialization support is\n appropriate for short term storage or RMI between applications running\n the same version of Swing.  As of 1.4, support for long term storage\n of all JavaBeans™\n has been added to the java.beans package.\n Please see XMLEncoder.", "codes": ["public abstract static class StyledEditorKit.StyledTextAction\nextends TextAction"], "fields": [], "methods": [{"method_name": "getEditor", "method_sig": "protected final JEditorPane getEditor (ActionEvent e)", "description": "Gets the target editor for an action."}, {"method_name": "getStyledDocument", "method_sig": "protected final StyledDocument getStyledDocument (JEditorPane e)", "description": "Gets the document associated with an editor pane."}, {"method_name": "getStyledEditorKit", "method_sig": "protected final StyledEditorKit getStyledEditorKit (JEditorPane e)", "description": "Gets the editor kit associated with an editor pane."}, {"method_name": "setCharacterAttributes", "method_sig": "protected final void setCharacterAttributes (JEditorPane editor,\n                                            AttributeSet attr,\n                                            boolean replace)", "description": "Applies the given attributes to character\n content.  If there is a selection, the attributes\n are applied to the selection range.  If there\n is no selection, the attributes are applied to\n the input attribute set which defines the attributes\n for any new text that gets inserted."}, {"method_name": "setParagraphAttributes", "method_sig": "protected final void setParagraphAttributes (JEditorPane editor,\n                                            AttributeSet attr,\n                                            boolean replace)", "description": "Applies the given attributes to paragraphs.  If\n there is a selection, the attributes are applied\n to the paragraphs that intersect the selection.\n if there is no selection, the attributes are applied\n to the paragraph at the current caret position."}]}