{"name": "Class SwitchPoint", "module": "java.base", "package": "java.lang.invoke", "text": "\n A SwitchPoint is an object which can publish state transitions to other threads.\n A switch point is initially in the valid state, but may at any time be\n changed to the invalid state.  Invalidation cannot be reversed.\n A switch point can combine a guarded pair of method handles into a\n guarded delegator.\n The guarded delegator is a method handle which delegates to one of the old method handles.\n The state of the switch point determines which of the two gets the delegation.\n \n A single switch point may be used to control any number of method handles.\n (Indirectly, therefore, it can control any number of call sites.)\n This is done by using the single switch point as a factory for combining\n any number of guarded method handle pairs into guarded delegators.\n \n When a guarded delegator is created from a guarded pair, the pair\n is wrapped in a new method handle M,\n which is permanently associated with the switch point that created it.\n Each pair consists of a target T and a fallback F.\n While the switch point is valid, invocations to M are delegated to T.\n After it is invalidated, invocations are delegated to F.\n \n Invalidation is global and immediate, as if the switch point contained a\n volatile boolean variable consulted on every call to M.\n The invalidation is also permanent, which means the switch point\n can change state only once.\n The switch point will always delegate to F after being invalidated.\n At that point guardWithTest may ignore T and return F.\n \n Here is an example of a switch point in action:\n \n MethodHandle MH_strcat = MethodHandles.lookup()\n     .findVirtual(String.class, \"concat\", MethodType.methodType(String.class, String.class));\n SwitchPoint spt = new SwitchPoint();\n assert(!spt.hasBeenInvalidated());\n // the following steps may be repeated to re-use the same switch point:\n MethodHandle worker1 = MH_strcat;\n MethodHandle worker2 = MethodHandles.permuteArguments(MH_strcat, MH_strcat.type(), 1, 0);\n MethodHandle worker = spt.guardWithTest(worker1, worker2);\n assertEquals(\"method\", (String) worker.invokeExact(\"met\", \"hod\"));\n SwitchPoint.invalidateAll(new SwitchPoint[]{ spt });\n assert(spt.hasBeenInvalidated());\n assertEquals(\"hodmet\", (String) worker.invokeExact(\"met\", \"hod\"));\n \n\nDiscussion:\n Switch points are useful without subclassing.  They may also be subclassed.\n This may be useful in order to associate application-specific invalidation logic\n with the switch point.\n Notice that there is no permanent association between a switch point and\n the method handles it produces and consumes.\n The garbage collector may collect method handles produced or consumed\n by a switch point independently of the lifetime of the switch point itself.\n \nImplementation Note:\n A switch point behaves as if implemented on top of MutableCallSite,\n approximately as follows:\n \n public class SwitchPoint {\n     private static final MethodHandle\n         K_true  = MethodHandles.constant(boolean.class, true),\n         K_false = MethodHandles.constant(boolean.class, false);\n     private final MutableCallSite mcs;\n     private final MethodHandle mcsInvoker;\n     public SwitchPoint() {\n         this.mcs = new MutableCallSite(K_true);\n         this.mcsInvoker = mcs.dynamicInvoker();\n     }\n     public MethodHandle guardWithTest(\n             MethodHandle target, MethodHandle fallback) {\n         // Note:  mcsInvoker is of type ()boolean.\n         // Target and fallback may take any arguments, but must have the same type.\n         return MethodHandles.guardWithTest(this.mcsInvoker, target, fallback);\n     }\n     public static void invalidateAll(SwitchPoint[] spts) {\n         List<MutableCallSite> mcss = new ArrayList<>();\n         for (SwitchPoint spt : spts)  mcss.add(spt.mcs);\n         for (MutableCallSite mcs : mcss)  mcs.setTarget(K_false);\n         MutableCallSite.syncAll(mcss.toArray(new MutableCallSite[0]));\n     }\n }\n ", "codes": ["public class SwitchPoint\nextends Object"], "fields": [], "methods": [{"method_name": "hasBeenInvalidated", "method_sig": "public boolean hasBeenInvalidated()", "description": "Determines if this switch point has been invalidated yet.\n\n \nDiscussion:\n Because of the one-way nature of invalidation, once a switch point begins\n to return true for hasBeenInvalidated,\n it will always do so in the future.\n On the other hand, a valid switch point visible to other threads may\n be invalidated at any moment, due to a request by another thread.\n \n Since invalidation is a global and immediate operation,\n the execution of this query, on a valid switchpoint,\n must be internally sequenced with any\n other threads that could cause invalidation.\n This query may therefore be expensive.\n The recommended way to build a boolean-valued method handle\n which queries the invalidation state of a switch point s is\n to call s.guardWithTest on\n constant true and false method handles."}, {"method_name": "guardWithTest", "method_sig": "public MethodHandle guardWithTest (MethodHandle target,\n                                  MethodHandle fallback)", "description": "Returns a method handle which always delegates either to the target or the fallback.\n The method handle will delegate to the target exactly as long as the switch point is valid.\n After that, it will permanently delegate to the fallback.\n \n The target and fallback must be of exactly the same method type,\n and the resulting combined method handle will also be of this type."}, {"method_name": "invalidateAll", "method_sig": "public static void invalidateAll (SwitchPoint[] switchPoints)", "description": "Sets all of the given switch points into the invalid state.\n After this call executes, no thread will observe any of the\n switch points to be in a valid state.\n \n This operation is likely to be expensive and should be used sparingly.\n If possible, it should be buffered for batch processing on sets of switch points.\n \n If switchPoints contains a null element,\n a NullPointerException will be raised.\n In this case, some non-null elements in the array may be\n processed before the method returns abnormally.\n Which elements these are (if any) is implementation-dependent.\n\n \nDiscussion:\n For performance reasons, invalidateAll is not a virtual method\n on a single switch point, but rather applies to a set of switch points.\n Some implementations may incur a large fixed overhead cost\n for processing one or more invalidation operations,\n but a small incremental cost for each additional invalidation.\n In any case, this operation is likely to be costly, since\n other threads may have to be somehow interrupted\n in order to make them notice the updated switch point state.\n However, it may be observed that a single call to invalidate\n several switch points has the same formal effect as many calls,\n each on just one of the switch points.\n\n \nImplementation Note:\n Simple implementations of SwitchPoint may use\n a private MutableCallSite to publish the state of a switch point.\n In such an implementation, the invalidateAll method can\n simply change the call site's target, and issue one call to\n synchronize all the\n private call sites."}]}