{"name": "Class SystemFlavorMap", "module": "java.datatransfer", "package": "java.awt.datatransfer", "text": "The SystemFlavorMap is a configurable map between \"natives\" (Strings), which\n correspond to platform-specific data formats, and \"flavors\" (DataFlavors),\n which correspond to platform-independent MIME types. This mapping is used by\n the data transfer subsystem to transfer data between Java and native\n applications, and between Java applications in separate VMs.", "codes": ["public final class SystemFlavorMap\nextends Object\nimplements FlavorMap, FlavorTable"], "fields": [], "methods": [{"method_name": "getDefaultFlavorMap", "method_sig": "public static FlavorMap getDefaultFlavorMap()", "description": "Returns the default FlavorMap for this thread's ClassLoader."}, {"method_name": "getNativesForFlavor", "method_sig": "public List<String> getNativesForFlavor (DataFlavor flav)", "description": "Returns a List of String natives to which the specified\n DataFlavor can be translated by the data transfer subsystem. The\n List will be sorted from best native to worst. That is, the first\n native will best reflect data in the specified flavor to the underlying\n native platform.\n \n If the specified DataFlavor is previously unknown to the data\n transfer subsystem and the data transfer subsystem is unable to translate\n this DataFlavor to any existing native, then invoking this method\n will establish a mapping in both directions between the specified\n DataFlavor and an encoded version of its MIME type as its native."}, {"method_name": "getFlavorsForNative", "method_sig": "public List<DataFlavor> getFlavorsForNative (String nat)", "description": "Returns a List of DataFlavors to which the specified\n String native can be translated by the data transfer subsystem.\n The List will be sorted from best DataFlavor to worst.\n That is, the first DataFlavor will best reflect data in the\n specified native to a Java application.\n \n If the specified native is previously unknown to the data transfer\n subsystem, and that native has been properly encoded, then invoking this\n method will establish a mapping in both directions between the specified\n native and a DataFlavor whose MIME type is a decoded version of\n the native.\n \n If the specified native is not a properly encoded native and the mappings\n for this native have not been altered with setFlavorsForNative,\n then the contents of the List is platform dependent, but\n null cannot be returned."}, {"method_name": "getNativesForFlavors", "method_sig": "public Map<DataFlavor, String> getNativesForFlavors (DataFlavor[] flavors)", "description": "Returns a Map of the specified DataFlavors to their most\n preferred String native. Each native value will be the same as\n the first native in the List returned by getNativesForFlavor for\n the specified flavor.\n \n If a specified DataFlavor is previously unknown to the data\n transfer subsystem, then invoking this method will establish a mapping in\n both directions between the specified DataFlavor and an encoded\n version of its MIME type as its native."}, {"method_name": "getFlavorsForNatives", "method_sig": "public Map<String, DataFlavor> getFlavorsForNatives (String[] natives)", "description": "Returns a Map of the specified String natives to their\n most preferred DataFlavor. Each DataFlavor value will be\n the same as the first DataFlavor in the List returned by\n getFlavorsForNative for the specified native.\n \n If a specified native is previously unknown to the data transfer\n subsystem, and that native has been properly encoded, then invoking this\n method will establish a mapping in both directions between the specified\n native and a DataFlavor whose MIME type is a decoded version of\n the native."}, {"method_name": "addUnencodedNativeForFlavor", "method_sig": "public void addUnencodedNativeForFlavor (DataFlavor flav,\n                                        String nat)", "description": "Adds a mapping from the specified DataFlavor (and all\n DataFlavors equal to the specified DataFlavor) to the\n specified String native. Unlike getNativesForFlavor, the\n mapping will only be established in one direction, and the native will\n not be encoded. To establish a two-way mapping, call\n addFlavorForUnencodedNative as well. The new mapping will be of\n lower priority than any existing mapping. This method has no effect if a\n mapping from the specified or equal DataFlavor to the specified\n String native already exists."}, {"method_name": "setNativesForFlavor", "method_sig": "public void setNativesForFlavor (DataFlavor flav,\n                                String[] natives)", "description": "Discards the current mappings for the specified DataFlavor and\n all DataFlavors equal to the specified DataFlavor, and\n creates new mappings to the specified String natives. Unlike\n getNativesForFlavor, the mappings will only be established in one\n direction, and the natives will not be encoded. To establish two-way\n mappings, call setFlavorsForNative as well. The first native in\n the array will represent the highest priority mapping. Subsequent natives\n will represent mappings of decreasing priority.\n \n If the array contains several elements that reference equal\n String natives, this method will establish new mappings for the\n first of those elements and ignore the rest of them.\n \n It is recommended that client code not reset mappings established by the\n data transfer subsystem. This method should only be used for\n application-level mappings."}, {"method_name": "addFlavorForUnencodedNative", "method_sig": "public void addFlavorForUnencodedNative (String nat,\n                                        DataFlavor flav)", "description": "Adds a mapping from a single String native to a single\n DataFlavor. Unlike getFlavorsForNative, the mapping will\n only be established in one direction, and the native will not be encoded.\n To establish a two-way mapping, call addUnencodedNativeForFlavor\n as well. The new mapping will be of lower priority than any existing\n mapping. This method has no effect if a mapping from the specified\n String native to the specified or equal DataFlavor\n already exists."}, {"method_name": "setFlavorsForNative", "method_sig": "public void setFlavorsForNative (String nat,\n                                DataFlavor[] flavors)", "description": "Discards the current mappings for the specified String native,\n and creates new mappings to the specified DataFlavors. Unlike\n getFlavorsForNative, the mappings will only be established in one\n direction, and the natives need not be encoded. To establish two-way\n mappings, call setNativesForFlavor as well. The first\n DataFlavor in the array will represent the highest priority\n mapping. Subsequent DataFlavors will represent mappings of\n decreasing priority.\n \n If the array contains several elements that reference equal\n DataFlavors, this method will establish new mappings for the\n first of those elements and ignore the rest of them.\n \n It is recommended that client code not reset mappings established by the\n data transfer subsystem. This method should only be used for\n application-level mappings."}, {"method_name": "encodeJavaMIMEType", "method_sig": "public static String encodeJavaMIMEType (String mimeType)", "description": "Encodes a MIME type for use as a String native. The format of an\n encoded representation of a MIME type is implementation-dependent. The\n only restrictions are:\n \nThe encoded representation is null if and only if the MIME\n     type String is null\nThe encoded representations for two non-null MIME type\n     Strings are equal if and only if these Strings are\n     equal according to String.equals(Object)\n\n The reference implementation of this method returns the specified MIME\n type String prefixed with JAVA_DATAFLAVOR:."}, {"method_name": "encodeDataFlavor", "method_sig": "public static String encodeDataFlavor (DataFlavor flav)", "description": "Encodes a DataFlavor for use as a String native. The\n format of an encoded DataFlavor is implementation-dependent. The\n only restrictions are:\n \nThe encoded representation is null if and only if the\n     specified DataFlavor is null or its MIME type\n     String is null\nThe encoded representations for two non-null\nDataFlavors with non-null MIME type Strings\n     are equal if and only if the MIME type Strings of these\n     DataFlavors are equal according to\n     String.equals(Object)\n\n The reference implementation of this method returns the MIME type\n String of the specified DataFlavor prefixed with\n JAVA_DATAFLAVOR:."}, {"method_name": "isJavaMIMEType", "method_sig": "public static boolean isJavaMIMEType (String str)", "description": "Returns whether the specified String is an encoded Java MIME\n type."}, {"method_name": "decodeJavaMIMEType", "method_sig": "public static String decodeJavaMIMEType (String nat)", "description": "Decodes a String native for use as a Java MIME type."}, {"method_name": "decodeDataFlavor", "method_sig": "public static DataFlavor decodeDataFlavor (String nat)\n                                   throws ClassNotFoundException", "description": "Decodes a String native for use as a DataFlavor."}]}