{"name": "Class TabularType", "module": "java.management", "package": "javax.management.openmbean", "text": "The TabularType class is the  open type class\n whose instances describe the types of TabularData values.", "codes": ["public class TabularType\nextends OpenType<TabularData>"], "fields": [], "methods": [{"method_name": "getRowType", "method_sig": "public CompositeType getRowType()", "description": "Returns the type of the row elements of tabular data values\n described by this TabularType instance."}, {"method_name": "getIndexNames", "method_sig": "public List<String> getIndexNames()", "description": "Returns, in the same order as was given to this instance's\n constructor, an unmodifiable List of the names of the items the\n values of which are used to uniquely index each row element of\n tabular data values described by this TabularType\n instance."}, {"method_name": "isValue", "method_sig": "public boolean isValue (Object obj)", "description": "Tests whether obj is a value which could be\n described by this TabularType instance.\n\n If obj is null or is not an instance of\n javax.management.openmbean.TabularData,\n isValue returns false.\nIf obj is an instance of\n javax.management.openmbean.TabularData, say \n td, the result is true if this TabularType is\n assignable from td.getTabularType(), as defined in CompositeType.isValue."}, {"method_name": "equals", "method_sig": "public boolean equals (Object obj)", "description": "Compares the specified obj parameter with this TabularType instance for equality.\n \n Two TabularType instances are equal if and only if all of the following statements are true:\n \ntheir type names are equal\ntheir row types are equal\nthey use the same index names, in the same order\n\n "}, {"method_name": "hashCode", "method_sig": "public int hashCode()", "description": "Returns the hash code value for this TabularType instance.\n \n The hash code of a TabularType instance is the sum of the hash codes\n of all elements of information used in equals comparisons\n (ie: name, row type, index names).\n This ensures that  t1.equals(t2)  implies that  t1.hashCode()==t2.hashCode() \n for any two TabularType instances t1 and t2,\n as required by the general contract of the method\n Object.hashCode().\n \n As TabularType instances are immutable, the hash code for this instance is calculated once,\n on the first call to hashCode, and then the same value is returned for subsequent calls."}, {"method_name": "toString", "method_sig": "public String toString()", "description": "Returns a string representation of this TabularType instance.\n \n The string representation consists of the name of this class (ie javax.management.openmbean.TabularType),\n the type name for this instance, the row type string representation of this instance,\n and the index names of this instance.\n \n As TabularType instances are immutable, the string representation for this instance is calculated once,\n on the first call to toString, and then the same value is returned for subsequent calls."}]}