{"name": "Interface TemporalAccessor", "module": "java.base", "package": "java.time.temporal", "text": "Framework-level interface defining read-only access to a temporal object,\n such as a date, time, offset or some combination of these.\n \n This is the base interface type for date, time and offset objects.\n It is implemented by those classes that can provide information\n as fields or queries.\n \n Most date and time information can be represented as a number.\n These are modeled using TemporalField with the number held using\n a long to handle large values. Year, month and day-of-month are\n simple examples of fields, but they also include instant and offsets.\n See ChronoField for the standard set of fields.\n \n Two pieces of date/time information cannot be represented by numbers,\n the chronology and the\n time-zone.\n These can be accessed via queries using\n the static methods defined on TemporalQuery.\n \n A sub-interface, Temporal, extends this definition to one that also\n supports adjustment and manipulation on more complete temporal objects.\n \n This interface is a framework-level interface that should not be widely\n used in application code. Instead, applications should create and pass\n around instances of concrete types, such as LocalDate.\n There are many reasons for this, part of which is that implementations\n of this interface may be in calendar systems other than ISO.\n See ChronoLocalDate for a fuller discussion of the issues.", "codes": ["public interface TemporalAccessor"], "fields": [], "methods": [{"method_name": "isSupported", "method_sig": "boolean isSupported (TemporalField field)", "description": "Checks if the specified field is supported.\n \n This checks if the date-time can be queried for the specified field.\n If false, then calling the range and get\n methods will throw an exception."}, {"method_name": "range", "method_sig": "default ValueRange range (TemporalField field)", "description": "Gets the range of valid values for the specified field.\n \n All fields can be expressed as a long integer.\n This method returns an object that describes the valid range for that value.\n The value of this temporal object is used to enhance the accuracy of the returned range.\n If the date-time cannot return the range, because the field is unsupported or for\n some other reason, an exception will be thrown.\n \n Note that the result only describes the minimum and maximum valid values\n and it is important not to read too much into them. For example, there\n could be values within the range that are invalid for the field."}, {"method_name": "get", "method_sig": "default int get (TemporalField field)", "description": "Gets the value of the specified field as an int.\n \n This queries the date-time for the value of the specified field.\n The returned value will always be within the valid range of values for the field.\n If the date-time cannot return the value, because the field is unsupported or for\n some other reason, an exception will be thrown."}, {"method_name": "getLong", "method_sig": "long getLong (TemporalField field)", "description": "Gets the value of the specified field as a long.\n \n This queries the date-time for the value of the specified field.\n The returned value may be outside the valid range of values for the field.\n If the date-time cannot return the value, because the field is unsupported or for\n some other reason, an exception will be thrown."}, {"method_name": "query", "method_sig": "default <R> R query (TemporalQuery<R> query)", "description": "Queries this date-time.\n \n This queries this date-time using the specified query strategy object.\n \n Queries are a key tool for extracting information from date-times.\n They exists to externalize the process of querying, permitting different\n approaches, as per the strategy design pattern.\n Examples might be a query that checks if the date is the day before February 29th\n in a leap year, or calculates the number of days to your next birthday.\n \n The most common query implementations are method references, such as\n LocalDate::from and ZoneId::from.\n Additional implementations are provided as static methods on TemporalQuery."}]}