{"name": "Interface TemporalField", "module": "java.base", "package": "java.time.temporal", "text": "A field of date-time, such as month-of-year or hour-of-minute.\n \n Date and time is expressed using fields which partition the time-line into something\n meaningful for humans. Implementations of this interface represent those fields.\n \n The most commonly used units are defined in ChronoField.\n Further fields are supplied in IsoFields, WeekFields and JulianFields.\n Fields can also be written by application code by implementing this interface.\n \n The field works using double dispatch. Client code calls methods on a date-time like\n LocalDateTime which check if the field is a ChronoField.\n If it is, then the date-time must handle it.\n Otherwise, the method call is re-dispatched to the matching method in this interface.", "codes": ["public interface TemporalField"], "fields": [], "methods": [{"method_name": "getDisplayName", "method_sig": "default String getDisplayName (Locale locale)", "description": "Gets the display name for the field in the requested locale.\n \n If there is no display name for the locale then a suitable default must be returned.\n \n The default implementation must check the locale is not null\n and return toString()."}, {"method_name": "getBaseUnit", "method_sig": "TemporalUnit getBaseUnit()", "description": "Gets the unit that the field is measured in.\n \n The unit of the field is the period that varies within the range.\n For example, in the field 'MonthOfYear', the unit is 'Months'.\n See also getRangeUnit()."}, {"method_name": "getRangeUnit", "method_sig": "TemporalUnit getRangeUnit()", "description": "Gets the range that the field is bound by.\n \n The range of the field is the period that the field varies within.\n For example, in the field 'MonthOfYear', the range is 'Years'.\n See also getBaseUnit().\n \n The range is never null. For example, the 'Year' field is shorthand for\n 'YearOfForever'. It therefore has a unit of 'Years' and a range of 'Forever'."}, {"method_name": "range", "method_sig": "ValueRange range()", "description": "Gets the range of valid values for the field.\n \n All fields can be expressed as a long integer.\n This method returns an object that describes the valid range for that value.\n This method is generally only applicable to the ISO-8601 calendar system.\n \n Note that the result only describes the minimum and maximum valid values\n and it is important not to read too much into them. For example, there\n could be values within the range that are invalid for the field."}, {"method_name": "isDateBased", "method_sig": "boolean isDateBased()", "description": "Checks if this field represents a component of a date.\n \n A field is date-based if it can be derived from\n EPOCH_DAY.\n Note that it is valid for both isDateBased() and isTimeBased()\n to return false, such as when representing a field like minute-of-week."}, {"method_name": "isTimeBased", "method_sig": "boolean isTimeBased()", "description": "Checks if this field represents a component of a time.\n \n A field is time-based if it can be derived from\n NANO_OF_DAY.\n Note that it is valid for both isDateBased() and isTimeBased()\n to return false, such as when representing a field like minute-of-week."}, {"method_name": "isSupportedBy", "method_sig": "boolean isSupportedBy (TemporalAccessor temporal)", "description": "Checks if this field is supported by the temporal object.\n \n This determines whether the temporal accessor supports this field.\n If this returns false, then the temporal cannot be queried for this field.\n \n There are two equivalent ways of using this method.\n The first is to invoke this method directly.\n The second is to use TemporalAccessor.isSupported(TemporalField):\n \n   // these two lines are equivalent, but the second approach is recommended\n   temporal = thisField.isSupportedBy(temporal);\n   temporal = temporal.isSupported(thisField);\n \n It is recommended to use the second approach, isSupported(TemporalField),\n as it is a lot clearer to read in code.\n \n Implementations should determine whether they are supported using the fields\n available in ChronoField."}, {"method_name": "rangeRefinedBy", "method_sig": "ValueRange rangeRefinedBy (TemporalAccessor temporal)", "description": "Get the range of valid values for this field using the temporal object to\n refine the result.\n \n This uses the temporal object to find the range of valid values for the field.\n This is similar to range(), however this method refines the result\n using the temporal. For example, if the field is DAY_OF_MONTH the\n range method is not accurate as there are four possible month lengths,\n 28, 29, 30 and 31 days. Using this method with a date allows the range to be\n accurate, returning just one of those four options.\n \n There are two equivalent ways of using this method.\n The first is to invoke this method directly.\n The second is to use TemporalAccessor.range(TemporalField):\n \n   // these two lines are equivalent, but the second approach is recommended\n   temporal = thisField.rangeRefinedBy(temporal);\n   temporal = temporal.range(thisField);\n \n It is recommended to use the second approach, range(TemporalField),\n as it is a lot clearer to read in code.\n \n Implementations should perform any queries or calculations using the fields\n available in ChronoField.\n If the field is not supported an UnsupportedTemporalTypeException must be thrown."}, {"method_name": "getFrom", "method_sig": "long getFrom (TemporalAccessor temporal)", "description": "Gets the value of this field from the specified temporal object.\n \n This queries the temporal object for the value of this field.\n \n There are two equivalent ways of using this method.\n The first is to invoke this method directly.\n The second is to use TemporalAccessor.getLong(TemporalField)\n (or TemporalAccessor.get(TemporalField)):\n \n   // these two lines are equivalent, but the second approach is recommended\n   temporal = thisField.getFrom(temporal);\n   temporal = temporal.getLong(thisField);\n \n It is recommended to use the second approach, getLong(TemporalField),\n as it is a lot clearer to read in code.\n \n Implementations should perform any queries or calculations using the fields\n available in ChronoField.\n If the field is not supported an UnsupportedTemporalTypeException must be thrown."}, {"method_name": "adjustInto", "method_sig": "<R extends Temporal> R adjustInto (R temporal,\n                                  long newValue)", "description": "Returns a copy of the specified temporal object with the value of this field set.\n \n This returns a new temporal object based on the specified one with the value for\n this field changed. For example, on a LocalDate, this could be used to\n set the year, month or day-of-month.\n The returned object has the same observable type as the specified object.\n \n In some cases, changing a field is not fully defined. For example, if the target object is\n a date representing the 31st January, then changing the month to February would be unclear.\n In cases like this, the implementation is responsible for resolving the result.\n Typically it will choose the previous valid date, which would be the last valid\n day of February in this example.\n \n There are two equivalent ways of using this method.\n The first is to invoke this method directly.\n The second is to use Temporal.with(TemporalField, long):\n \n   // these two lines are equivalent, but the second approach is recommended\n   temporal = thisField.adjustInto(temporal);\n   temporal = temporal.with(thisField);\n \n It is recommended to use the second approach, with(TemporalField),\n as it is a lot clearer to read in code.\n \n Implementations should perform any queries or calculations using the fields\n available in ChronoField.\n If the field is not supported an UnsupportedTemporalTypeException must be thrown.\n \n Implementations must not alter the specified temporal object.\n Instead, an adjusted copy of the original must be returned.\n This provides equivalent, safe behavior for immutable and mutable implementations."}, {"method_name": "resolve", "method_sig": "default TemporalAccessor resolve (Map<TemporalField, Long> fieldValues,\n                                 TemporalAccessor partialTemporal,\n                                 ResolverStyle resolverStyle)", "description": "Resolves this field to provide a simpler alternative or a date.\n \n This method is invoked during the resolve phase of parsing.\n It is designed to allow application defined fields to be simplified into\n more standard fields, such as those on ChronoField, or into a date.\n \n Applications should not normally invoke this method directly."}, {"method_name": "toString", "method_sig": "String toString()", "description": "Gets a descriptive name for the field.\n \n The should be of the format 'BaseOfRange', such as 'MonthOfYear',\n unless the field has a range of FOREVER, when only\n the base unit is mentioned, such as 'Year' or 'Era'."}]}