{"name": "Interface Templates", "module": "java.xml", "package": "javax.xml.transform", "text": "An object that implements this interface is the runtime representation of processed\n transformation instructions.\n\n Templates must be threadsafe for a given instance\n over multiple threads running concurrently, and may\n be used multiple times in a given session.", "codes": ["public interface Templates"], "fields": [], "methods": [{"method_name": "newTransformer", "method_sig": "Transformer newTransformer()\n                    throws TransformerConfigurationException", "description": "Create a new transformation context for this Templates object."}, {"method_name": "getOutputProperties", "method_sig": "Properties getOutputProperties()", "description": "Get the properties corresponding to the effective xsl:output element.\n The object returned will\n be a clone of the internal values. Accordingly, it can be mutated\n without mutating the Templates object, and then handed in to\n Transformer.setOutputProperties(java.util.Properties).\n\n The properties returned should contain properties set by the stylesheet,\n and these properties are \"defaulted\" by default properties specified by\n section 16 of the\n XSL Transformations (XSLT) W3C Recommendation.  The properties that\n were specifically set by the stylesheet should be in the base\n Properties list, while the XSLT default properties that were not\n specifically set should be in the \"default\" Properties list.  Thus,\n getOutputProperties().getProperty(String key) will obtain any\n property in that was set by the stylesheet, or the default\n properties, while\n getOutputProperties().get(String key) will only retrieve properties\n that were explicitly set in the stylesheet.\nFor XSLT,\n Attribute\n Value Templates attribute values will\n be returned unexpanded (since there is no context at this point).  The\n namespace prefixes inside Attribute Value Templates will be unexpanded,\n so that they remain valid XPath values."}]}