{"name": "Class Thread", "module": "java.base", "package": "java.lang", "text": "A thread is a thread of execution in a program. The Java\n Virtual Machine allows an application to have multiple threads of\n execution running concurrently.\n \n Every thread has a priority. Threads with higher priority are\n executed in preference to threads with lower priority. Each thread\n may or may not also be marked as a daemon. When code running in\n some thread creates a new Thread object, the new\n thread has its priority initially set equal to the priority of the\n creating thread, and is a daemon thread if and only if the\n creating thread is a daemon.\n \n When a Java Virtual Machine starts up, there is usually a single\n non-daemon thread (which typically calls the method named\n main of some designated class). The Java Virtual\n Machine continues to execute threads until either of the following\n occurs:\n \nThe exit method of class Runtime has been\n     called and the security manager has permitted the exit operation\n     to take place.\n All threads that are not daemon threads have died, either by\n     returning from the call to the run method or by\n     throwing an exception that propagates beyond the run\n     method.\n \n\n There are two ways to create a new thread of execution. One is to\n declare a class to be a subclass of Thread. This\n subclass should override the run method of class\n Thread. An instance of the subclass can then be\n allocated and started. For example, a thread that computes primes\n larger than a stated value could be written as follows:\n \n     class PrimeThread extends Thread {\n         long minPrime;\n         PrimeThread(long minPrime) {\n             this.minPrime = minPrime;\n         }\n\n         public void run() {\n             // compute primes larger than minPrime\n              . . .\n         }\n     }\n \n\n The following code would then create a thread and start it running:\n \n     PrimeThread p = new PrimeThread(143);\n     p.start();\n \n\n The other way to create a thread is to declare a class that\n implements the Runnable interface. That class then\n implements the run method. An instance of the class can\n then be allocated, passed as an argument when creating\n Thread, and started. The same example in this other\n style looks like the following:\n \n     class PrimeRun implements Runnable {\n         long minPrime;\n         PrimeRun(long minPrime) {\n             this.minPrime = minPrime;\n         }\n\n         public void run() {\n             // compute primes larger than minPrime\n              . . .\n         }\n     }\n \n\n The following code would then create a thread and start it running:\n \n     PrimeRun p = new PrimeRun(143);\n     new Thread(p).start();\n \n\n Every thread has a name for identification purposes. More than\n one thread may have the same name. If a name is not specified when\n a thread is created, a new name is generated for it.\n \n Unless otherwise noted, passing a null argument to a constructor\n or method in this class will cause a NullPointerException to be\n thrown.", "codes": ["public class Thread\nextends Object\nimplements Runnable"], "fields": [{"field_name": "MIN_PRIORITY", "field_sig": "public static final int MIN_PRIORITY", "description": "The minimum priority that a thread can have."}, {"field_name": "NORM_PRIORITY", "field_sig": "public static final int NORM_PRIORITY", "description": "The default priority that is assigned to a thread."}, {"field_name": "MAX_PRIORITY", "field_sig": "public static final int MAX_PRIORITY", "description": "The maximum priority that a thread can have."}], "methods": [{"method_name": "currentThread", "method_sig": "public static Thread currentThread()", "description": "Returns a reference to the currently executing thread object."}, {"method_name": "yield", "method_sig": "public static void yield()", "description": "A hint to the scheduler that the current thread is willing to yield\n its current use of a processor. The scheduler is free to ignore this\n hint.\n\n  Yield is a heuristic attempt to improve relative progression\n between threads that would otherwise over-utilise a CPU. Its use\n should be combined with detailed profiling and benchmarking to\n ensure that it actually has the desired effect.\n\n  It is rarely appropriate to use this method. It may be useful\n for debugging or testing purposes, where it may help to reproduce\n bugs due to race conditions. It may also be useful when designing\n concurrency control constructs such as the ones in the\n java.util.concurrent.locks package."}, {"method_name": "sleep", "method_sig": "public static void sleep (long millis)\n                  throws InterruptedException", "description": "Causes the currently executing thread to sleep (temporarily cease\n execution) for the specified number of milliseconds, subject to\n the precision and accuracy of system timers and schedulers. The thread\n does not lose ownership of any monitors."}, {"method_name": "sleep", "method_sig": "public static void sleep (long millis,\n                         int nanos)\n                  throws InterruptedException", "description": "Causes the currently executing thread to sleep (temporarily cease\n execution) for the specified number of milliseconds plus the specified\n number of nanoseconds, subject to the precision and accuracy of system\n timers and schedulers. The thread does not lose ownership of any\n monitors."}, {"method_name": "onSpinWait", "method_sig": "public static void onSpinWait()", "description": "Indicates that the caller is momentarily unable to progress, until the\n occurrence of one or more actions on the part of other activities. By\n invoking this method within each iteration of a spin-wait loop construct,\n the calling thread indicates to the runtime that it is busy-waiting.\n The runtime may take action to improve the performance of invoking\n spin-wait loop constructions."}, {"method_name": "clone", "method_sig": "protected Object clone()\n                throws CloneNotSupportedException", "description": "Throws CloneNotSupportedException as a Thread can not be meaningfully\n cloned. Construct a new Thread instead."}, {"method_name": "start", "method_sig": "public void start()", "description": "Causes this thread to begin execution; the Java Virtual Machine\n calls the run method of this thread.\n \n The result is that two threads are running concurrently: the\n current thread (which returns from the call to the\n start method) and the other thread (which executes its\n run method).\n \n It is never legal to start a thread more than once.\n In particular, a thread may not be restarted once it has completed\n execution."}, {"method_name": "run", "method_sig": "public void run()", "description": "If this thread was constructed using a separate\n Runnable run object, then that\n Runnable object's run method is called;\n otherwise, this method does nothing and returns.\n \n Subclasses of Thread should override this method."}, {"method_name": "stop", "method_sig": "@Deprecated(since=\"1.2\")\npublic final void stop()", "description": "Forces the thread to stop executing.\n \n If there is a security manager installed, its checkAccess\n method is called with this\n as its argument. This may result in a\n SecurityException being raised (in the current thread).\n \n If this thread is different from the current thread (that is, the current\n thread is trying to stop a thread other than itself), the\n security manager's checkPermission method (with a\n RuntimePermission(\"stopThread\") argument) is called in\n addition.\n Again, this may result in throwing a\n SecurityException (in the current thread).\n \n The thread represented by this thread is forced to stop whatever\n it is doing abnormally and to throw a newly created\n ThreadDeath object as an exception.\n \n It is permitted to stop a thread that has not yet been started.\n If the thread is eventually started, it immediately terminates.\n \n An application should not normally try to catch\n ThreadDeath unless it must do some extraordinary\n cleanup operation (note that the throwing of\n ThreadDeath causes finally clauses of\n try statements to be executed before the thread\n officially dies).  If a catch clause catches a\n ThreadDeath object, it is important to rethrow the\n object so that the thread actually dies.\n \n The top-level error handler that reacts to otherwise uncaught\n exceptions does not print out a message or otherwise notify the\n application if the uncaught exception is an instance of\n ThreadDeath."}, {"method_name": "interrupt", "method_sig": "public void interrupt()", "description": "Interrupts this thread.\n\n  Unless the current thread is interrupting itself, which is\n always permitted, the checkAccess method\n of this thread is invoked, which may cause a SecurityException to be thrown.\n\n  If this thread is blocked in an invocation of the wait(), wait(long), or wait(long, int) methods of the Object\n class, or of the join(), join(long), join(long, int), sleep(long), or sleep(long, int),\n methods of this class, then its interrupt status will be cleared and it\n will receive an InterruptedException.\n\n  If this thread is blocked in an I/O operation upon an InterruptibleChannel\n then the channel will be closed, the thread's interrupt\n status will be set, and the thread will receive a ClosedByInterruptException.\n\n  If this thread is blocked in a Selector\n then the thread's interrupt status will be set and it will return\n immediately from the selection operation, possibly with a non-zero\n value, just as if the selector's wakeup method were invoked.\n\n  If none of the previous conditions hold then this thread's interrupt\n status will be set. \n Interrupting a thread that is not alive need not have any effect."}, {"method_name": "interrupted", "method_sig": "public static boolean interrupted()", "description": "Tests whether the current thread has been interrupted.  The\n interrupted status of the thread is cleared by this method.  In\n other words, if this method were to be called twice in succession, the\n second call would return false (unless the current thread were\n interrupted again, after the first call had cleared its interrupted\n status and before the second call had examined it).\n\n A thread interruption ignored because a thread was not alive\n at the time of the interrupt will be reflected by this method\n returning false."}, {"method_name": "isInterrupted", "method_sig": "public boolean isInterrupted()", "description": "Tests whether this thread has been interrupted.  The interrupted\n status of the thread is unaffected by this method.\n\n A thread interruption ignored because a thread was not alive\n at the time of the interrupt will be reflected by this method\n returning false."}, {"method_name": "isAlive", "method_sig": "public final boolean isAlive()", "description": "Tests if this thread is alive. A thread is alive if it has\n been started and has not yet died."}, {"method_name": "suspend", "method_sig": "@Deprecated(since=\"1.2\")\npublic final void suspend()", "description": "Suspends this thread.\n \n First, the checkAccess method of this thread is called\n with no arguments. This may result in throwing a\n SecurityException (in the current thread).\n \n If the thread is alive, it is suspended and makes no further\n progress unless and until it is resumed."}, {"method_name": "resume", "method_sig": "@Deprecated(since=\"1.2\")\npublic final void resume()", "description": "Resumes a suspended thread.\n \n First, the checkAccess method of this thread is called\n with no arguments. This may result in throwing a\n SecurityException (in the current thread).\n \n If the thread is alive but suspended, it is resumed and is\n permitted to make progress in its execution."}, {"method_name": "setPriority", "method_sig": "public final void setPriority (int newPriority)", "description": "Changes the priority of this thread.\n \n First the checkAccess method of this thread is called\n with no arguments. This may result in throwing a SecurityException.\n \n Otherwise, the priority of this thread is set to the smaller of\n the specified newPriority and the maximum permitted\n priority of the thread's thread group."}, {"method_name": "getPriority", "method_sig": "public final int getPriority()", "description": "Returns this thread's priority."}, {"method_name": "setName", "method_sig": "public final void setName (String name)", "description": "Changes the name of this thread to be equal to the argument name.\n \n First the checkAccess method of this thread is called\n with no arguments. This may result in throwing a\n SecurityException."}, {"method_name": "getName", "method_sig": "public final String getName()", "description": "Returns this thread's name."}, {"method_name": "getThreadGroup", "method_sig": "public final ThreadGroup getThreadGroup()", "description": "Returns the thread group to which this thread belongs.\n This method returns null if this thread has died\n (been stopped)."}, {"method_name": "activeCount", "method_sig": "public static int activeCount()", "description": "Returns an estimate of the number of active threads in the current\n thread's thread group and its\n subgroups. Recursively iterates over all subgroups in the current\n thread's thread group.\n\n  The value returned is only an estimate because the number of\n threads may change dynamically while this method traverses internal\n data structures, and might be affected by the presence of certain\n system threads. This method is intended primarily for debugging\n and monitoring purposes."}, {"method_name": "enumerate", "method_sig": "public static int enumerate (Thread[] tarray)", "description": "Copies into the specified array every active thread in the current\n thread's thread group and its subgroups. This method simply\n invokes the ThreadGroup.enumerate(Thread[])\n method of the current thread's thread group.\n\n  An application might use the activeCount\n method to get an estimate of how big the array should be, however\n if the array is too short to hold all the threads, the extra threads\n are silently ignored.  If it is critical to obtain every active\n thread in the current thread's thread group and its subgroups, the\n invoker should verify that the returned int value is strictly less\n than the length of tarray.\n\n  Due to the inherent race condition in this method, it is recommended\n that the method only be used for debugging and monitoring purposes."}, {"method_name": "countStackFrames", "method_sig": "@Deprecated(since=\"1.2\",\n            forRemoval=true)\npublic int countStackFrames()", "description": "Counts the number of stack frames in this thread. The thread must\n be suspended."}, {"method_name": "join", "method_sig": "public final void join (long millis)\n                throws InterruptedException", "description": "Waits at most millis milliseconds for this thread to\n die. A timeout of 0 means to wait forever.\n\n  This implementation uses a loop of this.wait calls\n conditioned on this.isAlive. As a thread terminates the\n this.notifyAll method is invoked. It is recommended that\n applications not use wait, notify, or\n notifyAll on Thread instances."}, {"method_name": "join", "method_sig": "public final void join (long millis,\n                       int nanos)\n                throws InterruptedException", "description": "Waits at most millis milliseconds plus\n nanos nanoseconds for this thread to die.\n\n  This implementation uses a loop of this.wait calls\n conditioned on this.isAlive. As a thread terminates the\n this.notifyAll method is invoked. It is recommended that\n applications not use wait, notify, or\n notifyAll on Thread instances."}, {"method_name": "join", "method_sig": "public final void join()\n                throws InterruptedException", "description": "Waits for this thread to die.\n\n  An invocation of this method behaves in exactly the same\n way as the invocation\n\n \njoin(0)\n"}, {"method_name": "dumpStack", "method_sig": "public static void dumpStack()", "description": "Prints a stack trace of the current thread to the standard error stream.\n This method is used only for debugging."}, {"method_name": "setDaemon", "method_sig": "public final void setDaemon (boolean on)", "description": "Marks this thread as either a daemon thread\n or a user thread. The Java Virtual Machine exits when the only\n threads running are all daemon threads.\n\n  This method must be invoked before the thread is started."}, {"method_name": "isDaemon", "method_sig": "public final boolean isDaemon()", "description": "Tests if this thread is a daemon thread."}, {"method_name": "checkAccess", "method_sig": "public final void checkAccess()", "description": "Determines if the currently running thread has permission to\n modify this thread.\n \n If there is a security manager, its checkAccess method\n is called with this thread as its argument. This may result in\n throwing a SecurityException."}, {"method_name": "toString", "method_sig": "public String toString()", "description": "Returns a string representation of this thread, including the\n thread's name, priority, and thread group."}, {"method_name": "getContextClassLoader", "method_sig": "public ClassLoader getContextClassLoader()", "description": "Returns the context ClassLoader for this thread. The context\n ClassLoader is provided by the creator of the thread for use\n by code running in this thread when loading classes and resources.\n If not set, the default is the\n ClassLoader context of the parent thread. The context\n ClassLoader of the\n primordial thread is typically set to the class loader used to load the\n application."}, {"method_name": "setContextClassLoader", "method_sig": "public void setContextClassLoader (ClassLoader cl)", "description": "Sets the context ClassLoader for this Thread. The context\n ClassLoader can be set when a thread is created, and allows\n the creator of the thread to provide the appropriate class loader,\n through getContextClassLoader, to code running in the thread\n when loading classes and resources.\n\n If a security manager is present, its checkPermission\n method is invoked with a RuntimePermission\n (\"setContextClassLoader\") permission to see if setting the context\n ClassLoader is permitted."}, {"method_name": "holdsLock", "method_sig": "public static boolean holdsLock (Object obj)", "description": "Returns true if and only if the current thread holds the\n monitor lock on the specified object.\n\n This method is designed to allow a program to assert that\n the current thread already holds a specified lock:\n \n     assert Thread.holdsLock(obj);\n "}, {"method_name": "getStackTrace", "method_sig": "public StackTraceElement[] getStackTrace()", "description": "Returns an array of stack trace elements representing the stack dump\n of this thread.  This method will return a zero-length array if\n this thread has not started, has started but has not yet been\n scheduled to run by the system, or has terminated.\n If the returned array is of non-zero length then the first element of\n the array represents the top of the stack, which is the most recent\n method invocation in the sequence.  The last element of the array\n represents the bottom of the stack, which is the least recent method\n invocation in the sequence.\n\n If there is a security manager, and this thread is not\n the current thread, then the security manager's\n checkPermission method is called with a\n RuntimePermission(\"getStackTrace\") permission\n to see if it's ok to get the stack trace.\n\n Some virtual machines may, under some circumstances, omit one\n or more stack frames from the stack trace.  In the extreme case,\n a virtual machine that has no stack trace information concerning\n this thread is permitted to return a zero-length array from this\n method."}, {"method_name": "getAllStackTraces", "method_sig": "public static Map<Thread, StackTraceElement[]> getAllStackTraces()", "description": "Returns a map of stack traces for all live threads.\n The map keys are threads and each map value is an array of\n StackTraceElement that represents the stack dump\n of the corresponding Thread.\n The returned stack traces are in the format specified for\n the getStackTrace method.\n\n The threads may be executing while this method is called.\n The stack trace of each thread only represents a snapshot and\n each stack trace may be obtained at different time.  A zero-length\n array will be returned in the map value if the virtual machine has\n no stack trace information about a thread.\n\n If there is a security manager, then the security manager's\n checkPermission method is called with a\n RuntimePermission(\"getStackTrace\") permission as well as\n RuntimePermission(\"modifyThreadGroup\") permission\n to see if it is ok to get the stack trace of all threads."}, {"method_name": "getId", "method_sig": "public long getId()", "description": "Returns the identifier of this Thread.  The thread ID is a positive\n long number generated when this thread was created.\n The thread ID is unique and remains unchanged during its lifetime.\n When a thread is terminated, this thread ID may be reused."}, {"method_name": "getState", "method_sig": "public Thread.State getState()", "description": "Returns the state of this thread.\n This method is designed for use in monitoring of the system state,\n not for synchronization control."}, {"method_name": "setDefaultUncaughtExceptionHandler", "method_sig": "public static void setDefaultUncaughtExceptionHandler (Thread.UncaughtExceptionHandler eh)", "description": "Set the default handler invoked when a thread abruptly terminates\n due to an uncaught exception, and no other handler has been defined\n for that thread.\n\n Uncaught exception handling is controlled first by the thread, then\n by the thread's ThreadGroup object and finally by the default\n uncaught exception handler. If the thread does not have an explicit\n uncaught exception handler set, and the thread's thread group\n (including parent thread groups)  does not specialize its\n uncaughtException method, then the default handler's\n uncaughtException method will be invoked.\n By setting the default uncaught exception handler, an application\n can change the way in which uncaught exceptions are handled (such as\n logging to a specific device, or file) for those threads that would\n already accept whatever \"default\" behavior the system\n provided.\n\n Note that the default uncaught exception handler should not usually\n defer to the thread's ThreadGroup object, as that could cause\n infinite recursion."}, {"method_name": "getDefaultUncaughtExceptionHandler", "method_sig": "public static Thread.UncaughtExceptionHandler getDefaultUncaughtExceptionHandler()", "description": "Returns the default handler invoked when a thread abruptly terminates\n due to an uncaught exception. If the returned value is null,\n there is no default."}, {"method_name": "getUncaughtExceptionHandler", "method_sig": "public Thread.UncaughtExceptionHandler getUncaughtExceptionHandler()", "description": "Returns the handler invoked when this thread abruptly terminates\n due to an uncaught exception. If this thread has not had an\n uncaught exception handler explicitly set then this thread's\n ThreadGroup object is returned, unless this thread\n has terminated, in which case null is returned."}, {"method_name": "setUncaughtExceptionHandler", "method_sig": "public void setUncaughtExceptionHandler (Thread.UncaughtExceptionHandler eh)", "description": "Set the handler invoked when this thread abruptly terminates\n due to an uncaught exception.\n A thread can take full control of how it responds to uncaught\n exceptions by having its uncaught exception handler explicitly set.\n If no such handler is set then the thread's ThreadGroup\n object acts as its handler."}]}