{"name": "Class ThreadLocal<T>", "module": "java.base", "package": "java.lang", "text": "This class provides thread-local variables.  These variables differ from\n their normal counterparts in that each thread that accesses one (via its\n get or set method) has its own, independently initialized\n copy of the variable.  ThreadLocal instances are typically private\n static fields in classes that wish to associate state with a thread (e.g.,\n a user ID or Transaction ID).\n\n For example, the class below generates unique identifiers local to each\n thread.\n A thread's id is assigned the first time it invokes ThreadId.get()\n and remains unchanged on subsequent calls.\n \n import java.util.concurrent.atomic.AtomicInteger;\n\n public class ThreadId {\n     // Atomic integer containing the next thread ID to be assigned\n     private static final AtomicInteger nextId = new AtomicInteger(0);\n\n     // Thread local variable containing each thread's ID\n     private static final ThreadLocal<Integer> threadId =\n         new ThreadLocal<Integer>() {\n             @Override protected Integer initialValue() {\n                 return nextId.getAndIncrement();\n         }\n     };\n\n     // Returns the current thread's unique ID, assigning it if necessary\n     public static int get() {\n         return threadId.get();\n     }\n }\n \nEach thread holds an implicit reference to its copy of a thread-local\n variable as long as the thread is alive and the ThreadLocal\n instance is accessible; after a thread goes away, all of its copies of\n thread-local instances are subject to garbage collection (unless other\n references to these copies exist).", "codes": ["public class ThreadLocal<T>\nextends Object"], "fields": [], "methods": [{"method_name": "initialValue", "method_sig": "protected T initialValue()", "description": "Returns the current thread's \"initial value\" for this\n thread-local variable.  This method will be invoked the first\n time a thread accesses the variable with the get()\n method, unless the thread previously invoked the set(T)\n method, in which case the initialValue method will not\n be invoked for the thread.  Normally, this method is invoked at\n most once per thread, but it may be invoked again in case of\n subsequent invocations of remove() followed by get().\n\n This implementation simply returns null; if the\n programmer desires thread-local variables to have an initial\n value other than null, ThreadLocal must be\n subclassed, and this method overridden.  Typically, an\n anonymous inner class will be used."}, {"method_name": "withInitial", "method_sig": "public static <S> ThreadLocal<S> withInitial (Supplier<? extends S> supplier)", "description": "Creates a thread local variable. The initial value of the variable is\n determined by invoking the get method on the Supplier."}, {"method_name": "get", "method_sig": "public T get()", "description": "Returns the value in the current thread's copy of this\n thread-local variable.  If the variable has no value for the\n current thread, it is first initialized to the value returned\n by an invocation of the initialValue() method."}, {"method_name": "set", "method_sig": "public void set (T value)", "description": "Sets the current thread's copy of this thread-local variable\n to the specified value.  Most subclasses will have no need to\n override this method, relying solely on the initialValue()\n method to set the values of thread-locals."}, {"method_name": "remove", "method_sig": "public void remove()", "description": "Removes the current thread's value for this thread-local\n variable.  If this thread-local variable is subsequently\n read by the current thread, its value will be\n reinitialized by invoking its initialValue() method,\n unless its value is set by the current thread\n in the interim.  This may result in multiple invocations of the\n initialValue method in the current thread."}]}