{"name": "Class TimeZoneNameProvider", "module": "java.base", "package": "java.util.spi", "text": "An abstract class for service providers that\n provide localized time zone names for the\n TimeZone class.\n The localized time zone names available from the implementations of\n this class are also the source for the\n DateFormatSymbols.getZoneStrings() method.", "codes": ["public abstract class TimeZoneNameProvider\nextends LocaleServiceProvider"], "fields": [], "methods": [{"method_name": "getDisplayName", "method_sig": "public abstract String getDisplayName (String ID,\n                                      boolean daylight,\n                                      int style,\n                                      Locale locale)", "description": "Returns a name for the given time zone ID that's suitable for\n presentation to the user in the specified locale. The given time\n zone ID is \"GMT\" or one of the names defined using \"Zone\" entries\n in the \"tz database\", a public domain time zone database at\n ftp://elsie.nci.nih.gov/pub/.\n The data of this database is contained in a file whose name starts with\n \"tzdata\", and the specification of the data format is part of the zic.8\n man page, which is contained in a file whose name starts with \"tzcode\".\n \n If daylight is true, the method should return a name\n appropriate for daylight saving time even if the specified time zone\n has not observed daylight saving time in the past."}, {"method_name": "getGenericDisplayName", "method_sig": "public String getGenericDisplayName (String ID,\n                                    int style,\n                                    Locale locale)", "description": "Returns a generic name for the given time zone ID that's suitable\n for presentation to the user in the specified locale. Generic\n time zone names are neutral from standard time and daylight saving\n time. For example, \"PT\" is the short generic name of time zone ID \n America/Los_Angeles, while its short standard time and daylight saving\n time names are \"PST\" and \"PDT\", respectively. Refer to\n getDisplayName\n for valid time zone IDs.\n\n The default implementation of this method returns null."}]}