{"name": "Class TimerTask", "module": "java.base", "package": "java.util", "text": "A task that can be scheduled for one-time or repeated execution by a\n Timer.\n\n A timer task is not reusable.  Once a task has been scheduled\n for execution on a Timer or cancelled, subsequent attempts to\n schedule it for execution will throw IllegalStateException.", "codes": ["public abstract class TimerTask\nextends Object\nimplements Runnable"], "fields": [], "methods": [{"method_name": "run", "method_sig": "public abstract void run()", "description": "The action to be performed by this timer task."}, {"method_name": "cancel", "method_sig": "public boolean cancel()", "description": "Cancels this timer task.  If the task has been scheduled for one-time\n execution and has not yet run, or has not yet been scheduled, it will\n never run.  If the task has been scheduled for repeated execution, it\n will never run again.  (If the task is running when this call occurs,\n the task will run to completion, but will never run again.)\n\n Note that calling this method from within the run method of\n a repeating timer task absolutely guarantees that the timer task will\n not run again.\n\n This method may be called repeatedly; the second and subsequent\n calls have no effect."}, {"method_name": "scheduledExecutionTime", "method_sig": "public long scheduledExecutionTime()", "description": "Returns the scheduled execution time of the most recent\n actual execution of this task.  (If this method is invoked\n while task execution is in progress, the return value is the scheduled\n execution time of the ongoing task execution.)\n\n This method is typically invoked from within a task's run method, to\n determine whether the current execution of the task is sufficiently\n timely to warrant performing the scheduled activity:\n \n   public void run() {\n       if (System.currentTimeMillis() - scheduledExecutionTime() >=\n           MAX_TARDINESS)\n               return;  // Too late; skip this execution.\n       // Perform the task\n   }\n \n This method is typically not used in conjunction with\n fixed-delay execution repeating tasks, as their scheduled\n execution times are allowed to drift over time, and so are not terribly\n significant."}]}