{"name": "Class TrustAnchor", "module": "java.base", "package": "java.security.cert", "text": "A trust anchor or most-trusted Certification Authority (CA).\n \n This class represents a \"most-trusted CA\", which is used as a trust anchor\n for validating X.509 certification paths. A most-trusted CA includes the\n public key of the CA, the CA's name, and any constraints upon the set of\n paths which may be validated using this key. These parameters can be\n specified in the form of a trusted X509Certificate or as\n individual parameters.\n \nConcurrent Access\nAll TrustAnchor objects must be immutable and\n thread-safe. That is, multiple threads may concurrently invoke the\n methods defined in this class on a single TrustAnchor\n object (or more than one) with no ill effects. Requiring\n TrustAnchor objects to be immutable and thread-safe\n allows them to be passed around to various pieces of code without\n worrying about coordinating access. This stipulation applies to all\n public fields and methods of this class and any added or overridden\n by subclasses.", "codes": ["public class TrustAnchor\nextends Object"], "fields": [], "methods": [{"method_name": "getTrustedCert", "method_sig": "public final X509Certificate getTrustedCert()", "description": "Returns the most-trusted CA certificate."}, {"method_name": "getCA", "method_sig": "public final X500Principal getCA()", "description": "Returns the name of the most-trusted CA as an X500Principal."}, {"method_name": "getCAName", "method_sig": "public final String getCAName()", "description": "Returns the name of the most-trusted CA in RFC 2253 String\n format."}, {"method_name": "getCAPublicKey", "method_sig": "public final PublicKey getCAPublicKey()", "description": "Returns the public key of the most-trusted CA."}, {"method_name": "getNameConstraints", "method_sig": "public final byte[] getNameConstraints()", "description": "Returns the name constraints parameter. The specified name constraints\n are associated with this trust anchor and are intended to be used\n as additional constraints when validating an X.509 certification path.\n \n The name constraints are returned as a byte array. This byte array\n contains the DER encoded form of the name constraints, as they\n would appear in the NameConstraints structure defined in RFC 5280\n and X.509. The ASN.1 notation for this structure is supplied in the\n documentation for\n TrustAnchor(X509Certificate trustedCert, byte[] nameConstraints) .\n \n Note that the byte array returned is cloned to protect against\n subsequent modifications."}, {"method_name": "toString", "method_sig": "public String toString()", "description": "Returns a formatted string describing the TrustAnchor."}]}