{"name": "Class URLClassLoader", "module": "java.base", "package": "java.net", "text": "This class loader is used to load classes and resources from a search\n path of URLs referring to both JAR files and directories. Any jar:\n scheme URL (see JarURLConnection) is assumed to refer to a\n JAR file.  Any file: scheme URL that ends with a '/' is assumed to\n refer to a directory. Otherwise, the URL is assumed to refer to a JAR file\n which will be opened as needed.\n \n This class loader supports the loading of classes and resources from the\n contents of a multi-release\n JAR file that is referred to by a given URL.\n \n The AccessControlContext of the thread that created the instance of\n URLClassLoader will be used when subsequently loading classes and\n resources.\n \n The classes that are loaded are by default granted permission only to\n access the URLs specified when the URLClassLoader was created.", "codes": ["public class URLClassLoader\nextends SecureClassLoader\nimplements Closeable"], "fields": [], "methods": [{"method_name": "getResourceAsStream", "method_sig": "public InputStream getResourceAsStream (String name)", "description": "Returns an input stream for reading the specified resource.\n If this loader is closed, then any resources opened by this method\n will be closed.\n\n  The search order is described in the documentation for ClassLoader.getResource(String).  "}, {"method_name": "close", "method_sig": "public void close()\n           throws IOException", "description": "Closes this URLClassLoader, so that it can no longer be used to load\n new classes or resources that are defined by this loader.\n Classes and resources defined by any of this loader's parents in the\n delegation hierarchy are still accessible. Also, any classes or resources\n that are already loaded, are still accessible.\n \n In the case of jar: and file: URLs, it also closes any files\n that were opened by it. If another thread is loading a\n class when the close method is invoked, then the result of\n that load is undefined.\n \n The method makes a best effort attempt to close all opened files,\n by catching IOExceptions internally. Unchecked exceptions\n and errors are not caught. Calling close on an already closed\n loader has no effect."}, {"method_name": "addURL", "method_sig": "protected void addURL (URL url)", "description": "Appends the specified URL to the list of URLs to search for\n classes and resources.\n \n If the URL specified is null or is already in the\n list of URLs, or if this loader is closed, then invoking this\n method has no effect."}, {"method_name": "getURLs", "method_sig": "public URL[] getURLs()", "description": "Returns the search path of URLs for loading classes and resources.\n This includes the original list of URLs specified to the constructor,\n along with any URLs subsequently appended by the addURL() method."}, {"method_name": "findClass", "method_sig": "protected Class<?> findClass (String name)\n                      throws ClassNotFoundException", "description": "Finds and loads the class with the specified name from the URL search\n path. Any URLs referring to JAR files are loaded and opened as needed\n until the class is found."}, {"method_name": "definePackage", "method_sig": "protected Package definePackage (String name,\n                                Manifest man,\n                                URL url)", "description": "Defines a new package by name in this URLClassLoader.\n The attributes contained in the specified Manifest\n will be used to obtain package version and sealing information.\n For sealed packages, the additional URL specifies the code source URL\n from which the package was loaded."}, {"method_name": "findResource", "method_sig": "public URL findResource (String name)", "description": "Finds the resource with the specified name on the URL search path."}, {"method_name": "findResources", "method_sig": "public Enumeration<URL> findResources (String name)\n                               throws IOException", "description": "Returns an Enumeration of URLs representing all of the resources\n on the URL search path having the specified name."}, {"method_name": "getPermissions", "method_sig": "protected PermissionCollection getPermissions (CodeSource codesource)", "description": "Returns the permissions for the given codesource object.\n The implementation of this method first calls super.getPermissions\n and then adds permissions based on the URL of the codesource.\n \n If the protocol of this URL is \"jar\", then the permission granted\n is based on the permission that is required by the URL of the Jar\n file.\n \n If the protocol is \"file\" and there is an authority component, then\n permission to connect to and accept connections from that authority\n may be granted. If the protocol is \"file\"\n and the path specifies a file, then permission to read that\n file is granted. If protocol is \"file\" and the path is\n a directory, permission is granted to read all files\n and (recursively) all files and subdirectories contained in\n that directory.\n \n If the protocol is not \"file\", then permission\n to connect to and accept connections from the URL's host is granted."}, {"method_name": "newInstance", "method_sig": "public static URLClassLoader newInstance (URL[] urls,\n                                         ClassLoader parent)", "description": "Creates a new instance of URLClassLoader for the specified\n URLs and parent class loader. If a security manager is\n installed, the loadClass method of the URLClassLoader\n returned by this method will invoke the\n SecurityManager.checkPackageAccess method before\n loading the class."}, {"method_name": "newInstance", "method_sig": "public static URLClassLoader newInstance (URL[] urls)", "description": "Creates a new instance of URLClassLoader for the specified\n URLs and default parent class loader. If a security manager is\n installed, the loadClass method of the URLClassLoader\n returned by this method will invoke the\n SecurityManager.checkPackageAccess before\n loading the class."}]}