{"name": "Class UserPrincipalLookupService", "module": "java.base", "package": "java.nio.file.attribute", "text": "An object to lookup user and group principals by name. A UserPrincipal\n represents an identity that may be used to determine access rights to objects\n in a file system. A GroupPrincipal represents a group identity.\n A UserPrincipalLookupService defines methods to lookup identities by\n name or group name (which are typically user or account names). Whether names\n and group names are case sensitive or not depends on the implementation.\n The exact definition of a group is implementation specific but typically a\n group represents an identity created for administrative purposes so as to\n determine the access rights for the members of the group. In particular it is\n implementation specific if the namespace for names and groups is the\n same or is distinct. To ensure consistent and correct behavior across\n platforms it is recommended that this API be used as if the namespaces are\n distinct. In other words, the lookupPrincipalByName should be used to lookup users, and lookupPrincipalByGroupName should be used to\n lookup groups.", "codes": ["public abstract class UserPrincipalLookupService\nextends Object"], "fields": [], "methods": [{"method_name": "lookupPrincipalByName", "method_sig": "public abstract UserPrincipal lookupPrincipalByName (String name)\n                                             throws IOException", "description": "Lookup a user principal by name."}, {"method_name": "lookupPrincipalByGroupName", "method_sig": "public abstract GroupPrincipal lookupPrincipalByGroupName (String group)\n                                                   throws IOException", "description": "Lookup a group principal by group name.\n\n  Where an implementation does not support any notion of group then\n this method always throws UserPrincipalNotFoundException. Where\n the namespace for user accounts and groups is the same, then this method\n is identical to invoking lookupPrincipalByName."}]}