{"name": "Interface UserDefinedFileAttributeView", "module": "java.base", "package": "java.nio.file.attribute", "text": "A file attribute view that provides a view of a file's user-defined\n attributes, sometimes known as extended attributes. User-defined\n file attributes are used to store metadata with a file that is not meaningful\n to the file system. It is primarily intended for file system implementations\n that support such a capability directly but may be emulated. The details of\n such emulation are highly implementation specific and therefore not specified.\n\n  This FileAttributeView provides a view of a file's user-defined\n attributes as a set of name/value pairs, where the attribute name is\n represented by a String. An implementation may require to encode and\n decode from the platform or file system representation when accessing the\n attribute. The value has opaque content. This attribute view defines the\n read and write methods to read the value into\n or write from a ByteBuffer. This FileAttributeView is not\n intended for use where the size of an attribute value is larger than Integer.MAX_VALUE.\n\n  User-defined attributes may be used in some implementations to store\n security related attributes so consequently, in the case of the default\n provider at least, all methods that access user-defined attributes require the\n RuntimePermission(\"accessUserDefinedAttributes\") permission when a\n security manager is installed.\n\n  The supportsFileAttributeView method may be used to test if a specific FileStore supports the storage of user-defined\n attributes.\n\n  Where dynamic access to file attributes is required, the getAttribute method may be used to read\n the attribute value. The attribute value is returned as a byte array (byte[]).\n The setAttribute method may be used\n to write the value of a user-defined attribute from a buffer (as if by\n invoking the write method), or byte array (byte[]).", "codes": ["public interface UserDefinedFileAttributeView\nextends FileAttributeView"], "fields": [], "methods": [{"method_name": "name", "method_sig": "String name()", "description": "Returns the name of this attribute view. Attribute views of this type\n have the name \"user\"."}, {"method_name": "list", "method_sig": "List<String> list()\n           throws IOException", "description": "Returns a list containing the names of the user-defined attributes."}, {"method_name": "size", "method_sig": "int size (String name)\n  throws IOException", "description": "Returns the size of the value of a user-defined attribute."}, {"method_name": "read", "method_sig": "int read (String name,\n         ByteBuffer dst)\n  throws IOException", "description": "Read the value of a user-defined attribute into a buffer.\n\n  This method reads the value of the attribute into the given buffer\n as a sequence of bytes, failing if the number of bytes remaining in\n the buffer is insufficient to read the complete attribute value. The\n number of bytes transferred into the buffer is n, where n\n is the size of the attribute value. The first byte in the sequence is at\n index p and the last byte is at index p + n - 1, where\n p is the buffer's position. Upon return the buffer's position\n will be equal to p + n; its limit will not have changed.\n\n  Usage Example:\n Suppose we want to read a file's MIME type that is stored as a user-defined\n attribute with the name \"user.mimetype\".\n \n    UserDefinedFileAttributeView view =\n        Files.getFileAttributeView(path, UserDefinedFileAttributeView.class);\n    String name = \"user.mimetype\";\n    ByteBuffer buf = ByteBuffer.allocate(view.size(name));\n    view.read(name, buf);\n    buf.flip();\n    String value = Charset.defaultCharset().decode(buf).toString();\n "}, {"method_name": "write", "method_sig": "int write (String name,\n          ByteBuffer src)\n   throws IOException", "description": "Writes the value of a user-defined attribute from a buffer.\n\n  This method writes the value of the attribute from a given buffer as\n a sequence of bytes. The size of the value to transfer is r,\n where r is the number of bytes remaining in the buffer, that is\n src.remaining(). The sequence of bytes is transferred from the\n buffer starting at index p, where p is the buffer's\n position. Upon return, the buffer's position will be equal to \n p + n, where n is the number of bytes transferred; its limit\n will not have changed.\n\n  If an attribute of the given name already exists then its value is\n replaced. If the attribute does not exist then it is created. If it\n implementation specific if a test to check for the existence of the\n attribute and the creation of attribute are atomic with respect to other\n file system activities.\n\n  Where there is insufficient space to store the attribute, or the\n attribute name or value exceed an implementation specific maximum size\n then an IOException is thrown.\n\n  Usage Example:\n Suppose we want to write a file's MIME type as a user-defined attribute:\n \n    UserDefinedFileAttributeView view =\n        FIles.getFileAttributeView(path, UserDefinedFileAttributeView.class);\n    view.write(\"user.mimetype\", Charset.defaultCharset().encode(\"text/html\"));\n "}, {"method_name": "delete", "method_sig": "void delete (String name)\n     throws IOException", "description": "Deletes a user-defined attribute."}]}