{"name": "Class VirtualMachineDescriptor", "module": "jdk.attach", "package": "com.sun.tools.attach", "text": "Describes a Java virtual machine.\n\n  A VirtualMachineDescriptor is a container class used to\n describe a Java virtual machine. It encapsulates an identifier that identifies\n a target virtual machine, and a reference to the AttachProvider that should be used\n when attempting to attach to the virtual machine. The identifier is\n implementation-dependent but is typically the process identifier (or pid)\n environments where each Java virtual machine runs in its own operating system\n process. \n A VirtualMachineDescriptor also has a displayName.\n The display name is typically a human readable string that a tool might\n display to a user. For example, a tool that shows a list of Java\n virtual machines running on a system might use the display name rather\n than the identifier. A VirtualMachineDescriptor may be\n created without a display name. In that case the identifier is\n used as the display name.\n\n  VirtualMachineDescriptor instances are typically created by\n invoking the VirtualMachine.list()\n method. This returns the complete list of descriptors to describe the\n Java virtual machines known to all installed attach providers.", "codes": ["public class VirtualMachineDescriptor\nextends Object"], "fields": [], "methods": [{"method_name": "provider", "method_sig": "public AttachProvider provider()", "description": "Return the AttachProvider that this descriptor references."}, {"method_name": "id", "method_sig": "public String id()", "description": "Return the identifier component of this descriptor."}, {"method_name": "displayName", "method_sig": "public String displayName()", "description": "Return the display name component of this descriptor."}, {"method_name": "hashCode", "method_sig": "public int hashCode()", "description": "Returns a hash-code value for this VirtualMachineDescriptor. The hash\n code is based upon the descriptor's components, and satifies\n the general contract of the Object.hashCode method."}, {"method_name": "equals", "method_sig": "public boolean equals (Object ob)", "description": "Tests this VirtualMachineDescriptor for equality with another object.\n\n  If the given object is not a VirtualMachineDescriptor then this\n method returns false. For two VirtualMachineDescriptors to\n be considered equal requires that they both reference the same\n provider, and their identifiers are equal. \n This method satisfies the general contract of the Object.equals method. "}, {"method_name": "toString", "method_sig": "public String toString()", "description": "Returns the string representation of the VirtualMachineDescriptor."}]}