{"name": "Class WeekFields", "module": "java.base", "package": "java.time.temporal", "text": "Localized definitions of the day-of-week, week-of-month and week-of-year fields.\n \n A standard week is seven days long, but cultures have different definitions for some\n other aspects of a week. This class represents the definition of the week, for the\n purpose of providing TemporalField instances.\n \n WeekFields provides five fields,\n dayOfWeek(), weekOfMonth(), weekOfYear(),\n weekOfWeekBasedYear(), and weekBasedYear()\n that provide access to the values from any temporal object.\n \n The computations for day-of-week, week-of-month, and week-of-year are based\n on the  proleptic-year,\n month-of-year,\n day-of-month, and\n ISO day-of-week which are based on the\n epoch-day and the chronology.\n The values may not be aligned with the year-of-Era\n depending on the Chronology.\n A week is defined by:\n \nThe first day-of-week.\n For example, the ISO-8601 standard considers Monday to be the first day-of-week.\n The minimal number of days in the first week.\n For example, the ISO-8601 standard counts the first week as needing at least 4 days.\n \n Together these two values allow a year or month to be divided into weeks.\n\n Week of Month\n One field is used: week-of-month.\n The calculation ensures that weeks never overlap a month boundary.\n The month is divided into periods where each period starts on the defined first day-of-week.\n The earliest period is referred to as week 0 if it has less than the minimal number of days\n and week 1 if it has at least the minimal number of days.\n\n \nExamples of WeekFields\n\nDateDay-of-week\nFirst day: MondayMinimal days: 4First day: MondayMinimal days: 5\n\n\n2008-12-31Wednesday\nWeek 5 of December 2008Week 5 of December 2008\n2009-01-01Thursday\nWeek 1 of January 2009Week 0 of January 2009\n2009-01-04Sunday\nWeek 1 of January 2009Week 0 of January 2009\n2009-01-05Monday\nWeek 2 of January 2009Week 1 of January 2009\n\n\nWeek of Year\n One field is used: week-of-year.\n The calculation ensures that weeks never overlap a year boundary.\n The year is divided into periods where each period starts on the defined first day-of-week.\n The earliest period is referred to as week 0 if it has less than the minimal number of days\n and week 1 if it has at least the minimal number of days.\n\n Week Based Year\n Two fields are used for week-based-year, one for the\n week-of-week-based-year and one for\n week-based-year.  In a week-based-year, each week\n belongs to only a single year.  Week 1 of a year is the first week that\n starts on the first day-of-week and has at least the minimum number of days.\n The first and last weeks of a year may contain days from the\n previous calendar year or next calendar year respectively.\n\n \nExamples of WeekFields for week-based-year\n\nDateDay-of-week\nFirst day: MondayMinimal days: 4First day: MondayMinimal days: 5\n\n\n2008-12-31Wednesday\nWeek 1 of 2009Week 53 of 2008\n2009-01-01Thursday\nWeek 1 of 2009Week 53 of 2008\n2009-01-04Sunday\nWeek 1 of 2009Week 53 of 2008\n2009-01-05Monday\nWeek 2 of 2009Week 1 of 2009\n\n", "codes": ["public final class WeekFields\nextends Object\nimplements Serializable"], "fields": [{"field_name": "ISO", "field_sig": "public static final WeekFields ISO", "description": "The ISO-8601 definition, where a week starts on Monday and the first week\n has a minimum of 4 days.\n \n The ISO-8601 standard defines a calendar system based on weeks.\n It uses the week-based-year and week-of-week-based-year concepts to split\n up the passage of days instead of the standard year/month/day.\n \n Note that the first week may start in the previous calendar year.\n Note also that the first few days of a calendar year may be in the\n week-based-year corresponding to the previous calendar year."}, {"field_name": "SUNDAY_START", "field_sig": "public static final WeekFields SUNDAY_START", "description": "The common definition of a week that starts on Sunday and the first week\n has a minimum of 1 day.\n \n Defined as starting on Sunday and with a minimum of 1 day in the month.\n This week definition is in use in the US and other European countries."}, {"field_name": "WEEK_BASED_YEARS", "field_sig": "public static final TemporalUnit WEEK_BASED_YEARS", "description": "The unit that represents week-based-years for the purpose of addition and subtraction.\n \n This allows a number of week-based-years to be added to, or subtracted from, a date.\n The unit is equal to either 52 or 53 weeks.\n The estimated duration of a week-based-year is the same as that of a standard ISO\n year at 365.2425 Days.\n \n The rules for addition add the number of week-based-years to the existing value\n for the week-based-year field retaining the week-of-week-based-year\n and day-of-week, unless the week number it too large for the target year.\n In that case, the week is set to the last week of the year\n with the same day-of-week.\n \n This unit is an immutable and thread-safe singleton."}], "methods": [{"method_name": "of", "method_sig": "public static WeekFields of (Locale locale)", "description": "Obtains an instance of WeekFields appropriate for a locale.\n \n This will look up appropriate values from the provider of localization data.\n If the locale contains \"fw\" (First day of week) and/or \"rg\"\n (Region Override) \n Unicode extensions, returned instance will reflect the values specified with\n those extensions. If both \"fw\" and \"rg\" are specified, the value from\n the \"fw\" extension supersedes the implicit one from the \"rg\" extension."}, {"method_name": "of", "method_sig": "public static WeekFields of (DayOfWeek firstDayOfWeek,\n                            int minimalDaysInFirstWeek)", "description": "Obtains an instance of WeekFields from the first day-of-week and minimal days.\n \n The first day-of-week defines the ISO DayOfWeek that is day 1 of the week.\n The minimal number of days in the first week defines how many days must be present\n in a month or year, starting from the first day-of-week, before the week is counted\n as the first week. A value of 1 will count the first day of the month or year as part\n of the first week, whereas a value of 7 will require the whole seven days to be in\n the new month or year.\n \n WeekFields instances are singletons; for each unique combination\n of firstDayOfWeek and minimalDaysInFirstWeek\n the same instance will be returned."}, {"method_name": "getFirstDayOfWeek", "method_sig": "public DayOfWeek getFirstDayOfWeek()", "description": "Gets the first day-of-week.\n \n The first day-of-week varies by culture.\n For example, the US uses Sunday, while France and the ISO-8601 standard use Monday.\n This method returns the first day using the standard DayOfWeek enum."}, {"method_name": "getMinimalDaysInFirstWeek", "method_sig": "public int getMinimalDaysInFirstWeek()", "description": "Gets the minimal number of days in the first week.\n \n The number of days considered to define the first week of a month or year\n varies by culture.\n For example, the ISO-8601 requires 4 days (more than half a week) to\n be present before counting the first week."}, {"method_name": "dayOfWeek", "method_sig": "public TemporalField dayOfWeek()", "description": "Returns a field to access the day of week based on this WeekFields.\n \n This is similar to ChronoField.DAY_OF_WEEK but uses values for\n the day-of-week based on this WeekFields.\n The days are numbered from 1 to 7 where the\n first day-of-week is assigned the value 1.\n \n For example, if the first day-of-week is Sunday, then that will have the\n value 1, with other days ranging from Monday as 2 to Saturday as 7.\n \n In the resolving phase of parsing, a localized day-of-week will be converted\n to a standardized ChronoField day-of-week.\n The day-of-week must be in the valid range 1 to 7.\n Other fields in this class build dates using the standardized day-of-week."}, {"method_name": "weekOfMonth", "method_sig": "public TemporalField weekOfMonth()", "description": "Returns a field to access the week of month based on this WeekFields.\n \n This represents the concept of the count of weeks within the month where weeks\n start on a fixed day-of-week, such as Monday.\n This field is typically used with dayOfWeek().\n \n Week one (1) is the week starting on the getFirstDayOfWeek()\n where there are at least getMinimalDaysInFirstWeek() days in the month.\n Thus, week one may start up to minDays days before the start of the month.\n If the first week starts after the start of the month then the period before is week zero (0).\n \n For example:\n - if the 1st day of the month is a Monday, week one starts on the 1st and there is no week zero\n - if the 2nd day of the month is a Monday, week one starts on the 2nd and the 1st is in week zero\n - if the 4th day of the month is a Monday, week one starts on the 4th and the 1st to 3rd is in week zero\n - if the 5th day of the month is a Monday, week two starts on the 5th and the 1st to 4th is in week one\n\n This field can be used with any calendar system.\n \n In the resolving phase of parsing, a date can be created from a year,\n week-of-month, month-of-year and day-of-week.\n \n In strict mode, all four fields are\n validated against their range of valid values. The week-of-month field\n is validated to ensure that the resulting month is the month requested.\n \n In smart mode, all four fields are\n validated against their range of valid values. The week-of-month field\n is validated from 0 to 6, meaning that the resulting date can be in a\n different month to that specified.\n \n In lenient mode, the year and day-of-week\n are validated against the range of valid values. The resulting date is calculated\n equivalent to the following four stage approach.\n First, create a date on the first day of the first week of January in the requested year.\n Then take the month-of-year, subtract one, and add the amount in months to the date.\n Then take the week-of-month, subtract one, and add the amount in weeks to the date.\n Finally, adjust to the correct day-of-week within the localized week."}, {"method_name": "weekOfYear", "method_sig": "public TemporalField weekOfYear()", "description": "Returns a field to access the week of year based on this WeekFields.\n \n This represents the concept of the count of weeks within the year where weeks\n start on a fixed day-of-week, such as Monday.\n This field is typically used with dayOfWeek().\n \n Week one(1) is the week starting on the getFirstDayOfWeek()\n where there are at least getMinimalDaysInFirstWeek() days in the year.\n Thus, week one may start up to minDays days before the start of the year.\n If the first week starts after the start of the year then the period before is week zero (0).\n \n For example:\n - if the 1st day of the year is a Monday, week one starts on the 1st and there is no week zero\n - if the 2nd day of the year is a Monday, week one starts on the 2nd and the 1st is in week zero\n - if the 4th day of the year is a Monday, week one starts on the 4th and the 1st to 3rd is in week zero\n - if the 5th day of the year is a Monday, week two starts on the 5th and the 1st to 4th is in week one\n\n This field can be used with any calendar system.\n \n In the resolving phase of parsing, a date can be created from a year,\n week-of-year and day-of-week.\n \n In strict mode, all three fields are\n validated against their range of valid values. The week-of-year field\n is validated to ensure that the resulting year is the year requested.\n \n In smart mode, all three fields are\n validated against their range of valid values. The week-of-year field\n is validated from 0 to 54, meaning that the resulting date can be in a\n different year to that specified.\n \n In lenient mode, the year and day-of-week\n are validated against the range of valid values. The resulting date is calculated\n equivalent to the following three stage approach.\n First, create a date on the first day of the first week in the requested year.\n Then take the week-of-year, subtract one, and add the amount in weeks to the date.\n Finally, adjust to the correct day-of-week within the localized week."}, {"method_name": "weekOfWeekBasedYear", "method_sig": "public TemporalField weekOfWeekBasedYear()", "description": "Returns a field to access the week of a week-based-year based on this WeekFields.\n \n This represents the concept of the count of weeks within the year where weeks\n start on a fixed day-of-week, such as Monday and each week belongs to exactly one year.\n This field is typically used with dayOfWeek() and\n weekBasedYear().\n \n Week one(1) is the week starting on the getFirstDayOfWeek()\n where there are at least getMinimalDaysInFirstWeek() days in the year.\n If the first week starts after the start of the year then the period before\n is in the last week of the previous year.\n \n For example:\n - if the 1st day of the year is a Monday, week one starts on the 1st\n - if the 2nd day of the year is a Monday, week one starts on the 2nd and\n   the 1st is in the last week of the previous year\n - if the 4th day of the year is a Monday, week one starts on the 4th and\n   the 1st to 3rd is in the last week of the previous year\n - if the 5th day of the year is a Monday, week two starts on the 5th and\n   the 1st to 4th is in week one\n\n This field can be used with any calendar system.\n \n In the resolving phase of parsing, a date can be created from a week-based-year,\n week-of-year and day-of-week.\n \n In strict mode, all three fields are\n validated against their range of valid values. The week-of-year field\n is validated to ensure that the resulting week-based-year is the\n week-based-year requested.\n \n In smart mode, all three fields are\n validated against their range of valid values. The week-of-week-based-year field\n is validated from 1 to 53, meaning that the resulting date can be in the\n following week-based-year to that specified.\n \n In lenient mode, the year and day-of-week\n are validated against the range of valid values. The resulting date is calculated\n equivalent to the following three stage approach.\n First, create a date on the first day of the first week in the requested week-based-year.\n Then take the week-of-week-based-year, subtract one, and add the amount in weeks to the date.\n Finally, adjust to the correct day-of-week within the localized week."}, {"method_name": "weekBasedYear", "method_sig": "public TemporalField weekBasedYear()", "description": "Returns a field to access the year of a week-based-year based on this WeekFields.\n \n This represents the concept of the year where weeks start on a fixed day-of-week,\n such as Monday and each week belongs to exactly one year.\n This field is typically used with dayOfWeek() and\n weekOfWeekBasedYear().\n \n Week one(1) is the week starting on the getFirstDayOfWeek()\n where there are at least getMinimalDaysInFirstWeek() days in the year.\n Thus, week one may start before the start of the year.\n If the first week starts after the start of the year then the period before\n is in the last week of the previous year.\n \n This field can be used with any calendar system.\n \n In the resolving phase of parsing, a date can be created from a week-based-year,\n week-of-year and day-of-week.\n \n In strict mode, all three fields are\n validated against their range of valid values. The week-of-year field\n is validated to ensure that the resulting week-based-year is the\n week-based-year requested.\n \n In smart mode, all three fields are\n validated against their range of valid values. The week-of-week-based-year field\n is validated from 1 to 53, meaning that the resulting date can be in the\n following week-based-year to that specified.\n \n In lenient mode, the year and day-of-week\n are validated against the range of valid values. The resulting date is calculated\n equivalent to the following three stage approach.\n First, create a date on the first day of the first week in the requested week-based-year.\n Then take the week-of-week-based-year, subtract one, and add the amount in weeks to the date.\n Finally, adjust to the correct day-of-week within the localized week."}, {"method_name": "equals", "method_sig": "public boolean equals (Object object)", "description": "Checks if this WeekFields is equal to the specified object.\n \n The comparison is based on the entire state of the rules, which is\n the first day-of-week and minimal days."}, {"method_name": "hashCode", "method_sig": "public int hashCode()", "description": "A hash code for this WeekFields."}, {"method_name": "toString", "method_sig": "public String toString()", "description": "A string representation of this WeekFields instance."}]}