{"name": "Class XMLEncoder", "module": "java.desktop", "package": "java.beans", "text": "The XMLEncoder class is a complementary alternative to\n the ObjectOutputStream and can used to generate\n a textual representation of a JavaBean in the same\n way that the ObjectOutputStream can\n be used to create binary representation of Serializable\n objects. For example, the following fragment can be used to create\n a textual representation the supplied JavaBean\n and all its properties:\n \n       XMLEncoder e = new XMLEncoder(\n                          new BufferedOutputStream(\n                              new FileOutputStream(\"Test.xml\")));\n       e.writeObject(new JButton(\"Hello, world\"));\n       e.close();\n \n Despite the similarity of their APIs, the XMLEncoder\n class is exclusively designed for the purpose of archiving graphs\n of JavaBeans as textual representations of their public\n properties. Like Java source files, documents written this way\n have a natural immunity to changes in the implementations of the classes\n involved. The ObjectOutputStream continues to be recommended\n for interprocess communication and general purpose serialization.\n \n The XMLEncoder class provides a default denotation for\n JavaBeans in which they are represented as XML documents\n complying with version 1.0 of the XML specification and the\n UTF-8 character encoding of the Unicode/ISO 10646 character set.\n The XML documents produced by the XMLEncoder class are:\n \n\nPortable and version resilient: they have no dependencies\n on the private implementation of any class and so, like Java source\n files, they may be exchanged between environments which may have\n different versions of some of the classes and between VMs from\n different vendors.\n \nStructurally compact: The XMLEncoder class\n uses a redundancy elimination algorithm internally so that the\n default values of a Bean's properties are not written to the stream.\n \nFault tolerant: Non-structural errors in the file,\n caused either by damage to the file or by API changes\n made to classes in an archive remain localized\n so that a reader can report the error and continue to load the parts\n of the document which were not affected by the error.\n \n\n Below is an example of an XML archive containing\n some user interface components from the swing toolkit:\n \n <?xml version=\"1.0\" encoding=\"UTF-8\"?>\n <java version=\"1.0\" class=\"java.beans.XMLDecoder\">\n <object class=\"javax.swing.JFrame\">\n   <void property=\"name\">\n     <string>frame1</string>\n   </void>\n   <void property=\"bounds\">\n     <object class=\"java.awt.Rectangle\">\n       <int>0</int>\n       <int>0</int>\n       <int>200</int>\n       <int>200</int>\n     </object>\n   </void>\n   <void property=\"contentPane\">\n     <void method=\"add\">\n       <object class=\"javax.swing.JButton\">\n         <void property=\"label\">\n           <string>Hello</string>\n         </void>\n       </object>\n     </void>\n   </void>\n   <void property=\"visible\">\n     <boolean>true</boolean>\n   </void>\n </object>\n </java>\n \n The XML syntax uses the following conventions:\n \n\n Each element represents a method call.\n \n The \"object\" tag denotes an expression whose value is\n to be used as the argument to the enclosing element.\n \n The \"void\" tag denotes a statement which will\n be executed, but whose result will not be used as an\n argument to the enclosing method.\n \n Elements which contain elements use those elements as arguments,\n unless they have the tag: \"void\".\n \n The name of the method is denoted by the \"method\" attribute.\n \n XML's standard \"id\" and \"idref\" attributes are used to make\n references to previous expressions - so as to deal with\n circularities in the object graph.\n \n The \"class\" attribute is used to specify the target of a static\n method or constructor explicitly; its value being the fully\n qualified name of the class.\n \n Elements with the \"void\" tag are executed using\n the outer context as the target if no target is defined\n by a \"class\" attribute.\n \n Java's String class is treated specially and is\n written <string>Hello, world</string> where\n the characters of the string are converted to bytes\n using the UTF-8 character encoding.\n \n\n Although all object graphs may be written using just these three\n tags, the following definitions are included so that common\n data structures can be expressed more concisely:\n \n\n The default method name is \"new\".\n \n A reference to a java class is written in the form\n  <class>javax.swing.JButton</class>.\n \n Instances of the wrapper classes for Java's primitive types are written\n using the name of the primitive type as the tag. For example, an\n instance of the Integer class could be written:\n <int>123</int>. Note that the XMLEncoder class\n uses Java's reflection package in which the conversion between\n Java's primitive types and their associated \"wrapper classes\"\n is handled internally. The API for the XMLEncoder class\n itself deals only with Objects.\n \n In an element representing a nullary method whose name\n starts with \"get\", the \"method\" attribute is replaced\n with a \"property\" attribute whose value is given by removing\n the \"get\" prefix and decapitalizing the result.\n \n In an element representing a monadic method whose name\n starts with \"set\", the \"method\" attribute is replaced\n with a \"property\" attribute whose value is given by removing\n the \"set\" prefix and decapitalizing the result.\n \n In an element representing a method named \"get\" taking one\n integer argument, the \"method\" attribute is replaced\n with an \"index\" attribute whose value the value of the\n first argument.\n \n In an element representing a method named \"set\" taking two arguments,\n the first of which is an integer, the \"method\" attribute is replaced\n with an \"index\" attribute whose value the value of the\n first argument.\n \n A reference to an array is written using the \"array\"\n tag. The \"class\" and \"length\" attributes specify the\n sub-type of the array and its length respectively.\n \n\n For more information you might also want to check out\n \n Using XMLEncoder,\n an article in The Swing Connection.", "codes": ["public class XMLEncoder\nextends Encoder\nimplements AutoCloseable"], "fields": [], "methods": [{"method_name": "setOwner", "method_sig": "public void setOwner (Object owner)", "description": "Sets the owner of this encoder to owner."}, {"method_name": "getOwner", "method_sig": "public Object getOwner()", "description": "Gets the owner of this encoder."}, {"method_name": "writeObject", "method_sig": "public void writeObject (Object o)", "description": "Write an XML representation of the specified object to the output."}, {"method_name": "writeStatement", "method_sig": "public void writeStatement (Statement oldStm)", "description": "Records the Statement so that the Encoder will\n produce the actual output when the stream is flushed.\n \n This method should only be invoked within the context\n of initializing a persistence delegate."}, {"method_name": "writeExpression", "method_sig": "public void writeExpression (Expression oldExp)", "description": "Records the Expression so that the Encoder will\n produce the actual output when the stream is flushed.\n \n This method should only be invoked within the context of\n initializing a persistence delegate or setting up an encoder to\n read from a resource bundle.\n \n For more information about using resource bundles with the\n XMLEncoder, see\n \n Creating Internationalized Applications,"}, {"method_name": "flush", "method_sig": "public void flush()", "description": "This method writes out the preamble associated with the\n XML encoding if it has not been written already and\n then writes out all of the values that been\n written to the stream since the last time flush\n was called. After flushing, all internal references to the\n values that were written to this stream are cleared."}, {"method_name": "close", "method_sig": "public void close()", "description": "This method calls flush, writes the closing\n postamble and then closes the output stream associated\n with this stream."}]}