{"name": "Interface XPathEvaluator", "module": "jdk.xml.dom", "package": "org.w3c.dom.xpath", "text": "The evaluation of XPath expressions is provided by\n XPathEvaluator. In a DOM implementation which supports the\n XPath 3.0 feature, as described above, the XPathEvaluator\n interface will be implemented on the same object which implements the\n Document interface permitting it to be obtained by the usual\n binding-specific method such as casting or by using the DOM Level 3\n getInterface method. In this case the implementation obtained from the\n Document supports the XPath DOM module and is compatible with the XPath\n 1.0 specification.\n Evaluation of expressions with specialized extension functions or\n variables may not work in all implementations and is, therefore, not\n portable. XPathEvaluator implementations may be available\n from other sources that could provide specific support for specialized\n extension functions or variables as would be defined by other\n specifications.\n See also the Document Object Model (DOM) Level 3 XPath Specification.", "codes": ["public interface XPathEvaluator"], "fields": [], "methods": [{"method_name": "createExpression", "method_sig": "XPathExpression createExpression (String expression,\n                                 XPathNSResolver resolver)\n                          throws XPathException,\n                                 DOMException", "description": "Creates a parsed XPath expression with resolved namespaces. This is\n useful when an expression will be reused in an application since it\n makes it possible to compile the expression string into a more\n efficient internal form and preresolve all namespace prefixes which\n occur within the expression."}, {"method_name": "createNSResolver", "method_sig": "XPathNSResolver createNSResolver (Node nodeResolver)", "description": "Adapts any DOM node to resolve namespaces so that an XPath expression\n can be easily evaluated relative to the context of the node where it\n appeared within the document. This adapter works like the DOM Level 3\n method lookupNamespaceURI on nodes in resolving the\n namespaceURI from a given prefix using the current information\n available in the node's hierarchy at the time lookupNamespaceURI is\n called. also correctly resolving the implicit xml prefix."}, {"method_name": "evaluate", "method_sig": "Object evaluate (String expression,\n                Node contextNode,\n                XPathNSResolver resolver,\n                short type,\n                Object result)\n         throws XPathException,\n                DOMException", "description": "Evaluates an XPath expression string and returns a result of the\n specified type if possible."}]}