{"name": "Interface XPathNamespace", "module": "jdk.xml.dom", "package": "org.w3c.dom.xpath", "text": "The XPathNamespace interface is returned by\n XPathResult interfaces to represent the XPath namespace node\n type that DOM lacks. There is no public constructor for this node type.\n Attempts to place it into a hierarchy or a NamedNodeMap result in a\n DOMException with the code HIERARCHY_REQUEST_ERR\n . This node is read only, so methods or setting of attributes that would\n mutate the node result in a DOMException with the code\n NO_MODIFICATION_ALLOWED_ERR.\n The core specification describes attributes of the Node\n interface that are different for different node node types but does not\n describe XPATH_NAMESPACE_NODE, so here is a description of\n those attributes for this node type. All attributes of Node\n not described in this section have a null or\n false value.\n ownerDocument matches the ownerDocument of the\n ownerElement even if the element is later adopted.\n prefix is the prefix of the namespace represented by the\n node.\n nodeName is the same as prefix.\n nodeType is equal to XPATH_NAMESPACE_NODE.\n namespaceURI is the namespace URI of the namespace\n represented by the node.\n adoptNode, cloneNode, and\n importNode fail on this node type by raising a\n DOMException with the code NOT_SUPPORTED_ERR.In\n future versions of the XPath specification, the definition of a namespace\n node may be changed incomatibly, in which case incompatible changes to\n field values may be required to implement versions beyond XPath 1.0.\n See also the Document Object Model (DOM) Level 3 XPath Specification.", "codes": ["public interface XPathNamespace\nextends Node"], "fields": [{"field_name": "XPATH_NAMESPACE_NODE", "field_sig": "static final short XPATH_NAMESPACE_NODE", "description": "The node is a Namespace."}], "methods": [{"method_name": "getOwnerElement", "method_sig": "Element getOwnerElement()", "description": "The Element on which the namespace was in scope when it\n was requested. This does not change on a returned namespace node even\n if the document changes such that the namespace goes out of scope on\n that element and this node is no longer found there by XPath."}]}