{"name": "Class ZoneView", "module": "java.desktop", "package": "javax.swing.text", "text": "ZoneView is a View implementation that creates zones for which\n the child views are not created or stored until they are needed\n for display or model/view translations.  This enables a substantial\n reduction in memory consumption for situations where the model\n being represented is very large, by building view objects only for\n the region being actively viewed/edited.  The size of the children\n can be estimated in some way, or calculated asynchronously with\n only the result being saved.\n \n ZoneView extends BoxView to provide a box that implements\n zones for its children.  The zones are special View implementations\n (the children of an instance of this class) that represent only a\n portion of the model that an instance of ZoneView is responsible\n for.  The zones don't create child views until an attempt is made\n to display them. A box shaped view is well suited to this because:\n   \n\n   Boxes are a heavily used view, and having a box that\n   provides this behavior gives substantial opportunity\n   to plug the behavior into a view hierarchy from the\n   view factory.\n   \n   Boxes are tiled in one direction, so it is easy to\n   divide them into zones in a reliable way.\n   \n   Boxes typically have a simple relationship to the model (i.e. they\n   create child views that directly represent the child elements).\n   \n   Boxes are easier to estimate the size of than some other shapes.\n   \n\n The default behavior is controlled by two properties, maxZoneSize\n and maxZonesLoaded.  Setting maxZoneSize to Integer.MAX_VALUE would\n have the effect of causing only one zone to be created.  This would\n effectively turn the view into an implementation of the decorator\n pattern.  Setting maxZonesLoaded to a value of Integer.MAX_VALUE would\n cause zones to never be unloaded.  For simplicity, zones are created on\n boundaries represented by the child elements of the element the view is\n responsible for.  The zones can be any View implementation, but the\n default implementation is based upon AsyncBoxView which supports fairly\n large zones efficiently.", "codes": ["public class ZoneView\nextends BoxView"], "fields": [], "methods": [{"method_name": "getMaximumZoneSize", "method_sig": "public int getMaximumZoneSize()", "description": "Get the current maximum zone size."}, {"method_name": "setMaximumZoneSize", "method_sig": "public void setMaximumZoneSize (int size)", "description": "Set the desired maximum zone size.  A\n zone may get larger than this size if\n a single child view is larger than this\n size since zones are formed on child view\n boundaries."}, {"method_name": "getMaxZonesLoaded", "method_sig": "public int getMaxZonesLoaded()", "description": "Get the current setting of the number of zones\n allowed to be loaded at the same time."}, {"method_name": "setMaxZonesLoaded", "method_sig": "public void setMaxZonesLoaded (int mzl)", "description": "Sets the current setting of the number of zones\n allowed to be loaded at the same time. This will throw an\n IllegalArgumentException if mzl is less\n than 1."}, {"method_name": "zoneWasLoaded", "method_sig": "protected void zoneWasLoaded (View zone)", "description": "Called by a zone when it gets loaded.  This happens when\n an attempt is made to display or perform a model/view\n translation on a zone that was in an unloaded state.\n This is implemented to check if the maximum number of\n zones was reached and to unload the oldest zone if so."}, {"method_name": "unloadZone", "method_sig": "protected void unloadZone (View zone)", "description": "Unload a zone (Convert the zone to its memory saving state).\n The zones are expected to represent a subset of the\n child elements of the element this view is responsible for.\n Therefore, the default implementation is to simple remove\n all the children."}, {"method_name": "isZoneLoaded", "method_sig": "protected boolean isZoneLoaded (View zone)", "description": "Determine if a zone is in the loaded state.\n The zones are expected to represent a subset of the\n child elements of the element this view is responsible for.\n Therefore, the default implementation is to return\n true if the view has children.\n param zone the child view"}, {"method_name": "createZone", "method_sig": "protected View createZone (int p0,\n                          int p1)", "description": "Create a view to represent a zone for the given\n range within the model (which should be within\n the range of this objects responsibility).  This\n is called by the zone management logic to create\n new zones.  Subclasses can provide a different\n implementation for a zone by changing this method."}, {"method_name": "loadChildren", "method_sig": "protected void loadChildren (ViewFactory f)", "description": "Loads all of the children to initialize the view.\n This is called by the setParent method.\n This is reimplemented to not load any children directly\n (as they are created by the zones).  This method creates\n the initial set of zones.  Zones don't actually get\n populated however until an attempt is made to display\n them or to do model/view coordinate translation."}, {"method_name": "getViewIndexAtPosition", "method_sig": "protected int getViewIndexAtPosition (int pos)", "description": "Returns the child view index representing the given position in\n the model."}, {"method_name": "updateChildren", "method_sig": "protected boolean updateChildren (DocumentEvent.ElementChange ec,\n                                 DocumentEvent e,\n                                 ViewFactory f)", "description": "The superclass behavior will try to update the child views\n which is not desired in this case, since the children are\n zones and not directly effected by the changes to the\n associated element.  This is reimplemented to do nothing\n and return false."}, {"method_name": "insertUpdate", "method_sig": "public void insertUpdate (DocumentEvent changes,\n                         Shape a,\n                         ViewFactory f)", "description": "Gives notification that something was inserted into the document\n in a location that this view is responsible for.  This is largely\n delegated to the superclass, but is reimplemented to update the\n relevant zone (i.e. determine if a zone needs to be split into a\n set of 2 or more zones)."}, {"method_name": "removeUpdate", "method_sig": "public void removeUpdate (DocumentEvent changes,\n                         Shape a,\n                         ViewFactory f)", "description": "Gives notification that something was removed from the document\n in a location that this view is responsible for.  This is largely\n delegated to the superclass, but is reimplemented to update the\n relevant zones (i.e. determine if zones need to be removed or\n joined with another zone)."}]}